// AnimBlueprintGeneratedClass ABP_Player.ABP_Player_C
// Size: 0x34854 (Inherited: 0x530)
struct UABP_Player_C : UTigerPlayerAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x530(0x08)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_57; // 0x538(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_187; // 0x558(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_186; // 0x660(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_185; // 0x768(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_184; // 0x870(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_183; // 0x978(0x108)
	struct FAnimNode_Root AnimGraphNode_Root_10; // 0xa80(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_7; // 0xab0(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_47; // 0xbc8(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_104; // 0xd20(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_122; // 0xdc0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_121; // 0xde8(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_57; // 0xe10(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_46; // 0xe30(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_120; // 0xf88(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_182; // 0xfb0(0x108)
	struct FAnimNode_Slot AnimGraphNode_Slot_42; // 0x10b8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_41; // 0x1100(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_40; // 0x1148(0x48)
	struct FAnimNode_Root AnimGraphNode_Root_9; // 0x1190(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot_39; // 0x11c0(0x48)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_6; // 0x1208(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_45; // 0x1320(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_119; // 0x1478(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_118; // 0x14a0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_44; // 0x14c8(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_103; // 0x1620(0xa0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_5; // 0x16c0(0x190)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_102; // 0x1850(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_117; // 0x18f0(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_33; // 0x1918(0xc8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_71; // 0x19e0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_116; // 0x1aa0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_70; // 0x1ac8(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_115; // 0x1b88(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_114; // 0x1bb0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_113; // 0x1bd8(0x28)
	struct FAnimNode_Root AnimGraphNode_Root_8; // 0x1c00(0x30)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_37; // 0x1c30(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_164; // 0x1cf8(0x80)
	struct FAnimNode_PoseBlendNode AnimGraphNode_PoseBlendNode; // 0x1d78(0xa0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_5; // 0x1e18(0x118)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_163; // 0x1f30(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_32; // 0x1fb0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_162; // 0x2078(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_161; // 0x20f8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_160; // 0x2178(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_159; // 0x21f8(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_31; // 0x2278(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_30; // 0x2340(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_29; // 0x2408(0xc8)
	struct FAnimNode_Root AnimGraphNode_Root_7; // 0x24d0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_190; // 0x2500(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_189; // 0x2528(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_188; // 0x2550(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_187; // 0x2578(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_186; // 0x25a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_185; // 0x25c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_184; // 0x25f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_183; // 0x2618(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_182; // 0x2640(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_181; // 0x2668(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_180; // 0x2690(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_179; // 0x26b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_178; // 0x26e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_177; // 0x2708(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_176; // 0x2730(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_175; // 0x2758(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_158; // 0x2780(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_88; // 0x2800(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_157; // 0x2830(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_87; // 0x28b0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_156; // 0x28e0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_86; // 0x2960(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_104; // 0x2990(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_85; // 0x2a78(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_155; // 0x2aa8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_84; // 0x2b28(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_154; // 0x2b58(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_101; // 0x2bd8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_153; // 0x2c78(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_83; // 0x2cf8(0x30)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_56; // 0x2d28(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_56; // 0x2d48(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_181; // 0x2d68(0x108)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_103; // 0x2e70(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_82; // 0x2f58(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_23; // 0x2f88(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_152; // 0x3038(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_100; // 0x30b8(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_43; // 0x3158(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_69; // 0x31f8(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_43; // 0x32b8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_112; // 0x3410(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_111; // 0x3438(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_38; // 0x3460(0x48)
	struct FAnimNode_Root AnimGraphNode_Root_6; // 0x34a8(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_4; // 0x34d8(0x118)
	struct FAnimNode_Slot AnimGraphNode_Slot_37; // 0x35f0(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_68; // 0x3638(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_110; // 0x36f8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_99; // 0x3720(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_42; // 0x37c0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_109; // 0x3918(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_108; // 0x3940(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_28; // 0x3968(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_41; // 0x3a30(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_107; // 0x3b88(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_106; // 0x3bb0(0x28)
	struct FAnimNode_Root AnimGraphNode_Root_5; // 0x3bd8(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3; // 0x3c08(0x118)
	struct FAnimNode_Slot AnimGraphNode_Slot_36; // 0x3d20(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_67; // 0x3d68(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_40; // 0x3e28(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_105; // 0x3f80(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_104; // 0x3fa8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_39; // 0x3fd0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_103; // 0x4128(0x28)
	struct FAnimNode_Root AnimGraphNode_Root_4; // 0x4150(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0x4180(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_38; // 0x4298(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot_35; // 0x43f0(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_66; // 0x4438(0xc0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4; // 0x44f8(0x190)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_65; // 0x4688(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_98; // 0x4748(0xa0)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_14; // 0x47e8(0xb0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3; // 0x4898(0x190)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_97; // 0x4a28(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_37; // 0x4ac8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_102; // 0x4c20(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_101; // 0x4c48(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_100; // 0x4c70(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_99; // 0x4c98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_174; // 0x4cc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_173; // 0x4ce8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_172; // 0x4d10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_171; // 0x4d38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_170; // 0x4d60(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_151; // 0x4d88(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_81; // 0x4e08(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_150; // 0x4e38(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_80; // 0x4eb8(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_79; // 0x4ee8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_22; // 0x4f18(0xb0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_14; // 0x4fc8(0xd0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_64; // 0x5098(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_98; // 0x5158(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_63; // 0x5180(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_97; // 0x5240(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_62; // 0x5268(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_96; // 0x5328(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_96; // 0x5350(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_61; // 0x53f0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_95; // 0x54b0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_95; // 0x54d8(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_94; // 0x5578(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_93; // 0x55a0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_92; // 0x55c8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_91; // 0x55f0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_90; // 0x5618(0x28)
	struct FAnimNode_Root AnimGraphNode_Root_3; // 0x5640(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x5670(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_36; // 0x5788(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot_34; // 0x58e0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_33; // 0x5928(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_32; // 0x5970(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_31; // 0x59b8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_30; // 0x5a00(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_29; // 0x5a48(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_28; // 0x5a90(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_27; // 0x5ad8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_26; // 0x5b20(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_89; // 0x5b68(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_94; // 0x5b90(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_60; // 0x5c30(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_35; // 0x5cf0(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_34; // 0x5e48(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_93; // 0x5fa0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_92; // 0x6040(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_88; // 0x60e0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_87; // 0x6108(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_86; // 0x6130(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_85; // 0x6158(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_59; // 0x6180(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_33; // 0x6240(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_91; // 0x6398(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_58; // 0x6438(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_90; // 0x64f8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_89; // 0x6598(0xa0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x6638(0x190)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_84; // 0x67c8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_32; // 0x67f0(0x158)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_27; // 0x6948(0xc8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_169; // 0x6a10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_168; // 0x6a38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_167; // 0x6a60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_166; // 0x6a88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_165; // 0x6ab0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_149; // 0x6ad8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_78; // 0x6b58(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_148; // 0x6b88(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_77; // 0x6c08(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_76; // 0x6c38(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_21; // 0x6c68(0xb0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_13; // 0x6d18(0xd0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_102; // 0x6de8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_101; // 0x6ed0(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_88; // 0x6fb8(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_100; // 0x7058(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_99; // 0x7140(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_87; // 0x7228(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_86; // 0x72c8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_75; // 0x7368(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_20; // 0x7398(0xb0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_12; // 0x7448(0xd0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_85; // 0x7518(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_147; // 0x75b8(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_36; // 0x7638(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_83; // 0x7700(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_82; // 0x7728(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_31; // 0x7750(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_81; // 0x78a8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_80; // 0x78d0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_146; // 0x78f8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_84; // 0x7978(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_83; // 0x7a18(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_145; // 0x7ab8(0x80)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_180; // 0x7b38(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_179; // 0x7c40(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_178; // 0x7d48(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_177; // 0x7e50(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_176; // 0x7f58(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_175; // 0x8060(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_55; // 0x8168(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_55; // 0x8188(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_144; // 0x81a8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_82; // 0x8228(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_81; // 0x82c8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_143; // 0x8368(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_142; // 0x83e8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_74; // 0x8468(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_19; // 0x8498(0xb0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_57; // 0x8548(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_80; // 0x8608(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_79; // 0x86a8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_78; // 0x86d0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_56; // 0x86f8(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_55; // 0x87b8(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_30; // 0x8878(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_77; // 0x89d0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_79; // 0x89f8(0xa0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x8a98(0x190)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_76; // 0x8c28(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_75; // 0x8c50(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_74; // 0x8c78(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_78; // 0x8ca0(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_54; // 0x8d40(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_73; // 0x8e00(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_72; // 0x8e28(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_71; // 0x8e50(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_70; // 0x8e78(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_69; // 0x8ea0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_53; // 0x8ec8(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_68; // 0x8f88(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_29; // 0x8fb0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_67; // 0x9108(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_66; // 0x9130(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_65; // 0x9158(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_64; // 0x9180(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_28; // 0x91a8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_63; // 0x9300(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_77; // 0x9328(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_141; // 0x93c8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_140; // 0x9448(0x80)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_54; // 0x94c8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_54; // 0x94e8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_174; // 0x9508(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_173; // 0x9610(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_172; // 0x9718(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_171; // 0x9820(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_170; // 0x9928(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_169; // 0x9a30(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_76; // 0x9b38(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_73; // 0x9bd8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_18; // 0x9c08(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_25; // 0x9cb8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_24; // 0x9d00(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_75; // 0x9d48(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_74; // 0x9de8(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_52; // 0x9e88(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_27; // 0x9f48(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_26; // 0xa0a0(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_73; // 0xa1f8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_72; // 0xa298(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_62; // 0xa338(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_61; // 0xa360(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_60; // 0xa388(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_59; // 0xa3b0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_51; // 0xa3d8(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_25; // 0xa498(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_71; // 0xa5f0(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_50; // 0xa690(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_70; // 0xa750(0xa0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_164; // 0xa7f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_163; // 0xa818(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_162; // 0xa840(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_139; // 0xa868(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_72; // 0xa8e8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_138; // 0xa918(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_71; // 0xa998(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_70; // 0xa9c8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_17; // 0xa9f8(0xb0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_11; // 0xaaa8(0xd0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_98; // 0xab78(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_97; // 0xac60(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_69; // 0xad48(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_96; // 0xade8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_95; // 0xaed0(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_68; // 0xafb8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_67; // 0xb058(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_69; // 0xb0f8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_16; // 0xb128(0xb0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_10; // 0xb1d8(0xd0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_66; // 0xb2a8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_137; // 0xb348(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_35; // 0xb3c8(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_58; // 0xb490(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_57; // 0xb4b8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_24; // 0xb4e0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_56; // 0xb638(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_55; // 0xb660(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_54; // 0xb688(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_23; // 0xb6b0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_22; // 0xb6f8(0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_34; // 0xb740(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_136; // 0xb808(0x80)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_23; // 0xb888(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_53; // 0xb9e0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_52; // 0xba08(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_21; // 0xba30(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_49; // 0xba78(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_22; // 0xbb38(0x158)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9; // 0xbc90(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_65; // 0xbce0(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_51; // 0xbd80(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_50; // 0xbda8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_49; // 0xbdd0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_48; // 0xbdf8(0x28)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_9; // 0xbe20(0x38)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8; // 0xbe58(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_64; // 0xbea8(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_21; // 0xbf48(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_47; // 0xc0a0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_46; // 0xc0c8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_45; // 0xc0f0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_44; // 0xc118(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_20; // 0xc140(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_43; // 0xc298(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42; // 0xc2c0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_48; // 0xc2e8(0xc0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7; // 0xc3a8(0x50)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_8; // 0xc3f8(0x38)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0xc430(0x50)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_9; // 0xc480(0xd0)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0xc550(0x30)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_53; // 0xc580(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_168; // 0xc5a0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_167; // 0xc6a8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_166; // 0xc7b0(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_53; // 0xc8b8(0x20)
	char pad_C8D8[0x8]; // 0xc8d8(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_18; // 0xc8e0(0x1e0)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_17; // 0xcac0(0x1e0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_165; // 0xcca0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_164; // 0xcda8(0x108)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_47; // 0xceb0(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19; // 0xcf70(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_63; // 0xd0c8(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41; // 0xd168(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40; // 0xd190(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_161; // 0xd1b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_160; // 0xd1e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_159; // 0xd208(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_68; // 0xd230(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_94; // 0xd260(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_62; // 0xd348(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_93; // 0xd3e8(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_67; // 0xd4d0(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_92; // 0xd500(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_91; // 0xd5e8(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_61; // 0xd6d0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_66; // 0xd770(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_15; // 0xd7a0(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18; // 0xd850(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39; // 0xd9a8(0x28)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_13; // 0xd9d0(0xb0)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_12; // 0xda80(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17; // 0xdb30(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_60; // 0xdc88(0xa0)
	struct FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot; // 0xdd28(0x90)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38; // 0xddb8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_158; // 0xdde0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_157; // 0xde08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_156; // 0xde30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_155; // 0xde58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_154; // 0xde80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_153; // 0xdea8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_152; // 0xded0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_151; // 0xdef8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_150; // 0xdf20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_149; // 0xdf48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_148; // 0xdf70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_147; // 0xdf98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_146; // 0xdfc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_145; // 0xdfe8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_144; // 0xe010(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_143; // 0xe038(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_142; // 0xe060(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_141; // 0xe088(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_140; // 0xe0b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_139; // 0xe0d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_138; // 0xe100(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_137; // 0xe128(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_136; // 0xe150(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_135; // 0xe178(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_134; // 0xe1a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_133; // 0xe1c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_132; // 0xe1f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_131; // 0xe218(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_130; // 0xe240(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_129; // 0xe268(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_128; // 0xe290(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_127; // 0xe2b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_126; // 0xe2e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_125; // 0xe308(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_124; // 0xe330(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_123; // 0xe358(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_122; // 0xe380(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_121; // 0xe3a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_120; // 0xe3d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_119; // 0xe3f8(0x28)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_42; // 0xe420(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_163; // 0xe4c0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_162; // 0xe5c8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_161; // 0xe6d0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_160; // 0xe7d8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_159; // 0xe8e0(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_52; // 0xe9e8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_52; // 0xea08(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_158; // 0xea28(0x108)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_118; // 0xeb30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_117; // 0xeb58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_116; // 0xeb80(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_65; // 0xeba8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_135; // 0xebd8(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_41; // 0xec58(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_64; // 0xecf8(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_59; // 0xed28(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_134; // 0xedc8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_133; // 0xee48(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_58; // 0xeec8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_132; // 0xef68(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_63; // 0xefe8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_14; // 0xf018(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_62; // 0xf0c8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_131; // 0xf0f8(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_46; // 0xf178(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_20; // 0xf238(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_130; // 0xf280(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_26; // 0xf300(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_129; // 0xf3c8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_57; // 0xf448(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_90; // 0xf4e8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_89; // 0xf5d0(0xe8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_40; // 0xf6b8(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_45; // 0xf758(0xc0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_61; // 0xf818(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_13; // 0xf848(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_60; // 0xf8f8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_115; // 0xf928(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_114; // 0xf950(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_113; // 0xf978(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_112; // 0xf9a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_111; // 0xf9c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_110; // 0xf9f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_109; // 0xfa18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_108; // 0xfa40(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_107; // 0xfa68(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_106; // 0xfa90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_105; // 0xfab8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_104; // 0xfae0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_103; // 0xfb08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_102; // 0xfb30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_101; // 0xfb58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_100; // 0xfb80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_99; // 0xfba8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_98; // 0xfbd0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_97; // 0xfbf8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_96; // 0xfc20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_95; // 0xfc48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_94; // 0xfc70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_93; // 0xfc98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_92; // 0xfcc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_91; // 0xfce8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90; // 0xfd10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89; // 0xfd38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88; // 0xfd60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87; // 0xfd88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86; // 0xfdb0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85; // 0xfdd8(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_88; // 0xfe00(0xe8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_39; // 0xfee8(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0xff88(0x50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_33; // 0xffd8(0xc8)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_7; // 0x100a0(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_128; // 0x100d8(0x80)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_157; // 0x10158(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_51; // 0x10260(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_51; // 0x10280(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_156; // 0x102a0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_155; // 0x103a8(0x108)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_59; // 0x104b0(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_87; // 0x104e0(0xe8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_38; // 0x105c8(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0x10668(0x50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_32; // 0x106b8(0xc8)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_6; // 0x10780(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_127; // 0x107b8(0x80)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_154; // 0x10838(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_50; // 0x10940(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_50; // 0x10960(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_153; // 0x10980(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_152; // 0x10a88(0x108)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_58; // 0x10b90(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_86; // 0x10bc0(0xe8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_37; // 0x10ca8(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0x10d48(0x50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_31; // 0x10d98(0xc8)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_5; // 0x10e60(0x38)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_151; // 0x10e98(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_49; // 0x10fa0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_49; // 0x10fc0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_150; // 0x10fe0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_149; // 0x110e8(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_126; // 0x111f0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_57; // 0x11270(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_148; // 0x112a0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_147; // 0x113a8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_146; // 0x114b0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_145; // 0x115b8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_144; // 0x116c0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_143; // 0x117c8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_142; // 0x118d0(0x108)
	char pad_119D8[0x8]; // 0x119d8(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_16; // 0x119e0(0x1e0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_48; // 0x11bc0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_48; // 0x11be0(0x20)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_15; // 0x11c00(0x1e0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_125; // 0x11de0(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_36; // 0x11e60(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_56; // 0x11f00(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_141; // 0x11f30(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_140; // 0x12038(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_139; // 0x12140(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_138; // 0x12248(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_137; // 0x12350(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_136; // 0x12458(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_135; // 0x12560(0x108)
	char pad_12668[0x8]; // 0x12668(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_14; // 0x12670(0x1e0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_47; // 0x12850(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_47; // 0x12870(0x20)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_13; // 0x12890(0x1e0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_124; // 0x12a70(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_35; // 0x12af0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_55; // 0x12b90(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_134; // 0x12bc0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_133; // 0x12cc8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_132; // 0x12dd0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_131; // 0x12ed8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_46; // 0x12fe0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_130; // 0x13000(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_46; // 0x13108(0x20)
	char pad_13128[0x8]; // 0x13128(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_12; // 0x13130(0x1e0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_123; // 0x13310(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_34; // 0x13390(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_54; // 0x13430(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_129; // 0x13460(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_128; // 0x13568(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_45; // 0x13670(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_127; // 0x13690(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_126; // 0x13798(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_125; // 0x138a0(0x108)
	char pad_139A8[0x8]; // 0x139a8(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_11; // 0x139b0(0x1e0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_45; // 0x13b90(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_122; // 0x13bb0(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_33; // 0x13c30(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_53; // 0x13cd0(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_124; // 0x13d00(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_123; // 0x13e08(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_122; // 0x13f10(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_121; // 0x14018(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_44; // 0x14120(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_120; // 0x14140(0x108)
	char pad_14248[0x8]; // 0x14248(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_10; // 0x14250(0x1e0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_44; // 0x14430(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_121; // 0x14450(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_32; // 0x144d0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_52; // 0x14570(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_119; // 0x145a0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_118; // 0x146a8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_117; // 0x147b0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_116; // 0x148b8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_43; // 0x149c0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_115; // 0x149e0(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_43; // 0x14ae8(0x20)
	char pad_14B08[0x8]; // 0x14b08(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_9; // 0x14b10(0x1e0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_120; // 0x14cf0(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_31; // 0x14d70(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_51; // 0x14e10(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_50; // 0x14e40(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84; // 0x14e70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83; // 0x14e98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82; // 0x14ec0(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_114; // 0x14ee8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_113; // 0x14ff0(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_42; // 0x150f8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_112; // 0x15118(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_111; // 0x15220(0x108)
	struct FAnimNode_Slot AnimGraphNode_Slot_19; // 0x15328(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_110; // 0x15370(0x108)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_11; // 0x15478(0xb0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_42; // 0x15528(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_56; // 0x15548(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_119; // 0x155e8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_55; // 0x15668(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_118; // 0x15708(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_54; // 0x15788(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_117; // 0x15828(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_30; // 0x158a8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_116; // 0x15970(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_85; // 0x159f0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_84; // 0x15ad8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_83; // 0x15bc0(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_29; // 0x15ca8(0xc8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_30; // 0x15d70(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_49; // 0x15e10(0x30)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_10; // 0x15e40(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_109; // 0x15ef0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_108; // 0x15ff8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_41; // 0x16100(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_107; // 0x16120(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_106; // 0x16228(0x108)
	struct FAnimNode_Slot AnimGraphNode_Slot_18; // 0x16330(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_105; // 0x16378(0x108)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_8; // 0x16480(0x1e0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_41; // 0x16660(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_53; // 0x16680(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_115; // 0x16720(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_52; // 0x167a0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_114; // 0x16840(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_51; // 0x168c0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_113; // 0x16960(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_28; // 0x169e0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_112; // 0x16aa8(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_82; // 0x16b28(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_81; // 0x16c10(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_80; // 0x16cf8(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_27; // 0x16de0(0xc8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_29; // 0x16ea8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_48; // 0x16f48(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_12; // 0x16f78(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_47; // 0x17028(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81; // 0x17058(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80; // 0x17080(0x28)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_9; // 0x170a8(0xb0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_40; // 0x17158(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_104; // 0x17178(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_103; // 0x17280(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_102; // 0x17388(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_101; // 0x17490(0x108)
	struct FAnimNode_Slot AnimGraphNode_Slot_17; // 0x17598(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_100; // 0x175e0(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_40; // 0x176e8(0x20)
	char pad_17708[0x8]; // 0x17708(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_7; // 0x17710(0x1e0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_50; // 0x178f0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_111; // 0x17990(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_110; // 0x17a10(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_49; // 0x17a90(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_26; // 0x17b30(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_48; // 0x17bf8(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_25; // 0x17c98(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_79; // 0x17d60(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_109; // 0x17e48(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_108; // 0x17ec8(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_78; // 0x17f48(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_77; // 0x18030(0xe8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_28; // 0x18118(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_46; // 0x181b8(0x30)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_8; // 0x181e8(0xb0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_39; // 0x18298(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_99; // 0x182b8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_98; // 0x183c0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_97; // 0x184c8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_96; // 0x185d0(0x108)
	struct FAnimNode_Slot AnimGraphNode_Slot_16; // 0x186d8(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_95; // 0x18720(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_39; // 0x18828(0x20)
	char pad_18848[0x8]; // 0x18848(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_6; // 0x18850(0x1e0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_47; // 0x18a30(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_107; // 0x18ad0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_106; // 0x18b50(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_46; // 0x18bd0(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_24; // 0x18c70(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_45; // 0x18d38(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_23; // 0x18dd8(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_76; // 0x18ea0(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_105; // 0x18f88(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_104; // 0x19008(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_75; // 0x19088(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_74; // 0x19170(0xe8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_27; // 0x19258(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_45; // 0x192f8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_11; // 0x19328(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_44; // 0x193d8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79; // 0x19408(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78; // 0x19430(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77; // 0x19458(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x19480(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x194d0(0x50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_22; // 0x19520(0xc8)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_4; // 0x195e8(0x38)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_94; // 0x19620(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_38; // 0x19728(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_38; // 0x19748(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_93; // 0x19768(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_92; // 0x19870(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_103; // 0x19978(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_43; // 0x199f8(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_91; // 0x19a28(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_90; // 0x19b30(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_37; // 0x19c38(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_89; // 0x19c58(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_88; // 0x19d60(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_87; // 0x19e68(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_86; // 0x19f70(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_85; // 0x1a078(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_102; // 0x1a180(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_44; // 0x1a200(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_43; // 0x1a2a0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_101; // 0x1a340(0x80)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_7; // 0x1a3c0(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_15; // 0x1a470(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_37; // 0x1a4b8(0x20)
	char pad_1A4D8[0x8]; // 0x1a4d8(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_5; // 0x1a4e0(0x1e0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_42; // 0x1a6c0(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_21; // 0x1a760(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_100; // 0x1a828(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_99; // 0x1a8a8(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_73; // 0x1a928(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_72; // 0x1aa10(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_71; // 0x1aaf8(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_20; // 0x1abe0(0xc8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_26; // 0x1aca8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_42; // 0x1ad48(0x30)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_6; // 0x1ad78(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_84; // 0x1ae28(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_83; // 0x1af30(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_36; // 0x1b038(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_82; // 0x1b058(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_81; // 0x1b160(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_80; // 0x1b268(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_79; // 0x1b370(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_78; // 0x1b478(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_98; // 0x1b580(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_41; // 0x1b600(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_40; // 0x1b6a0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_97; // 0x1b740(0x80)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_4; // 0x1b7c0(0x1e0)
	struct FAnimNode_Slot AnimGraphNode_Slot_14; // 0x1b9a0(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_36; // 0x1b9e8(0x20)
	char pad_1BA08[0x8]; // 0x1ba08(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_3; // 0x1ba10(0x1e0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_39; // 0x1bbf0(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_19; // 0x1bc90(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_96; // 0x1bd58(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_95; // 0x1bdd8(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_70; // 0x1be58(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_69; // 0x1bf40(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_68; // 0x1c028(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_18; // 0x1c110(0xc8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_25; // 0x1c1d8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_41; // 0x1c278(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_10; // 0x1c2a8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_40; // 0x1c358(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_9; // 0x1c388(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_94; // 0x1c438(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_44; // 0x1c4b8(0xc0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_77; // 0x1c578(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_76; // 0x1c680(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_35; // 0x1c788(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_35; // 0x1c7a8(0x20)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_39; // 0x1c7c8(0x30)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_24; // 0x1c7f8(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_75; // 0x1c898(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_74; // 0x1c9a0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_73; // 0x1caa8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_72; // 0x1cbb0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_71; // 0x1ccb8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_34; // 0x1cdc0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_34; // 0x1cde0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_70; // 0x1ce00(0x108)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76; // 0x1cf08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75; // 0x1cf30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74; // 0x1cf58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73; // 0x1cf80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72; // 0x1cfa8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_93; // 0x1cfd0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_92; // 0x1d050(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_91; // 0x1d0d0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_90; // 0x1d150(0x80)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_33; // 0x1d1d0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_33; // 0x1d1f0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_69; // 0x1d210(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_23; // 0x1d318(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x1d3b8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_38; // 0x1d468(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_37; // 0x1d498(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_67; // 0x1d4c8(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_43; // 0x1d5b0(0xc0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_25; // 0x1d670(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_66; // 0x1d738(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_65; // 0x1d820(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_42; // 0x1d908(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_64; // 0x1d9c8(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_36; // 0x1dab0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71; // 0x1dae0(0x28)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_8; // 0x1db08(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_35; // 0x1dbb8(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot_13; // 0x1dbe8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_12; // 0x1dc30(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_11; // 0x1dc78(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70; // 0x1dcc0(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_68; // 0x1dce8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_32; // 0x1ddf0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_32; // 0x1de10(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_67; // 0x1de30(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_22; // 0x1df38(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_89; // 0x1dfd8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_34; // 0x1e058(0x30)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_5; // 0x1e088(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_88; // 0x1e138(0x80)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_66; // 0x1e1b8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_31; // 0x1e2c0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_31; // 0x1e2e0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_65; // 0x1e300(0x108)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_3; // 0x1e408(0xf0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_41; // 0x1e4f8(0xc0)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_2; // 0x1e5b8(0xf0)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator; // 0x1e6a8(0xf0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_17; // 0x1e798(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_87; // 0x1e860(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_16; // 0x1e8e0(0xc8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_21; // 0x1e9a8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_33; // 0x1ea48(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0x1ea78(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_32; // 0x1eb28(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_38; // 0x1eb58(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_86; // 0x1ebf8(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_63; // 0x1ec78(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_62; // 0x1ed60(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_61; // 0x1ee48(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_60; // 0x1ef30(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_85; // 0x1f018(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_37; // 0x1f098(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_36; // 0x1f138(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_35; // 0x1f1d8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_34; // 0x1f278(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_31; // 0x1f318(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_84; // 0x1f348(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_40; // 0x1f3c8(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_83; // 0x1f488(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_82; // 0x1f508(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_59; // 0x1f588(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_58; // 0x1f670(0xe8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_30; // 0x1f758(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_30; // 0x1f778(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_64; // 0x1f798(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_20; // 0x1f8a0(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1f940(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_30; // 0x1f9f0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69; // 0x1fa20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68; // 0x1fa48(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_81; // 0x1fa70(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_39; // 0x1faf0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_80; // 0x1fbb0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_29; // 0x1fc30(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67; // 0x1fc60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66; // 0x1fc88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65; // 0x1fcb0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64; // 0x1fcd8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_79; // 0x1fd00(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_28; // 0x1fd80(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_78; // 0x1fdb0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_27; // 0x1fe30(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77; // 0x1fe60(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_26; // 0x1fee0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x1ff10(0xb0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_38; // 0x1ffc0(0xc0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63; // 0x20080(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62; // 0x200a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61; // 0x200d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60; // 0x200f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59; // 0x20120(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58; // 0x20148(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57; // 0x20170(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56; // 0x20198(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55; // 0x201c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54; // 0x201e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0x20210(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0x20238(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0x20260(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0x20288(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0x202b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0x202d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0x20300(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0x20328(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0x20350(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0x20378(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0x203a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0x203c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0x203f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x20418(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x20440(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x20468(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x20490(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x204b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x204e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x20508(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_33; // 0x20530(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_57; // 0x205d0(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76; // 0x206b8(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_37; // 0x20738(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_36; // 0x207f8(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75; // 0x208b8(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_24; // 0x20938(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_23; // 0x20a00(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74; // 0x20ac8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73; // 0x20b48(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72; // 0x20bc8(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_19; // 0x20c48(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_25; // 0x20ce8(0x30)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_35; // 0x20d18(0xc0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_15; // 0x20dd8(0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_14; // 0x20ea0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71; // 0x20f68(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70; // 0x20fe8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69; // 0x21068(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68; // 0x210e8(0x80)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_3; // 0x21168(0x38)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_2; // 0x211a0(0x38)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_22; // 0x211d8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67; // 0x212a0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66; // 0x21320(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_21; // 0x213a0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65; // 0x21468(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64; // 0x214e8(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_20; // 0x21568(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63; // 0x21630(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_34; // 0x216b0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62; // 0x21770(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61; // 0x217f0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60; // 0x21870(0x80)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_29; // 0x218f0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_29; // 0x21910(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_63; // 0x21930(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_18; // 0x21a38(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_62; // 0x21ad8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_28; // 0x21be0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_28; // 0x21c00(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_61; // 0x21c20(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_17; // 0x21d28(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_13; // 0x21dc8(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_56; // 0x21e90(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_24; // 0x21f78(0x30)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_4; // 0x21fa8(0xb0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_27; // 0x22058(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_60; // 0x22078(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_27; // 0x22180(0x20)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_33; // 0x221a0(0xc0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_26; // 0x22260(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_26; // 0x22280(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_59; // 0x222a0(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_25; // 0x223a8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_25; // 0x223c8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_58; // 0x223e8(0x108)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_12; // 0x224f0(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_55; // 0x225b8(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59; // 0x226a0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58; // 0x22720(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_32; // 0x227a0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57; // 0x22860(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_31; // 0x228e0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56; // 0x229a0(0x80)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_8; // 0x22a20(0xd0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_30; // 0x22af0(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_32; // 0x22bb0(0xa0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_7; // 0x22c50(0xd0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_16; // 0x22d20(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_15; // 0x22dc0(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_19; // 0x22e60(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55; // 0x22f28(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54; // 0x22fa8(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_54; // 0x23028(0xe8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_18; // 0x23110(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53; // 0x231d8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52; // 0x23258(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_53; // 0x232d8(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_11; // 0x233c0(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_52; // 0x23488(0xe8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_57; // 0x23570(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_24; // 0x23678(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_24; // 0x23698(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_56; // 0x236b8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_55; // 0x237c0(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_23; // 0x238c8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_23; // 0x238e8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_54; // 0x23908(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_53; // 0x23a10(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_22; // 0x23b18(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_22; // 0x23b38(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_52; // 0x23b58(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_51; // 0x23c60(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_21; // 0x23d68(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_21; // 0x23d88(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_50; // 0x23da8(0x108)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_17; // 0x23eb0(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_16; // 0x23f78(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_51; // 0x24040(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_50; // 0x24128(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_49; // 0x24210(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_48; // 0x242f8(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51; // 0x243e0(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_47; // 0x24460(0xe8)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_6; // 0x24548(0xd0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_46; // 0x24618(0xe8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_14; // 0x24700(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_31; // 0x247a0(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_29; // 0x24840(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_28; // 0x24900(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50; // 0x249c0(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_13; // 0x24a40(0xa0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_5; // 0x24ae0(0xd0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_45; // 0x24bb0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_44; // 0x24c98(0xe8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_49; // 0x24d80(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_20; // 0x24e88(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_20; // 0x24ea8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_48; // 0x24ec8(0x108)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_23; // 0x24fd0(0x30)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_3; // 0x25000(0xb0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_19; // 0x250b0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_19; // 0x250d0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_47; // 0x250f0(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_18; // 0x251f8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_18; // 0x25218(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_46; // 0x25238(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_17; // 0x25340(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_17; // 0x25360(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_45; // 0x25380(0x108)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_10; // 0x25488(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_43; // 0x25550(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49; // 0x25638(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48; // 0x256b8(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_27; // 0x25738(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47; // 0x257f8(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_26; // 0x25878(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46; // 0x25938(0x80)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_44; // 0x259b8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_16; // 0x25ac0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_16; // 0x25ae0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_43; // 0x25b00(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_42; // 0x25c08(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_15; // 0x25d10(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_15; // 0x25d30(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_41; // 0x25d50(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_40; // 0x25e58(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_14; // 0x25f60(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_14; // 0x25f80(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_39; // 0x25fa0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_38; // 0x260a8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_13; // 0x261b0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_13; // 0x261d0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_37; // 0x261f0(0x108)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_15; // 0x262f8(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_14; // 0x263c0(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_42; // 0x26488(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_41; // 0x26570(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_40; // 0x26658(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_39; // 0x26740(0xe8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_12; // 0x26828(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_11; // 0x268c8(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_13; // 0x26968(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45; // 0x26a30(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44; // 0x26ab0(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_38; // 0x26b30(0xe8)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_4; // 0x26c18(0xd0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_25; // 0x26ce8(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_30; // 0x26da8(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_24; // 0x26e48(0xc0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_12; // 0x26f08(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43; // 0x26fd0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42; // 0x27050(0x80)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_3; // 0x270d0(0xd0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_37; // 0x271a0(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_9; // 0x27288(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_36; // 0x27350(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41; // 0x27438(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_35; // 0x274b8(0xe8)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2; // 0x275a0(0xd0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_34; // 0x27670(0xe8)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_10; // 0x27758(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29; // 0x277f8(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_23; // 0x27898(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_22; // 0x27958(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0x27a18(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_9; // 0x27a98(0xa0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x27b38(0xd0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_33; // 0x27c08(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_32; // 0x27cf0(0xe8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_36; // 0x27dd8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_12; // 0x27ee0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_12; // 0x27f00(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_35; // 0x27f20(0x108)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0x28028(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x28058(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x28108(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x28138(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x28160(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0x28188(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_11; // 0x28208(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0x282d0(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_21; // 0x28350(0xc0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_10; // 0x28410(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0x284d8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0x28558(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_20; // 0x285d8(0xc0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x28698(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x286c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x286e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x28710(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x28738(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x28760(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x28788(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x287b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x287d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x28800(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x28828(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x28850(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x28878(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x288a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x288c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x288f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x28918(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_8; // 0x28940(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_31; // 0x28a08(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_30; // 0x28af0(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28; // 0x28bd8(0xa0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_11; // 0x28c78(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_11; // 0x28c98(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_34; // 0x28cb8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_33; // 0x28dc0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_32; // 0x28ec8(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_8; // 0x28fd0(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_29; // 0x29070(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_28; // 0x29158(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27; // 0x29240(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x292e0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0x29310(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_19; // 0x29390(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_27; // 0x29450(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26; // 0x29538(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_9; // 0x295d8(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_8; // 0x296a0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0x29768(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x297e8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x29868(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x298e8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x29918(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_18; // 0x29998(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_26; // 0x29a58(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25; // 0x29b40(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7; // 0x29be0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x29ca8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x29d28(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x29da8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x29dd8(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_17; // 0x29e58(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_25; // 0x29f18(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24; // 0x2a000(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6; // 0x2a0a0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x2a168(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x2a1e8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x2a268(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x2a298(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_16; // 0x2a318(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_24; // 0x2a3d8(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23; // 0x2a4c0(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5; // 0x2a560(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0x2a628(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x2a6f0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x2a770(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x2a7f0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x2a870(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x2a8a0(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_7; // 0x2a8c8(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_23; // 0x2a990(0xe8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_10; // 0x2aa78(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_10; // 0x2aa98(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_31; // 0x2aab8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_30; // 0x2abc0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_29; // 0x2acc8(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_7; // 0x2add0(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_22; // 0x2ae70(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_21; // 0x2af58(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22; // 0x2b040(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x2b0e0(0x30)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6; // 0x2b110(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_20; // 0x2b1d8(0xe8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9; // 0x2b2c0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9; // 0x2b2e0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_28; // 0x2b300(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_27; // 0x2b408(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_26; // 0x2b510(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_6; // 0x2b618(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_19; // 0x2b6b8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_18; // 0x2b7a0(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0x2b888(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x2b928(0x30)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0x2b958(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_17; // 0x2ba20(0xe8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8; // 0x2bb08(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8; // 0x2bb28(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_25; // 0x2bb48(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_24; // 0x2bc50(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_23; // 0x2bd58(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_5; // 0x2be60(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_16; // 0x2bf00(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15; // 0x2bfe8(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0x2c0d0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x2c170(0x30)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0x2c1a0(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14; // 0x2c268(0xe8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7; // 0x2c350(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7; // 0x2c370(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_22; // 0x2c390(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_21; // 0x2c498(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_20; // 0x2c5a0(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_4; // 0x2c6a8(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13; // 0x2c748(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12; // 0x2c830(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x2c918(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x2c9b8(0x30)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x2c9e8(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11; // 0x2cab0(0xe8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0x2cb98(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0x2cbb8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_19; // 0x2cbd8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_18; // 0x2cce0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_17; // 0x2cde8(0x108)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_3; // 0x2cef0(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x2cf90(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x2d078(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x2d160(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x2d200(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x2d230(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x2d258(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x2d288(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x2d338(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x2d368(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x2d390(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x2d3b8(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_15; // 0x2d438(0xc0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x2d4f8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x2d5c0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x2d640(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_14; // 0x2d6c0(0xc0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x2d780(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x2d7a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x2d7d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x2d7f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x2d820(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x2d848(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x2d870(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x2d898(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x2d8c0(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x2d8e8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0x2d9d0(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x2dab8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x2db58(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x2db88(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x2dc70(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x2dd58(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x2ddf8(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x2de28(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x2df10(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x2dff8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x2e098(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x2e0c8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2e1b0(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x2e298(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x2e338(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2e368(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x2e390(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x2e3c0(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x2e470(0x30)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x2e4a0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_16; // 0x2e4c0(0x108)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x2e5c8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x2e690(0x80)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x2e710(0x20)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle_2; // 0x2e730(0xb0)
	struct FTigerAnimNode_BlendByBoolWSettle TigerAnimGraphNode_BlendByBoolWSettle; // 0x2e7e0(0xb0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x2e890(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x2e958(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x2e9d8(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_13; // 0x2ea58(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x2eb18(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12; // 0x2ebb8(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11; // 0x2ec78(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x2ed38(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x2edb8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x2ee58(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x2eed8(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0x2ef58(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x2f018(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x2f098(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x2f118(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x2f198(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x2f218(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x2f298(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x2f2c8(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_10; // 0x2f378(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2f3c0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2f3f0(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x2f4a0(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x2f540(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x2f600(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x2f680(0x80)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37; // 0x2f700(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x2f728(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16; // 0x2f7e8(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot_9; // 0x2f940(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36; // 0x2f988(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x2f9b0(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35; // 0x2fa50(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x2fa78(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_15; // 0x2fb18(0x108)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15; // 0x2fc20(0x158)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_2; // 0x2fd78(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_14; // 0x2fe18(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_13; // 0x2ff20(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x30028(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12; // 0x300c8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11; // 0x301d0(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x302d8(0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_8; // 0x302f8(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10; // 0x303a8(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x304b0(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0x304d0(0x158)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x30628(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34; // 0x306f0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33; // 0x30718(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_8; // 0x30740(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0x30788(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32; // 0x308e0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31; // 0x30908(0x28)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x30930(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x309d0(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30; // 0x30a18(0x28)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x30a40(0x1e0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0x30c20(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x30d28(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x30d48(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x30d68(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29; // 0x30db0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28; // 0x30dd8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0x30e00(0x158)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x30f58(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x31060(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0x31080(0x158)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x311d8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x311f8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x31300(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x31408(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27; // 0x31510(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x31538(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26; // 0x31690(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x316b8(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x317c0(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x31860(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x318a8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0x31a00(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0x31a28(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x31a50(0xc0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_7; // 0x31b10(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0x31bc0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0x31be8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0x31c10(0x28)
	char pad_31C38[0x8]; // 0x31c38(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x31c40(0x1e0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x31e20(0x108)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x31f28(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x31fe8(0x80)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x32068(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x32090(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0x32150(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x32178(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x321c0(0xc0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x32280(0x108)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x32388(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x324e0(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x32638(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x32680(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0x32720(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0x32748(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x32770(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x327f0(0x80)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x32870(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x328b8(0xc0)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive; // 0x32978(0x38)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x329b0(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x32a78(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x32bd0(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x32c18(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x32d70(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x32d98(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x32dc0(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x32de8(0x108)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x32ef0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x33048(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x33070(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x33098(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x330b8(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x330d8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x33158(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x331d8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x33278(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x33318(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x333b8(0x158)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x33510(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x335d0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x335f8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x33620(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x336c0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x33818(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x33840(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x33868(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x33890(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x33950(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x33978(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_6; // 0x339a0(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x33a50(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_5; // 0x33a78(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x33b28(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x33b50(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_4; // 0x33b78(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x33c28(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x33d80(0x28)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x33da8(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x33dd8(0xa0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_3; // 0x33e78(0xb0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2; // 0x33f28(0xb0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x33fd8(0xb0)
	float ChangedSetTime; // 0x34088(0x04)
	bool RecentlyChangedSet; // 0x3408c(0x01)
	bool PoseInitialized; // 0x3408d(0x01)
	char pad_3408E[0x2]; // 0x3408e(0x02)
	float DeltaTimeX; // 0x34090(0x04)
	struct FRotator RotationLastTick; // 0x34094(0x0c)
	float YawDelta; // 0x340a0(0x04)
	float CameraRollDelta; // 0x340a4(0x04)
	float CameraPitchDelta; // 0x340a8(0x04)
	float CameraYawDelta; // 0x340ac(0x04)
	float VelocityUpDown; // 0x340b0(0x04)
	float VelocityLeftRight; // 0x340b4(0x04)
	float VelocityFrontBack; // 0x340b8(0x04)
	bool bIsUsingRangedWeapon; // 0x340bc(0x01)
	bool bWasGettingDiablerized; // 0x340bd(0x01)
	char pad_340BE[0x2]; // 0x340be(0x02)
	struct FName FaceAnimSlotName_00; // 0x340c0(0x08)
	struct FName FaceAnimSlotName_01; // 0x340c8(0x08)
	struct FName FaceAnimSlotName_02; // 0x340d0(0x08)
	struct FName FaceAnimSlotName_03; // 0x340d8(0x08)
	bool IsMovingOnGround; // 0x340e0(0x01)
	bool IsAimingWeapon; // 0x340e1(0x01)
	char pad_340E2[0x2]; // 0x340e2(0x02)
	struct FVector LeftHandWeaponTranslation; // 0x340e4(0x0c)
	struct FName LeftFootBoneName; // 0x340f0(0x08)
	struct FName RightFootBoneName; // 0x340f8(0x08)
	bool ShowTraces; // 0x34100(0x01)
	char pad_34101[0x3]; // 0x34101(0x03)
	float TraceLengthAboveFoot; // 0x34104(0x04)
	float TraceLengthBelowFoot; // 0x34108(0x04)
	struct FVector MinLimits_Standing; // 0x3410c(0x0c)
	struct FVector MaxLimits_Standing; // 0x34118(0x0c)
	struct FVector MinLimits_Crouching; // 0x34124(0x0c)
	struct FVector MaxLimits_Crouching; // 0x34130(0x0c)
	struct FVector RightFootOffsetTraTarget; // 0x3413c(0x0c)
	struct FRotator RightFootOffsetRotTarget; // 0x34148(0x0c)
	struct FVector LeftFootOffsetTraTarget; // 0x34154(0x0c)
	struct FRotator LeftFootOffsetRotTarget; // 0x34160(0x0c)
	struct FVector LeftFootOffsetsTra; // 0x3416c(0x0c)
	struct FRotator LeftFootOffsetsRot; // 0x34178(0x0c)
	struct FVector RightFootOffsetsTra; // 0x34184(0x0c)
	float RotationOffsetInterpSpeed; // 0x34190(0x04)
	float ZOffsetInterpSpeed; // 0x34194(0x04)
	bool IsStandingOnGround; // 0x34198(0x01)
	char pad_34199[0x3]; // 0x34199(0x03)
	struct FVector LeftElbowWeaponTranslation; // 0x3419c(0x0c)
	struct FRotator LeftHandWeaponRotation; // 0x341a8(0x0c)
	struct FVector RightHandWeaponTranslation; // 0x341b4(0x0c)
	struct FVector RightElbowWeaponTranslation; // 0x341c0(0x0c)
	struct FRotator RightHandWeaponRotation; // 0x341cc(0x0c)
	bool IsInMeleeSwing; // 0x341d8(0x01)
	enum class ENUM_RangedWeaponCategories CurrentRangedWeapon; // 0x341d9(0x01)
	enum class ENUM_MeleeWeaponCategories CurrentMeleeWeapon; // 0x341da(0x01)
	bool ShouldUseFootIk; // 0x341db(0x01)
	bool bIsDedicatedServer; // 0x341dc(0x01)
	bool IsMale; // 0x341dd(0x01)
	bool HasMovementInput; // 0x341de(0x01)
	enum class ENUM_MovementMode MovementMode; // 0x341df(0x01)
	enum class ENUM_MovementMode PrevMovementMode; // 0x341e0(0x01)
	enum class ENUM_JumpState JumpMode; // 0x341e1(0x01)
	enum class ENUM_JumpState PrevJumpMode; // 0x341e2(0x01)
	char pad_341E3[0x1]; // 0x341e3(0x01)
	float DirectionHor; // 0x341e4(0x04)
	float DirectionVer; // 0x341e8(0x04)
	bool IsFiringWeapon; // 0x341ec(0x01)
	bool bIsUsingMeleeWeapon; // 0x341ed(0x01)
	char pad_341EE[0x2]; // 0x341ee(0x02)
	struct FVector PlayerDesiredMovementDirection; // 0x341f0(0x0c)
	float SlideSurfacePitch; // 0x341fc(0x04)
	float FireReadyTimeStamp; // 0x34200(0x04)
	float FireWeaponBlendInTime; // 0x34204(0x04)
	bool IsInElysium; // 0x34208(0x01)
	char pad_34209[0x3]; // 0x34209(0x03)
	struct FVector LastPlayerDesiredMovementDirection; // 0x3420c(0x0c)
	float StrafeRotationOffset; // 0x34218(0x04)
	bool IsStrafingBackwards; // 0x3421c(0x01)
	char pad_3421D[0x3]; // 0x3421d(0x03)
	float StrafeForwardDirection; // 0x34220(0x04)
	float StrafeForwardDirectionSmooth; // 0x34224(0x04)
	float StrafeBackwardsDirection; // 0x34228(0x04)
	float StrafeBackwardsDirectionSmooth; // 0x3422c(0x04)
	bool ActivateNewStrafe; // 0x34230(0x01)
	char pad_34231[0x3]; // 0x34231(0x03)
	struct FVector CurrentPlayerIntendedVelocity; // 0x34234(0x0c)
	struct FVector PlayerIntendedVelocityLean; // 0x34240(0x0c)
	struct FVector PlayerIntendedVelocityLeanSlow; // 0x3424c(0x0c)
	bool ActivateVelocityLean; // 0x34258(0x01)
	char pad_34259[0x3]; // 0x34259(0x03)
	float ActivateVelocityLeanBlendFloat; // 0x3425c(0x04)
	float StrafeLeanRootRotSetting; // 0x34260(0x04)
	struct FVector StrafeLeanRootRotCurrent; // 0x34264(0x0c)
	float StrafeLeanRootTransSetting; // 0x34270(0x04)
	struct FVector StrafeLeanRootTransCurrent; // 0x34274(0x0c)
	float StrafeLeanSpineSetting; // 0x34280(0x04)
	struct FRotator StrafeLeanSpineCurrent; // 0x34284(0x0c)
	struct FRotator StrafeLeanHeadCounterCurrent; // 0x34290(0x0c)
	bool LegCrossClearance; // 0x3429c(0x01)
	char pad_3429D[0x3]; // 0x3429d(0x03)
	float YawDeltaSmooth; // 0x342a0(0x04)
	char pad_342A4[0x4]; // 0x342a4(0x04)
	struct UBlendSpaceBase* LastPowerAimOffset; // 0x342a8(0x08)
	float PowerAimOffsetAlpha; // 0x342b0(0x04)
	bool bHasValidPowerAimOffset; // 0x342b4(0x01)
	bool IsMoving; // 0x342b5(0x01)
	bool IsHipFiring; // 0x342b6(0x01)
	bool IsSimulatedProxy; // 0x342b7(0x01)
	bool WasSliding; // 0x342b8(0x01)
	char pad_342B9[0x3]; // 0x342b9(0x03)
	struct FVector InAirLeaning; // 0x342bc(0x0c)
	float InAirLeaningHeightReverser; // 0x342c8(0x04)
	float TimeSinceLastPlayerInput; // 0x342cc(0x04)
	float SmoothSpeed; // 0x342d0(0x04)
	bool HasValidRangedAimOffsets; // 0x342d4(0x01)
	char pad_342D5[0x3]; // 0x342d5(0x03)
	float LeftHandIK; // 0x342d8(0x04)
	float SmoothSpeedSlow; // 0x342dc(0x04)
	float RightHandIK; // 0x342e0(0x04)
	char pad_342E4[0x4]; // 0x342e4(0x04)
	struct TArray<enum class ENUM_RangedWeaponCategories> Weapon - Dual; // 0x342e8(0x10)
	enum class ENUM_WallSlideDirection CurrentWallSlideWallSide; // 0x342f8(0x01)
	char pad_342F9[0x3]; // 0x342f9(0x03)
	float CharacterDeltaYawSmoothWallSlide; // 0x342fc(0x04)
	bool WallJumpWasAvailable; // 0x34300(0x01)
	char pad_34301[0x3]; // 0x34301(0x03)
	float SprintAngle; // 0x34304(0x04)
	float LookAtVertical; // 0x34308(0x04)
	float LookAtHorizontal; // 0x3430c(0x04)
	float LookAtHorizontalSlow; // 0x34310(0x04)
	bool LookAtInRange; // 0x34314(0x01)
	char pad_34315[0x3]; // 0x34315(0x03)
	float LookAtHeadTiltAmount; // 0x34318(0x04)
	float SprintAngleWide; // 0x3431c(0x04)
	float SptintAngleSlow; // 0x34320(0x04)
	float CameraYawDeltaSlideSlow; // 0x34324(0x04)
	bool IsBlendingFireLean; // 0x34328(0x01)
	char pad_34329[0x3]; // 0x34329(0x03)
	float SprintAngleWideSlow; // 0x3432c(0x04)
	struct FVector PlayerDesiredStartDirection; // 0x34330(0x0c)
	float PlayerDesiredStartDirectionWhole90; // 0x3433c(0x04)
	float PlayerDesiredStartDirectionDegrees; // 0x34340(0x04)
	float PlayerDesiredStartDirectionRotOffsetDegree; // 0x34344(0x04)
	struct FRotator PlayerDesiredStartDirectionRotOffset; // 0x34348(0x0c)
	struct FVector PlayerDesiredStopDirection; // 0x34354(0x0c)
	bool ShouldLeaveStart; // 0x34360(0x01)
	bool ShouldLeaveStop; // 0x34361(0x01)
	bool ActivateStartStop; // 0x34362(0x01)
	char pad_34363[0x1]; // 0x34363(0x01)
	struct FVector WallSlideVelocity; // 0x34364(0x0c)
	float TimeSinceWallSlideStateEntered; // 0x34370(0x04)
	float WallSlideDirectionAttatchInverser; // 0x34374(0x04)
	struct TArray<enum class ENUM_RangedWeaponCategories> IsDualHandRangedWeapon; // 0x34378(0x10)
	struct TArray<enum class ENUM_RangedWeaponCategories> IsSingleFireWeapon; // 0x34388(0x10)
	bool ActivateTurnStarts; // 0x34398(0x01)
	char pad_34399[0x3]; // 0x34399(0x03)
	float TurnStartAngle; // 0x3439c(0x04)
	bool WasClimbing; // 0x343a0(0x01)
	char pad_343A1[0x3]; // 0x343a1(0x03)
	float TurnInPlaceAmount; // 0x343a4(0x04)
	bool TriggerTurnInPlace; // 0x343a8(0x01)
	bool CanEnterTurnInPlace; // 0x343a9(0x01)
	bool ActivateRootTurnInPlace; // 0x343aa(0x01)
	bool Rotate_L; // 0x343ab(0x01)
	bool Rotate_R; // 0x343ac(0x01)
	char pad_343AD[0x3]; // 0x343ad(0x03)
	float ADSYawRotationDelta; // 0x343b0(0x04)
	float ADSYawRotation; // 0x343b4(0x04)
	float ADSYawRotationLastTick; // 0x343b8(0x04)
	char pad_343BC[0x4]; // 0x343bc(0x04)
	struct TArray<struct FVector> TurnInPlaceLookMovements; // 0x343c0(0x10)
	float TurnInPlaceMaxDot; // 0x343d0(0x04)
	char pad_343D4[0x4]; // 0x343d4(0x04)
	struct TArray<enum class ENUM_MeleeWeaponCategories> WPN Melee - Single; // 0x343d8(0x10)
	struct TArray<enum class ENUM_RangedWeaponCategories> WPN Range - Single; // 0x343e8(0x10)
	bool IsFeeding; // 0x343f8(0x01)
	char pad_343F9[0x3]; // 0x343f9(0x03)
	float TimeSprinting; // 0x343fc(0x04)
	bool IsBlinded; // 0x34400(0x01)
	char pad_34401[0x3]; // 0x34401(0x03)
	float isBlindedWeight; // 0x34404(0x04)
	float RotateInPlaceAlpha; // 0x34408(0x04)
	float RotateInPlacePlayRate; // 0x3440c(0x04)
	struct FRotator CurrentCameraWorldRotation; // 0x34410(0x0c)
	struct FRotator StartCameraWorldRotation; // 0x3441c(0x0c)
	bool ActivateSprintTransitions; // 0x34428(0x01)
	char pad_34429[0x3]; // 0x34429(0x03)
	float TimeMoving; // 0x3442c(0x04)
	enum class ETigerClan CurrentPlayerClan; // 0x34430(0x01)
	bool ShouldPlaySoftStop; // 0x34431(0x01)
	char pad_34432[0x6]; // 0x34432(0x06)
	struct TMap<enum class EPhysicalSurface, struct FName> SurfaceToAudioName; // 0x34438(0x50)
	struct UCurveFloat* WallGrind_Remap; // 0x34488(0x08)
	float WallGrindAimOffset; // 0x34490(0x04)
	float In Air Jump Lean; // 0x34494(0x04)
	bool ShouldUseLookAt; // 0x34498(0x01)
	bool StopCrouchState; // 0x34499(0x01)
	bool StartCrouchState; // 0x3449a(0x01)
	char pad_3449B[0x5]; // 0x3449b(0x05)
	struct TArray<enum class ETigerClan> Player - Clan; // 0x344a0(0x10)
	float TimeFalling; // 0x344b0(0x04)
	bool RecentlyLeftWallSlide; // 0x344b4(0x01)
	enum class ENUM_WallSlideDirection LastWallSlideWallSide; // 0x344b5(0x01)
	bool ActivateWallSlideDetatch; // 0x344b6(0x01)
	char pad_344B7[0x1]; // 0x344b7(0x01)
	struct FVector LookAtWallSlide; // 0x344b8(0x0c)
	bool amInTurnStart; // 0x344c4(0x01)
	char pad_344C5[0x3]; // 0x344c5(0x03)
	float SprintAccelTimer; // 0x344c8(0x04)
	float StrafeStepFrequencyMod; // 0x344cc(0x04)
	struct ATigerPlayer* Player; // 0x344d0(0x08)
	float RootBoneDeltaSmoother; // 0x344d8(0x04)
	struct FRotator RightFootOffsetsRot; // 0x344dc(0x0c)
	struct FVector FootIKPelvisOffsetTra; // 0x344e8(0x0c)
	bool IsSoaringLeap; // 0x344f4(0x01)
	char pad_344F5[0x3]; // 0x344f5(0x03)
	struct FVector SoaringLeapLeaning_PelvisTrans; // 0x344f8(0x0c)
	struct FRotator SoaringLeapLeaning_PelvisRot; // 0x34504(0x0c)
	struct FRotator SoaringLeapLeaning_SpineRot; // 0x34510(0x0c)
	struct FRotator SoaringLeapLeaning_HeadRot; // 0x3451c(0x0c)
	struct FRotator StrafeLeanSpineCurrentThird; // 0x34528(0x0c)
	bool IsAnyPowerActive; // 0x34534(0x01)
	char pad_34535[0x3]; // 0x34535(0x03)
	float UpperbodyWeight; // 0x34538(0x04)
	float RangedWpnCacheFalseBlendTime; // 0x3453c(0x04)
	bool RangedWpnCacheBlend; // 0x34540(0x01)
	enum class ENUM_SettleType SettleEventEnum_Aim; // 0x34541(0x01)
	char pad_34542[0x2]; // 0x34542(0x02)
	struct FRotator LookAtHeadRotator; // 0x34544(0x0c)
	struct FRotator LookAtSpineRotator; // 0x34550(0x0c)
	float LookAtSpineOnOff; // 0x3455c(0x04)
	enum class ENUM_SettleType SettleEventEnum_Crouch; // 0x34560(0x01)
	char pad_34561[0x3]; // 0x34561(0x03)
	float OverrideRightHand; // 0x34564(0x04)
	float OverrideLeftHand; // 0x34568(0x04)
	float ModifiedStrafePlayrate; // 0x3456c(0x04)
	float WalkSpeed; // 0x34570(0x04)
	float MinWalkSpeed; // 0x34574(0x04)
	float MaxWalkSpeed; // 0x34578(0x04)
	float RunSpeed; // 0x3457c(0x04)
	float MinRunSpeed; // 0x34580(0x04)
	float MaxRunSpeed; // 0x34584(0x04)
	float StrafeWalkRunBlend; // 0x34588(0x04)
	float WalkStrafePlayrate; // 0x3458c(0x04)
	float RunStrafePlayrate; // 0x34590(0x04)
	float StepLengthModWalk; // 0x34594(0x04)
	float StepLengthModWalkFwd; // 0x34598(0x04)
	float StepLengthModWalkBwd; // 0x3459c(0x04)
	float StepLengthModRun; // 0x345a0(0x04)
	float StepLengthModRunFwd; // 0x345a4(0x04)
	float StepLengthModRunBwd; // 0x345a8(0x04)
	bool ActivateNewStrafeScaler; // 0x345ac(0x01)
	char pad_345AD[0x3]; // 0x345ad(0x03)
	float ClimbAngle; // 0x345b0(0x04)
	bool ShouldReturnToDownedIntro; // 0x345b4(0x01)
	bool ActivateBackFlip; // 0x345b5(0x01)
	char pad_345B6[0x2]; // 0x345b6(0x02)
	float FallVerticalValue; // 0x345b8(0x04)
	float TimeUntilCollision; // 0x345bc(0x04)
	bool AboutToCollideWithClimbableSurface; // 0x345c0(0x01)
	bool NewStartAnimationAllowed; // 0x345c1(0x01)
	bool StartIsActive; // 0x345c2(0x01)
	char pad_345C3[0x1]; // 0x345c3(0x01)
	float StartIsActiveTime; // 0x345c4(0x04)
	bool NewStopAnimationAllowed; // 0x345c8(0x01)
	bool StopIsActive; // 0x345c9(0x01)
	char pad_345CA[0x2]; // 0x345ca(0x02)
	float StopIsActiveTime; // 0x345cc(0x04)
	bool IsFalling; // 0x345d0(0x01)
	char pad_345D1[0x3]; // 0x345d1(0x03)
	struct FVector FootIKPelvisOffsetTraCrouchSlope; // 0x345d4(0x0c)
	bool FootIKPelvisOffsetTraCrouchSlopeActivate; // 0x345e0(0x01)
	bool ActivateSlideSettles; // 0x345e1(0x01)
	bool R; // 0x345e2(0x01)
	char pad_345E3[0x1]; // 0x345e3(0x01)
	float TimeSinceLastJump; // 0x345e4(0x04)
	float StartAngle; // 0x345e8(0x04)
	bool SprintTime; // 0x345ec(0x01)
	char pad_345ED[0x3]; // 0x345ed(0x03)
	float SlideAngle; // 0x345f0(0x04)
	bool LookAtRightSide; // 0x345f4(0x01)
	char pad_345F5[0x3]; // 0x345f5(0x03)
	struct TArray<enum class ENUM_RangedWeaponCategories> Weapon - Rifle; // 0x345f8(0x10)
	float Override Right Hand Null; // 0x34608(0x04)
	float Override Left Hand Null; // 0x3460c(0x04)
	bool IsInLowVault; // 0x34610(0x01)
	char pad_34611[0x3]; // 0x34611(0x03)
	float ToClimbBlendTime; // 0x34614(0x04)
	bool AllowSprintToRun; // 0x34618(0x01)
	char pad_34619[0x3]; // 0x34619(0x03)
	struct FVector RightHandIK_Wall; // 0x3461c(0x0c)
	enum class ENUM_SettleType SettleEventEnum_HideWeapon; // 0x34628(0x01)
	char pad_34629[0x3]; // 0x34629(0x03)
	struct FVector LeftHandIK_Wall; // 0x3462c(0x0c)
	float RightHand_WallIK_Dist; // 0x34638(0x04)
	bool LeftHandIK_TraceSuccessful; // 0x3463c(0x01)
	bool RightHandIK_TraceSuccessful; // 0x3463d(0x01)
	char pad_3463E[0x2]; // 0x3463e(0x02)
	float WallCollisionAngle; // 0x34640(0x04)
	float LeftHand_WallIK_Dist; // 0x34644(0x04)
	struct FVector LeftHandIK_Wall_Soft; // 0x34648(0x0c)
	struct FVector RightHandIK_Wall_Soft; // 0x34654(0x0c)
	struct FVector WallSlide_IK_Offset_RightHand; // 0x34660(0x0c)
	struct FVector WallSlide_IK_Offset_LeftHand; // 0x3466c(0x0c)
	struct FRotator WallSlide_RotationOffset_RightHand; // 0x34678(0x0c)
	struct FRotator WallSlide_RotationOffset_LeftHand; // 0x34684(0x0c)
	struct TArray<enum class ENUM_MeleeWeaponCategories> WPN Melee - 2H; // 0x34690(0x10)
	bool RecentlyChangedSetSingleFrameCheck; // 0x346a0(0x01)
	char pad_346A1[0x3]; // 0x346a1(0x03)
	struct FVector PelvisReloadOffset; // 0x346a4(0x0c)
	bool IsInReload; // 0x346b0(0x01)
	char pad_346B1[0x3]; // 0x346b1(0x03)
	float IsInReloadAlpha; // 0x346b4(0x04)
	bool UseAlternativeGrip; // 0x346b8(0x01)
	char pad_346B9[0x3]; // 0x346b9(0x03)
	float WalkStrafeScaled; // 0x346bc(0x04)
	float RunStrafeScaled; // 0x346c0(0x04)
	char pad_346C4[0x4]; // 0x346c4(0x04)
	struct TArray<enum class ENUM_RangedWeaponCategories> OneHandedHipWeaponsMovingList; // 0x346c8(0x10)
	float CameraRollDeltaSmooth; // 0x346d8(0x04)
	float CameraPitchDeltaSmooth; // 0x346dc(0x04)
	float CameraYawDeltaSmooth; // 0x346e0(0x04)
	struct FRotator CurrentCameraWorldRotationLastTick; // 0x346e4(0x0c)
	bool SlidingReload; // 0x346f0(0x01)
	char pad_346F1[0x3]; // 0x346f1(0x03)
	float AimAngleRangedCombatFloat; // 0x346f4(0x04)
	bool (Fp)LowerBodyLayering; // 0x346f8(0x01)
	bool (Fp)OneHandedHipWeaponsMoving; // 0x346f9(0x01)
	bool (Fp)ShouldUseADDLocomotion; // 0x346fa(0x01)
	char pad_346FB[0x1]; // 0x346fb(0x01)
	float RecoilPushbackAmount; // 0x346fc(0x04)
	bool IsInPrimingAnimation; // 0x34700(0x01)
	char pad_34701[0x7]; // 0x34701(0x07)
	struct TArray<enum class ETigerDisciplinesEnum> RotateInPlacePowersArray; // 0x34708(0x10)
	bool Has Input? (before setting var); // 0x34718(0x01)
	char pad_34719[0x3]; // 0x34719(0x03)
	float RecoilShakeAlphaTarget; // 0x3471c(0x04)
	bool NewRecoilSystem; // 0x34720(0x01)
	char pad_34721[0x3]; // 0x34721(0x03)
	float RecoilKickAlpha; // 0x34724(0x04)
	float AimSweepFloat; // 0x34728(0x04)
	char pad_3472C[0x4]; // 0x3472c(0x04)
	struct TArray<enum class ENUM_RangedWeaponCategories> WeaponsReadyForNewRecoil; // 0x34730(0x10)
	bool IsSecondMagazine; // 0x34740(0x01)
	char pad_34741[0x3]; // 0x34741(0x03)
	float DynamicADDReloadAlpha; // 0x34744(0x04)
	bool (Fp)OneHandedHipWeapons; // 0x34748(0x01)
	char pad_34749[0x7]; // 0x34749(0x07)
	struct TArray<enum class ENUM_RangedWeaponCategories> OneHandedHipWeaponsList; // 0x34750(0x10)
	struct TMap<enum class ENUM_RangedWeaponCategories, float> RecoilShakeAlphaAddMap; // 0x34760(0x50)
	struct TArray<enum class ENUM_RangedWeaponCategories> RecoilShakeWeaponsMap; // 0x347b0(0x10)
	struct TMap<enum class ENUM_RangedWeaponCategories, float> ADSRecoilKickAlpha; // 0x347c0(0x50)
	bool ShouldUseAnimatedIK; // 0x34810(0x01)
	char pad_34811[0x3]; // 0x34811(0x03)
	struct FRotator MagazineRotationAmount; // 0x34814(0x0c)
	struct TArray<enum class ENUM_RangedWeaponCategories> NewVar_2; // 0x34820(0x10)
	struct TArray<enum class ENUM_MeleeWeaponCategories> NewVar_4; // 0x34830(0x10)
	bool ShouldMagazineMoveWhileShooting; // 0x34840(0x01)
	char pad_34841[0x3]; // 0x34841(0x03)
	struct FVector DistanceToWallCompensation; // 0x34844(0x0c)
	float ProxyRotationCompensation; // 0x34850(0x04)

	void SoaringLeapLeaningLayer(struct FPoseLink InPose_1, struct FPoseLink SoaringLeapLeaningLayer); // Function ABP_Player.ABP_Player_C.SoaringLeapLeaningLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
	void DiabloAnimationLayer(struct FPoseLink InPose, struct FPoseLink DiabloAnimationLayer); // Function ABP_Player.ABP_Player_C.DiabloAnimationLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
	void MeleeAnimationLayer(struct FPoseLink MeleeInPose, struct FPoseLink MeleeAnimationLayer); // Function ABP_Player.ABP_Player_C.MeleeAnimationLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
	void FaceAnimationLayer(struct FPoseLink FaceAnimationLayer); // Function ABP_Player.ABP_Player_C.FaceAnimationLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
