// AnimBlueprintGeneratedClass ABP_Ranged_Weapon.ABP_Ranged_Weapon_C
// Size: 0x6781 (Inherited: 0x2c0)
struct UABP_Ranged_Weapon_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2f8(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18; // 0x3a8(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17; // 0x500(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0x658(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0x680(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16; // 0x6a8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x800(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_62; // 0x828(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_61; // 0x878(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_49; // 0x8c8(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_60; // 0x968(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_59; // 0x9b8(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_48; // 0xa08(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_47; // 0xaa8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0xb48(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_15; // 0xb78(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0xc28(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15; // 0xc50(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0xda8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0xf00(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_58; // 0xf28(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_57; // 0xf78(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_56; // 0xfc8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_55; // 0x1018(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_54; // 0x1068(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_46; // 0x10b8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_45; // 0x1158(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_44; // 0x11f8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_43; // 0x1298(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x1338(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_14; // 0x1368(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x1418(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x1520(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x1540(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x1560(0x108)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_53; // 0x1668(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_52; // 0x16b8(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_42; // 0x1708(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_51; // 0x17a8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_50; // 0x17f8(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_41; // 0x1848(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_40; // 0x18e8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x1988(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_13; // 0x19b8(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x1a68(0x108)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_49; // 0x1b70(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_48; // 0x1bc0(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_39; // 0x1c10(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_47; // 0x1cb0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_46; // 0x1d00(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_38; // 0x1d50(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_37; // 0x1df0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x1e90(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_12; // 0x1ec0(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_36; // 0x1f70(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0x2010(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0x2168(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x2190(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x21b8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x2200(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x2248(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0x2270(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x23c8(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_45; // 0x23f0(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_35; // 0x2440(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_44; // 0x24e0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_43; // 0x2530(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_42; // 0x2580(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_41; // 0x25d0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_40; // 0x2620(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_34; // 0x2670(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_33; // 0x2710(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_32; // 0x27b0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_31; // 0x2850(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x28f0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_11; // 0x2920(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0x29d0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x2b28(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_39; // 0x2b50(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_38; // 0x2ba0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_37; // 0x2bf0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_36; // 0x2c40(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_35; // 0x2c90(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_30; // 0x2ce0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29; // 0x2d80(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28; // 0x2e20(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27; // 0x2ec0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x2f60(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_10; // 0x2f90(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x3040(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x3198(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_34; // 0x31c0(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x3210(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_9; // 0x3240(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x32f0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x3448(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x3470(0xc0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_33; // 0x3530(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_32; // 0x3580(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_31; // 0x35d0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_30; // 0x3620(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_29; // 0x3670(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26; // 0x36c0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25; // 0x3760(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24; // 0x3800(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x38a0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_8; // 0x38d0(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x3980(0x158)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_28; // 0x3ad8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_27; // 0x3b28(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23; // 0x3b78(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_26; // 0x3c18(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_25; // 0x3c68(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22; // 0x3cb8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0x3d58(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x3df8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0x3e28(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x3ed8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x4030(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_24; // 0x4058(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_23; // 0x40a8(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0x40f8(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_22; // 0x4198(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x41e8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x4288(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_21; // 0x4328(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x4378(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x43a8(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x4458(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x45b0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x45d8(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x4678(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x46c0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x46e8(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x47a8(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x4900(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x4948(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x4970(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_20; // 0x4998(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_19; // 0x49e8(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x4a38(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_18; // 0x4ad8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_17; // 0x4b28(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x4b78(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x4c18(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x4cb8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x4ce8(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x4d98(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x4ef0(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_16; // 0x4f18(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_15; // 0x4f68(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x4fb8(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_14; // 0x5058(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_13; // 0x50a8(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x50f8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x5198(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x5238(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x5268(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x5318(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x5470(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_12; // 0x5498(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_11; // 0x54e8(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x5538(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_10; // 0x55d8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9; // 0x5628(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x5678(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x5718(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x57b8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x57e8(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x5898(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x59f0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x5a18(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x5ab8(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x5b00(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8; // 0x5b28(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7; // 0x5b78(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x5bc8(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0x5c68(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0x5cb8(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x5d08(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x5da8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x5e48(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x5e78(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5f28(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6080(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0x60a8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0x60f8(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x6148(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x61e8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x6238(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x6288(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x6328(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x63c8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x63f8(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x64a8(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x65b0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x65d0(0x20)
	enum class ENUM_RangedWeaponCategories CurrentRangedWeapon; // 0x65f0(0x01)
	bool IsAimingWeapon; // 0x65f1(0x01)
	bool IsHipFiring; // 0x65f2(0x01)
	char pad_65F3[0x1]; // 0x65f3(0x01)
	float FireWeaponBlendInTime; // 0x65f4(0x04)
	bool IsCrouching; // 0x65f8(0x01)
	bool HipOrAimFiring; // 0x65f9(0x01)
	char pad_65FA[0x2]; // 0x65fa(0x02)
	struct FVector RootJointOffset; // 0x65fc(0x0c)
	struct FVector LeftHandIKOffset; // 0x6608(0x0c)
	float IsPlayingAsFemaleFloat; // 0x6614(0x04)
	bool IsMovingOnGround; // 0x6618(0x01)
	char pad_6619[0x7]; // 0x6619(0x07)
	struct TArray<enum class ENUM_RangedWeaponCategories> ShouldOffsetLeftElbow; // 0x6620(0x10)
	float ShouldUseLeftElbowOffsetAlpha; // 0x6630(0x04)
	struct FVector LeftElbowOffset; // 0x6634(0x0c)
	bool WallJumpIsAvailable; // 0x6640(0x01)
	char pad_6641[0x7]; // 0x6641(0x07)
	struct TMap<enum class ENUM_RangedWeaponCategories, struct FVector> RootJointOffsetMap; // 0x6648(0x50)
	struct TMap<enum class ENUM_RangedWeaponCategories, struct FVector> LeftHandOffsetMap; // 0x6698(0x50)
	float WeaponScaleAlpha; // 0x66e8(0x04)
	struct FVector WeaponScaleVector; // 0x66ec(0x0c)
	enum class ETigerGender BodyType; // 0x66f8(0x01)
	char pad_66F9[0x7]; // 0x66f9(0x07)
	struct TMap<enum class ENUM_RangedWeaponCategories, float> WeaponScaleMap; // 0x6700(0x50)
	bool IsPlayingAsFemaleBool; // 0x6750(0x01)
	bool IsSecondaryWeapon; // 0x6751(0x01)
	char pad_6752[0x6]; // 0x6752(0x06)
	struct UABP_Player_C* Anim Instance; // 0x6758(0x08)
	float AimSweepFloat; // 0x6760(0x04)
	char pad_6764[0x4]; // 0x6764(0x04)
	struct ATigerPlayer* Player; // 0x6768(0x08)
	bool Is in Reload; // 0x6770(0x01)
	char pad_6771[0x3]; // 0x6771(0x03)
	struct FRotator MagazineRotationAmount; // 0x6774(0x0c)
	bool RotatingMagazine; // 0x6780(0x01)

	void AnimGraph(struct FPoseLink AnimGraph); // Function ABP_Ranged_Weapon.ABP_Ranged_Weapon_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_Ranged_Weapon.ABP_Ranged_Weapon_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void BlueprintInitializeAnimation(); // Function ABP_Ranged_Weapon.ABP_Ranged_Weapon_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void AnimNotify_HideMagazine1(); // Function ABP_Ranged_Weapon.ABP_Ranged_Weapon_C.AnimNotify_HideMagazine1 // (BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
	void AnimNotify_HideMagazine2(); // Function ABP_Ranged_Weapon.ABP_Ranged_Weapon_C.AnimNotify_HideMagazine2 // (BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
	void AnimNotify_UnHideMagazine1(); // Function ABP_Ranged_Weapon.ABP_Ranged_Weapon_C.AnimNotify_UnHideMagazine1 // (BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
	void AnimNotify_UnHideMagazine2(); // Function ABP_Ranged_Weapon.ABP_Ranged_Weapon_C.AnimNotify_UnHideMagazine2 // (BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
	void ExecuteUbergraph_ABP_Ranged_Weapon(int32_t EntryPoint); // Function ABP_Ranged_Weapon.ABP_Ranged_Weapon_C.ExecuteUbergraph_ABP_Ranged_Weapon // (Final|UbergraphFunction) // @ game+0x16c0340
};

