// BlueprintGeneratedClass DA_WeatherScenario.DA_WeatherScenario_C
// Size: 0x70 (Inherited: 0x38)
struct UDA_WeatherScenario_C : UTigerWeatherScenarioData {
	float WindStrength; // 0x38(0x04)
	float WindSpeed; // 0x3c(0x04)
	float RainRate; // 0x40(0x04)
	float PuddlesAmount; // 0x44(0x04)
	float PuddlesRingsIntensity; // 0x48(0x04)
	float PuddlesWindTiling; // 0x4c(0x04)
	float AIPerception; // 0x50(0x04)
	float RainAudioMin; // 0x54(0x04)
	float ThunderAudioMin; // 0x58(0x04)
	float WindAudioMin; // 0x5c(0x04)
	int32_t ExponensialHeightFog; // 0x60(0x04)
	float RainAudioMax; // 0x64(0x04)
	float ThunderAudioMax; // 0x68(0x04)
	float WindAudioMax; // 0x6c(0x04)
};

