// BlueprintGeneratedClass TBP_PaperDoll_SceneLighting_BRUCLAN.TBP_PaperDoll_SceneLighting_BRUCLAN_C
// Size: 0x288 (Inherited: 0x228)
struct ATBP_PaperDoll_SceneLighting_BRUCLAN_C : AActor {
	struct USpotLightComponent* SpotLight9; // 0x228(0x08)
	struct USpotLightComponent* SpotLight8; // 0x230(0x08)
	struct USpotLightComponent* SpotLight7; // 0x238(0x08)
	struct USpotLightComponent* SpotLight4; // 0x240(0x08)
	struct USpotLightComponent* SpotLight; // 0x248(0x08)
	struct USpotLightComponent* SpotLight6; // 0x250(0x08)
	struct USpotLightComponent* SpotLight5; // 0x258(0x08)
	struct USpotLightComponent* SpotLight3; // 0x260(0x08)
	struct USpotLightComponent* SpotLight2; // 0x268(0x08)
	struct USpotLightComponent* SpotLight1; // 0x270(0x08)
	struct USceneComponent* Scene; // 0x278(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x280(0x08)
};

