// WidgetBlueprintGeneratedClass TBP_UI_ScopedCrosshair.TBP_UI_ScopedCrosshair_C
// Size: 0x3c8 (Inherited: 0x380)
struct UTBP_UI_ScopedCrosshair_C : UTBP_UI_BaseRangedCrosshair_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x380(0x08)
	struct UImage* Image; // 0x388(0x08)
	struct UImage* Image_2; // 0x390(0x08)
	struct UImage* Image_3; // 0x398(0x08)
	struct UImage* Image_4; // 0x3a0(0x08)
	struct UImage* Image_5; // 0x3a8(0x08)
	struct UImage* Image_6; // 0x3b0(0x08)
	struct UImage* Image_154; // 0x3b8(0x08)
	struct UImage* Image_276; // 0x3c0(0x08)

	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function TBP_UI_ScopedCrosshair.TBP_UI_ScopedCrosshair_C.Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x16c0340
	void ExecuteUbergraph_TBP_UI_ScopedCrosshair(int32_t EntryPoint); // Function TBP_UI_ScopedCrosshair.TBP_UI_ScopedCrosshair_C.ExecuteUbergraph_TBP_UI_ScopedCrosshair // (Final|UbergraphFunction|HasDefaults) // @ game+0x16c0340
};

