// Class Tiger.ChooseNextWaypoint
// Size: 0xe8 (Inherited: 0x70)
struct UChooseNextWaypoint : UBTTaskNode {
	struct FBlackboardKeySelector Index; // 0x70(0x28)
	struct FBlackboardKeySelector Waypoint; // 0x98(0x28)
	struct FBlackboardKeySelector bWaypointDirectionIsForward; // 0xc0(0x28)
};

// Class Tiger.TigerBuff
// Size: 0x270 (Inherited: 0x28)
struct UTigerBuff : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct FTigerCharacterStatModification StatModification; // 0x30(0xb4)
	struct FTigerStatusEffect StatusEffect; // 0xe4(0x0b)
	char pad_EF[0x1]; // 0xef(0x01)
	float Duration; // 0xf0(0x04)
	bool bDoesTick; // 0xf4(0x01)
	char pad_F5[0x3]; // 0xf5(0x03)
	float TimeBetweenTicks; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct FTigerNiagaraAttachment ActivatedNiagaraAttachment; // 0x100(0x48)
	struct FTigerNiagaraAttachment NiagaraAttachment; // 0x148(0x48)
	struct TArray<struct FTigerNiagaraAttachment> AdditionalNiagaraAttachments; // 0x190(0x10)
	struct FTigerNiagaraAttachment DeactivatedNiagaraAttachment; // 0x1a0(0x48)
	bool bOnlySpawnBuffParticleOnLocalPlayer; // 0x1e8(0x01)
	bool bAttachToMesh; // 0x1e9(0x01)
	char pad_1EA[0x2]; // 0x1ea(0x02)
	struct FName AttachPoint; // 0x1ec(0x08)
	bool bBuffParticleTypeAbsoluteRotation; // 0x1f4(0x01)
	char pad_1F5[0x3]; // 0x1f5(0x03)
	struct UParticleSystem* BuffParticleType; // 0x1f8(0x08)
	bool bOnlySpawnActivatedParticleOnLocalPlayer; // 0x200(0x01)
	bool bAttachActivatedParticle; // 0x201(0x01)
	bool bActivatedParticleTypeAbsoluteRotation; // 0x202(0x01)
	char pad_203[0x5]; // 0x203(0x05)
	struct UParticleSystem* ActivatedParticleType; // 0x208(0x08)
	bool bOnlySpawnDeactivatedParticleOnLocalPlayer; // 0x210(0x01)
	bool bAttachDeactivatedParticle; // 0x211(0x01)
	bool bDeactivatedParticleTypeAbsoluteRotation; // 0x212(0x01)
	char pad_213[0x5]; // 0x213(0x05)
	struct UParticleSystem* DeactivatedParticleType; // 0x218(0x08)
	struct FName ActivationMontageName; // 0x220(0x08)
	struct UAkAudioEvent* ActivatedSFX; // 0x228(0x08)
	struct UAkAudioEvent* DeactivatedSFX; // 0x230(0x08)
	bool bStacks; // 0x238(0x01)
	bool bOnlyStackWithDifferentCasters; // 0x239(0x01)
	char pad_23A[0x2]; // 0x23a(0x02)
	int32_t MaxStacks; // 0x23c(0x04)
	bool bKeepAfterDeath; // 0x240(0x01)
	char pad_241[0x3]; // 0x241(0x03)
	int32_t RemoveBuffOnActions; // 0x244(0x04)
	bool bShowOnUI; // 0x248(0x01)
	char pad_249[0x7]; // 0x249(0x07)
	struct UTexture2D* StatusImage; // 0x250(0x08)
	enum class ETigerBuffStatusType StatusType; // 0x258(0x01)
	enum class ETigerBuffProgressType ProgressType; // 0x259(0x01)
	char pad_25A[0x6]; // 0x25a(0x06)
	struct ATigerBuffPostProcess* PostProcessEffect; // 0x260(0x08)
	uint64_t PersistentTelemetryID; // 0x268(0x08)

	void OnDeactivated(struct ATigerCharacter* InBuffOwner, struct ATigerCharacter* InBuffCaster); // Function Tiger.TigerBuff.OnDeactivated // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void OnActivated(struct ATigerCharacter* InBuffOwner, struct ATigerCharacter* InBuffCaster); // Function Tiger.TigerBuff.OnActivated // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	struct UTigerBuffInstance* FindBuffInstance(struct ATigerCharacter* InBuffOwner, struct ATigerCharacter* InBuffCaster); // Function Tiger.TigerBuff.FindBuffInstance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1246d30
};

// Class Tiger.TigerBuffStun
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffStun : UTigerBuff {
};

// Class Tiger.TigerBuffBlockAILogic
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffBlockAILogic : UTigerBuff {
};

// Class Tiger.TigerBuffImmobilize
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffImmobilize : UTigerBuff {
};

// Class Tiger.TigerBuffGround
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffGround : UTigerBuff {
};

// Class Tiger.TigerBuffInvulnerable
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffInvulnerable : UTigerBuff {
};

// Class Tiger.TigerBuffInvisible
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffInvisible : UTigerBuff {
};

// Class Tiger.TigerBuffDisableClimbing
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffDisableClimbing : UTigerBuff {
};

// Class Tiger.TigerKeyTextureMapping
// Size: 0x80 (Inherited: 0x30)
struct UTigerKeyTextureMapping : UDataAsset {
	struct TMap<struct FKey, struct UTexture2D*> KeyTextures; // 0x30(0x50)
};

// Class Tiger.PatrolComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UPatrolComponent : UActorComponent {
};

// Class Tiger.TigerRebuildableActor
// Size: 0x240 (Inherited: 0x228)
struct ATigerRebuildableActor : AActor {
	struct USceneComponent* Root; // 0x228(0x08)
	struct TArray<struct USceneComponent*> BuildCreatedComponents; // 0x230(0x10)

	void OnRebuild(); // Function Tiger.TigerRebuildableActor.OnRebuild // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	struct USceneComponent* ConvertToBuildComponent(struct USceneComponent* BlueprintCreatedComponent); // Function Tiger.TigerRebuildableActor.ConvertToBuildComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x132be90
};

// Class Tiger.TigerActivatedObject
// Size: 0x278 (Inherited: 0x240)
struct ATigerActivatedObject : ATigerRebuildableActor {
	struct UStaticMeshComponent* BaseMesh; // 0x240(0x08)
	struct UAkAudioEvent* ActivationAudioEvent; // 0x248(0x08)
	bool bActivationAudioShouldPlay; // 0x250(0x01)
	bool bTriggerOnlyOnPlayers; // 0x251(0x01)
	bool bUseAudioActivationRadius; // 0x252(0x01)
	char pad_253[0x1]; // 0x253(0x01)
	float ActivationRadius; // 0x254(0x04)
	float AudioFadeOutDuration; // 0x258(0x04)
	struct TWeakObjectPtr<struct UShapeComponent> WeakCharacterTrigger; // 0x25c(0x08)
	char pad_264[0x14]; // 0x264(0x14)

	void SetCharacterTriggerComponent(struct UShapeComponent* TriggerComponent); // Function Tiger.TigerActivatedObject.SetCharacterTriggerComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x1224910
	void OnObjectDeactivated(); // Function Tiger.TigerActivatedObject.OnObjectDeactivated // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void OnObjectActivated(); // Function Tiger.TigerActivatedObject.OnObjectActivated // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void OnEndCharacterOverlap(struct ATigerCharacter* OverlappingCharacter, int32_t TotalOverlapCount); // Function Tiger.TigerActivatedObject.OnEndCharacterOverlap // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void OnBeginCharacterOverlap(struct ATigerCharacter* OverlappingCharacter, int32_t TotalOverlapCount); // Function Tiger.TigerActivatedObject.OnBeginCharacterOverlap // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void EndCharacterOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function Tiger.TigerActivatedObject.EndCharacterOverlap // (Final|Native|Private) // @ game+0x12242f0
	void BeginCharacterOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function Tiger.TigerActivatedObject.BeginCharacterOverlap // (Final|Native|Private|HasOutParms) // @ game+0x1223de0
};

// Class Tiger.TigerActivatedObjectSubsystem
// Size: 0xc0 (Inherited: 0x30)
struct UTigerActivatedObjectSubsystem : UGameInstanceSubsystem {
	char pad_30[0x90]; // 0x30(0x90)
};

// Class Tiger.TigerCameraBehavior
// Size: 0xe8 (Inherited: 0x28)
struct UTigerCameraBehavior : UObject {
	struct UTigerCameraPreset* CameraPreset; // 0x28(0x08)
	char pad_30[0xb8]; // 0x30(0xb8)
};

// Class Tiger.TigerActiveCameraBehavior
// Size: 0x128 (Inherited: 0xe8)
struct UTigerActiveCameraBehavior : UTigerCameraBehavior {
	char pad_E8[0x40]; // 0xe8(0x40)
};

// Class Tiger.TigerAdditiveCameraBehavior
// Size: 0x128 (Inherited: 0xe8)
struct UTigerAdditiveCameraBehavior : UTigerCameraBehavior {
	char pad_E8[0x40]; // 0xe8(0x40)
};

// Class Tiger.TigerAIAwayFromSuspiciousService
// Size: 0x140 (Inherited: 0x70)
struct UTigerAIAwayFromSuspiciousService : UBTService {
	struct FBox SearchFleeSpotBox; // 0x70(0x1c)
	char pad_8C[0x4]; // 0x8c(0x04)
	struct FBlackboardKeySelector FleePoint; // 0x90(0x28)
	struct FBlackboardKeySelector CurrentMasqueradeTarget; // 0xb8(0x28)
	struct FBlackboardKeySelector WantsToReportPlayer; // 0xe0(0x28)
	float KeepFleeingFromSpecificPlayerRadiusSquared; // 0x108(0x04)
	float BoxCenterDistanceFromNPCPosition; // 0x10c(0x04)
	uint32_t NumberOfTimesToRandomForAFleeSpot; // 0x110(0x04)
	bool bShowDebugFeatures; // 0x114(0x01)
	char pad_115[0x3]; // 0x115(0x03)
	struct TWeakObjectPtr<struct ATigerPlayer> PlayerFleeingFrom; // 0x118(0x08)
	char pad_120[0x20]; // 0x120(0x20)
};

// Class Tiger.TigerAiBarkTask
// Size: 0x78 (Inherited: 0x70)
struct UTigerAiBarkTask : UBTTaskNode {
	struct FTigerNpcVoCategory BarkToPlay; // 0x70(0x08)
};

// Class Tiger.TigerAiBaseController
// Size: 0x3b0 (Inherited: 0x330)
struct ATigerAiBaseController : AAIController {
	struct FVector SpawnPoint; // 0x330(0x0c)
	char pad_33C[0x4]; // 0x33c(0x04)
	struct UTigerSightConfigAsset* SightConfigAsset; // 0x340(0x08)
	char pad_348[0x68]; // 0x348(0x68)

	void UnregisterMovementTicket(); // Function Tiger.TigerAiBaseController.UnregisterMovementTicket // (Final|Native|Protected|BlueprintCallable) // @ game+0x1224a30
	float PlayAnimationUnreliable(struct UAnimMontage* Animation); // Function Tiger.TigerAiBaseController.PlayAnimationUnreliable // (Final|Native|Public|BlueprintCallable) // @ game+0x1224870
	float PlayAnimationFromNameUnreliable(struct FName Animation); // Function Tiger.TigerAiBaseController.PlayAnimationFromNameUnreliable // (Final|Native|Public|BlueprintCallable) // @ game+0x12247d0
	bool HasPathToLocation(struct FVector Location); // Function Tiger.TigerAiBaseController.HasPathToLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1224710
	bool GetSightProperties(enum class ETigerNPCType NPCType, struct FTigerSightConfigProperties OutSightProps); // Function Tiger.TigerAiBaseController.GetSightProperties // (Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x12245f0
	struct UAISenseConfig_Sight* GetSightConfig(); // Function Tiger.TigerAiBaseController.GetSightConfig // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12245c0
	struct ATigerBaseNPC* GetBaseNpcPawn(); // Function Tiger.TigerAiBaseController.GetBaseNpcPawn // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1224590
	bool FindPointOnAiNavMeshWithinExtent(struct FVector Origin, struct FVector Extent, struct FVector OutLocation); // Function Tiger.TigerAiBaseController.FindPointOnAiNavMeshWithinExtent // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1224450
};

// Class Tiger.TigerAIBenchmarkDiablerizeTask
// Size: 0xa8 (Inherited: 0x98)
struct UTigerAIBenchmarkDiablerizeTask : UBTTask_BlackboardBase {
	float MaximumDiablerizeDistance; // 0x98(0x04)
	char pad_9C[0xc]; // 0x9c(0x0c)
};

// Class Tiger.TigerAiBenchmarkDisciplineTask
// Size: 0xd8 (Inherited: 0x98)
struct UTigerAiBenchmarkDisciplineTask : UBTTask_BlackboardBase {
	struct ATigerLocalAIControllerBase* AIControllerBase; // 0x98(0x08)
	struct ATigerPlayerController* TigerPlayerController; // 0xa0(0x08)
	struct ATigerCharacter* AiTigerCharacter; // 0xa8(0x08)
	struct ATigerPlayer* TigerPlayer; // 0xb0(0x08)
	struct UTigerDisciplineComponent* DisciplineComponent; // 0xb8(0x08)
	struct UTigerDisciplineBase* CurrentDisciplineBase; // 0xc0(0x08)
	char pad_C8[0x10]; // 0xc8(0x10)
};

// Class Tiger.TigerAIBenchmarkFindPlayerTask
// Size: 0xb8 (Inherited: 0x98)
struct UTigerAIBenchmarkFindPlayerTask : UBTTask_BlackboardBase {
	bool bUseHeightenedSensesSearchRadius; // 0x98(0x01)
	char pad_99[0x3]; // 0x99(0x03)
	float CustomSearchSphereRadius; // 0x9c(0x04)
	bool bDrawSearchSphere; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	float MaxVerticalPositionOffset; // 0xa4(0x04)
	float RaycastDistance; // 0xa8(0x04)
	int32_t SearchLowLevelThreshold; // 0xac(0x04)
	float SearchLowHealthPercentageThreshold; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
};

// Class Tiger.TigerAiCalculateFiringLocationsScoreService
// Size: 0xa0 (Inherited: 0x70)
struct UTigerAiCalculateFiringLocationsScoreService : UBTService {
	struct FBlackboardKeySelector TargetKey; // 0x70(0x28)
	bool bDebugDrawLocations; // 0x98(0x01)
	bool bDebugDrawSweepChecks; // 0x99(0x01)
	bool bDebugDrawInvalidLocationReason; // 0x9a(0x01)
	char pad_9B[0x5]; // 0x9b(0x05)
};

// Class Tiger.TigerAiCanCrouch
// Size: 0x70 (Inherited: 0x68)
struct UTigerAiCanCrouch : UBTDecorator {
	float MinCrouchDistanceBuffer; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
};

// Class Tiger.TigerAiCanFleeDecorator
// Size: 0x68 (Inherited: 0x68)
struct UTigerAiCanFleeDecorator : UBTDecorator {
};

// Class Tiger.TigerAICanInvestigateDecorator
// Size: 0x90 (Inherited: 0x68)
struct UTigerAICanInvestigateDecorator : UBTDecorator {
	struct FBlackboardKeySelector CurrentSuspiciousTarget; // 0x68(0x28)
};

// Class Tiger.TigerAiCanUseWeaponPowerDecorator
// Size: 0x70 (Inherited: 0x68)
struct UTigerAiCanUseWeaponPowerDecorator : UBTDecorator {
	bool bConditionInvertedOnTick; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
};

// Class Tiger.TigerAICAPBase
// Size: 0x258 (Inherited: 0x228)
struct ATigerAICAPBase : AActor {
	struct TArray<struct ATigerNPC*> NPCUsingCAP; // 0x228(0x10)
	struct TArray<struct UShapeComponent*> Colliders; // 0x238(0x10)
	float Cooldown; // 0x248(0x04)
	int32_t NumberOfSlots; // 0x24c(0x04)
	bool bShouldAdjustTransform; // 0x250(0x01)
	bool bAllowExternalProps; // 0x251(0x01)
	char pad_252[0x6]; // 0x252(0x06)

	bool OnCheckNPCEligibility(struct ATigerNPC* NPC); // Function Tiger.TigerAICAPBase.OnCheckNPCEligibility // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
	bool CapIsEmpty(); // Function Tiger.TigerAICAPBase.CapIsEmpty // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1224230
	void BeginOverlappedActor(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function Tiger.TigerAICAPBase.BeginOverlappedActor // (Native|Public|HasOutParms) // @ game+0x1224010
};

// Class Tiger.TigerAICAP
// Size: 0x268 (Inherited: 0x258)
struct ATigerAICAP : ATigerAICAPBase {
	struct TArray<struct UTigerAICommandBase*> Commands; // 0x258(0x10)
};

// Class Tiger.TigerAiCheckCanDiablerize
// Size: 0x70 (Inherited: 0x68)
struct UTigerAiCheckCanDiablerize : UBTDecorator {
	bool bConditionInvertedOnTick; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
};

// Class Tiger.TigerAiCheckIsTargetDowned
// Size: 0x70 (Inherited: 0x68)
struct UTigerAiCheckIsTargetDowned : UBTDecorator {
	bool bConditionInvertedOnTick; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
};

// Class Tiger.TigerAIClearMasqueradeTargetTask
// Size: 0x70 (Inherited: 0x70)
struct UTigerAIClearMasqueradeTargetTask : UBTTaskNode {
};

// Class Tiger.TigerAICommandBase
// Size: 0x40 (Inherited: 0x28)
struct UTigerAICommandBase : UObject {
	struct ATigerAIController* Owner; // 0x28(0x08)
	struct AActor* WorldReferenceActor; // 0x30(0x08)
	float FailSafeMaxTime; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)

	void DeactivateCommand(bool bHasFinished); // Function Tiger.TigerAICommandBase.DeactivateCommand // (Native|Public|BlueprintCallable) // @ game+0x1224260
};

// Class Tiger.TigerAICommandAbandonCAP
// Size: 0x48 (Inherited: 0x40)
struct UTigerAICommandAbandonCAP : UTigerAICommandBase {
	float ChanceToAbandonCAP; // 0x40(0x04)
	bool bShouldFindSpline; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
};

// Class Tiger.TigerAICommandComponent
// Size: 0x140 (Inherited: 0xb0)
struct UTigerAICommandComponent : UActorComponent {
	char pad_B0[0x40]; // 0xb0(0x40)
	struct ATigerAiPermanentCap* PermanentCap; // 0xf0(0x08)
	struct ATigerNPC* Owner; // 0xf8(0x08)
	struct UTigerAICommandBase* ActiveCommand; // 0x100(0x08)
	struct UAnimMontage* LastPlayedCapMontage; // 0x108(0x08)
	struct FTigerCommandQueue CommandQueue; // 0x110(0x10)
	struct FName ContextBaseIdle; // 0x120(0x08)
	char pad_128[0x18]; // 0x128(0x18)

	void SetContextIdle(struct FName ContextName); // Function Tiger.TigerAICommandComponent.SetContextIdle // (Final|Native|Public|BlueprintCallable) // @ game+0x12249a0
	void InterruptAndClearCommands(); // Function Tiger.TigerAICommandComponent.InterruptAndClearCommands // (Final|Native|Public|BlueprintCallable) // @ game+0x12247b0
	struct UTigerAICommandBase* AddCommand(struct UTigerAICommandBase* Command, struct ATigerAICAPBase* CommandGiver); // Function Tiger.TigerAICommandComponent.AddCommand // (Final|Native|Public|BlueprintCallable) // @ game+0x1223d10
};

// Class Tiger.TigerAICommandContextualAction
// Size: 0x80 (Inherited: 0x40)
struct UTigerAICommandContextualAction : UTigerAICommandBase {
	struct TArray<struct FTigerContextualAnimationWrapper> ContextualAnimations; // 0x40(0x10)
	float WaitTimeBefore; // 0x50(0x04)
	float WaitTimeBeforeRandomDeviation; // 0x54(0x04)
	float WaitTimeAfter; // 0x58(0x04)
	float WaitTimeAfterRandomDeviation; // 0x5c(0x04)
	char pad_60[0x20]; // 0x60(0x20)
};

// Class Tiger.TigerAICommandMoveTo
// Size: 0x68 (Inherited: 0x40)
struct UTigerAICommandMoveTo : UTigerAICommandBase {
	struct FTigerAIMoveToLocationData MoveToData; // 0x40(0x18)
	char pad_58[0x10]; // 0x58(0x10)
};

// Class Tiger.TigerAICommandPlayerProximityWait
// Size: 0x48 (Inherited: 0x40)
struct UTigerAICommandPlayerProximityWait : UTigerAICommandBase {
	float SquaredPlayerProximityRadiusRequired; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Tiger.TigerAICommandWaitForOrder
// Size: 0x48 (Inherited: 0x40)
struct UTigerAICommandWaitForOrder : UTigerAICommandBase {
	char pad_40[0x8]; // 0x40(0x08)
};

// Class Tiger.TigerAIController
// Size: 0x498 (Inherited: 0x3b0)
struct ATigerAIController : ATigerAiBaseController {
	struct FName LureTargetKeyName; // 0x3b0(0x08)
	struct FName CurrentMasqueradeTargetKeyName; // 0x3b8(0x08)
	struct FName TargetPositionKeyName; // 0x3c0(0x08)
	struct FName MasqueradeBreachTargetKey; // 0x3c8(0x08)
	struct FName BehaviorIsActiveKeyName; // 0x3d0(0x08)
	struct FName SpawnPointKeyName; // 0x3d8(0x08)
	struct FName ActiveCAPKeyName; // 0x3e0(0x08)
	struct UBehaviorTree* LureBehaviorTree; // 0x3e8(0x08)
	struct UBehaviorTree* BloodDrainedBehaviorTree; // 0x3f0(0x08)
	struct UBehaviorTree* EmptyBehaviorTree; // 0x3f8(0x08)
	struct UTigerFearValueAsset* FearValueAsset; // 0x400(0x08)
	float OutOfCombatHealthRegenerationDelay; // 0x408(0x04)
	float OutOfCombatHealthRegenerationTickInterval; // 0x40c(0x04)
	float OutOfCombatTickHealthPercentage; // 0x410(0x04)
	float TimeWhenEnteredBloodDrainedState; // 0x414(0x04)
	float CheckForPlayerWeaponsInterval; // 0x418(0x04)
	float CheckForPlayerWeaponsDeviation; // 0x41c(0x04)
	float BaseThreatRadiusForEquippedRanged; // 0x420(0x04)
	float BaseThreatRadiusForEquippedMelee; // 0x424(0x04)
	float FearValue; // 0x428(0x04)
	float MaxFearValue; // 0x42c(0x04)
	float MinCrouchDistanceFromPlayer; // 0x430(0x04)
	float ChanceToFleeWhenEnteringThreatenedState; // 0x434(0x04)
	char pad_438[0x30]; // 0x438(0x30)
	struct UTigerNpcMovementRestrictionBoundsData* MovementRestrictionBoundsData; // 0x468(0x08)
	struct UTigerNpcMovementRestrictionBoundsData* TargetMovementRestrictionBoundsData; // 0x470(0x08)
	char pad_478[0x20]; // 0x478(0x20)

	void SetupData(enum class ETigerNPCType InNPCType); // Function Tiger.TigerAIController.SetupData // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void SetNewReactionData(struct FTigerNpcReactionEvent ReactionEvent); // Function Tiger.TigerAIController.SetNewReactionData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1228dc0
	struct FTigerNpcReactionEvent SetLastReactionData(); // Function Tiger.TigerAIController.SetLastReactionData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1228d10
	void SetFearValue(float InFearValue); // Function Tiger.TigerAIController.SetFearValue // (Final|Native|Public|BlueprintCallable) // @ game+0x1228c90
	void SetCurrentMasqueradeTarget(struct UBlackboardComponent* BBComp, struct ATigerCharacter* InLookAtTarget); // Function Tiger.TigerAIController.SetCurrentMasqueradeTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x1228b30
	void RunDefaultBehavior(); // Function Tiger.TigerAIController.RunDefaultBehavior // (Final|Native|Public|BlueprintCallable) // @ game+0x1228b10
	void RequestInvestigationTicket(struct ATigerPlayer* TigerPlayer); // Function Tiger.TigerAIController.RequestInvestigationTicket // (Final|Native|Public|BlueprintCallable) // @ game+0x1228a80
	bool IsReacting(); // Function Tiger.TigerAIController.IsReacting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1228980
	struct ATigerNPC* GetTigerPawn(); // Function Tiger.TigerAIController.GetTigerPawn // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1228960
	float GetMaxFearValue(); // Function Tiger.TigerAIController.GetMaxFearValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1228750
	float GetFearValue(); // Function Tiger.TigerAIController.GetFearValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1228730
	float GetFearPercentage(); // Function Tiger.TigerAIController.GetFearPercentage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1228700
	enum class ETigerAIMasqueradeState GetCurrentBehaviorState(); // Function Tiger.TigerAIController.GetCurrentBehaviorState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12286e0
	struct ATigerAICAPBase* GetActiveCAP(); // Function Tiger.TigerAIController.GetActiveCAP // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12286b0
	void ClearCurrentMasqueradeTarget(struct UBlackboardComponent* BBComp); // Function Tiger.TigerAIController.ClearCurrentMasqueradeTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x1228620
	void CancelLureBehavior(); // Function Tiger.TigerAIController.CancelLureBehavior // (Final|Native|Public|BlueprintCallable) // @ game+0x1228530
	void AdjustFearValue(float Adjustment); // Function Tiger.TigerAIController.AdjustFearValue // (Final|Native|Public|BlueprintCallable) // @ game+0x1228310
};

// Class Tiger.TigerAiMovementBudgetAsset
// Size: 0x80 (Inherited: 0x30)
struct UTigerAiMovementBudgetAsset : UDataAsset {
	struct TMap<struct FName, struct FTigerAiMovementBudget> MovementBudgets; // 0x30(0x50)
};

// Class Tiger.TigerAICoordinator
// Size: 0x3f0 (Inherited: 0xb0)
struct UTigerAICoordinator : UActorComponent {
	float SprintTimeUntilReport; // 0xb0(0x04)
	float ClimbTimeUntilReport; // 0xb4(0x04)
	float AirTimeUntilReport; // 0xb8(0x04)
	float SuspicionStateTime; // 0xbc(0x04)
	float ThreatStateTime; // 0xc0(0x04)
	float SuspiciousStateEscapeRadiusSquared; // 0xc4(0x04)
	float ThreatenedStateEscapeRadiusSquared; // 0xc8(0x04)
	float MakeNearbyNPCsSuspiciousRadius; // 0xcc(0x04)
	float FearValueDecreasePerSecond; // 0xd0(0x04)
	float CrimeActionCooldownDistance; // 0xd4(0x04)
	char pad_D8[0x4]; // 0xd8(0x04)
	float CrimeActionMasqueradePointThreshold; // 0xdc(0x04)
	float PatrollingHelicopterEventRadius; // 0xe0(0x04)
	float PatrollingHelicopterLowestResponseHeight; // 0xe4(0x04)
	float PatrollingHelicopterEventTimeOut; // 0xe8(0x04)
	float PatrollingHelicopterTimeBetweenGunfireEventPositionUpdate; // 0xec(0x04)
	float TimeInSmokeUntilRemoval; // 0xf0(0x04)
	bool bUseMovementTickets; // 0xf4(0x01)
	char pad_F5[0x3]; // 0xf5(0x03)
	struct UTigerAiMovementBudgetAsset* MovementBudgetAsset; // 0xf8(0x08)
	bool bPatrollingHelicotpersAreActive; // 0x100(0x01)
	char pad_101[0x97]; // 0x101(0x97)
	struct TArray<struct ATigerEntityPatrollingHelicopter*> EntityPatrollingHelicopters; // 0x198(0x10)
	char pad_1A8[0x80]; // 0x1a8(0x80)
	struct TArray<struct UTigerAiEntityPlatoon*> EntityPlatoons; // 0x228(0x10)
	struct TArray<struct UTigerAiSquad*> Squads; // 0x238(0x10)
	char pad_248[0xa0]; // 0x248(0xa0)
	struct ATigerPlayerGrid* PlayerGrid; // 0x2e8(0x08)
	char pad_2F0[0xc8]; // 0x2f0(0xc8)
	struct TArray<struct FTigerPlayerActionProcessData> DelayedPlayerActionProcesses; // 0x3b8(0x10)
	char pad_3C8[0x28]; // 0x3c8(0x28)

	void SetNPCSightModifier(float Modifier); // Function Tiger.TigerAICoordinator.SetNPCSightModifier // (Final|Native|Public|BlueprintCallable) // @ game+0x1228d40
	void SetEnableAICoordinator(bool bEnabled); // Function Tiger.TigerAICoordinator.SetEnableAICoordinator // (Final|Native|Public|BlueprintCallable) // @ game+0x1228c00
	void CacheFearValueThresholds(struct UTigerFearValueAsset* CivFearValueAsset, struct UTigerFearValueAsset* PolFearValueAsset); // Function Tiger.TigerAICoordinator.CacheFearValueThresholds // (Final|Native|Public|BlueprintCallable) // @ game+0x1228460
};

// Class Tiger.TigerAiDisciplineTaskBase
// Size: 0xc8 (Inherited: 0x98)
struct UTigerAiDisciplineTaskBase : UBTTask_BlackboardBase {
	struct ATigerLocalAIController* LocalAIController; // 0x98(0x08)
	struct ATigerCharacter* AiTigerCharacter; // 0xa0(0x08)
	struct UTigerDisciplineComponent* DisciplineComponent; // 0xa8(0x08)
	struct UTigerDisciplineBase* CurrentDisciplineBase; // 0xb0(0x08)
	char pad_B8[0x10]; // 0xb8(0x10)
};

// Class Tiger.TigerAiEntityMovementModeService
// Size: 0xc8 (Inherited: 0x70)
struct UTigerAiEntityMovementModeService : UBTService {
	struct FBlackboardKeySelector TargetLocationKey; // 0x70(0x28)
	struct FBlackboardKeySelector bCanShootKey; // 0x98(0x28)
	float StartSprintDistanceBuffer; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
};

// Class Tiger.TigerAiEntityPlatoon
// Size: 0x58 (Inherited: 0x28)
struct UTigerAiEntityPlatoon : UObject {
	char pad_28[0x30]; // 0x28(0x30)
};

// Class Tiger.TigerAIEntityReactPlayersService
// Size: 0xa0 (Inherited: 0x70)
struct UTigerAIEntityReactPlayersService : UBTService {
	struct FBlackboardKeySelector SuspiciousTarget; // 0x70(0x28)
	float ThresholdDistanceSquared; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class Tiger.TigerAiFindFiringLocation
// Size: 0x118 (Inherited: 0x70)
struct UTigerAiFindFiringLocation : UBTTaskNode {
	struct FBlackboardKeySelector TargetKey; // 0x70(0x28)
	struct FBlackboardKeySelector FiringLocationKey; // 0x98(0x28)
	struct FBlackboardKeySelector FiringLocationIndexKey; // 0xc0(0x28)
	struct FBlackboardKeySelector bCanShootKey; // 0xe8(0x28)
	float ClaimedLocationDuration; // 0x110(0x04)
	bool bDebugDraw; // 0x114(0x01)
	char pad_115[0x3]; // 0x115(0x03)
};

// Class Tiger.TigerAIFireAtActorTask
// Size: 0xe8 (Inherited: 0x98)
struct UTigerAIFireAtActorTask : UBTTask_BlackboardBase {
	struct FBlackboardKeySelector TargetToShootActorKey; // 0x98(0x28)
	struct FBlackboardKeySelector CanShootKey; // 0xc0(0x28)
};

// Class Tiger.TigerAIFleeFromThreatService
// Size: 0x140 (Inherited: 0x70)
struct UTigerAIFleeFromThreatService : UBTService {
	struct FBox SearchFleeSpotBox; // 0x70(0x1c)
	char pad_8C[0x4]; // 0x8c(0x04)
	struct FBlackboardKeySelector FleePoint; // 0x90(0x28)
	struct FBlackboardKeySelector ClosestThreatPosition; // 0xb8(0x28)
	struct FBlackboardKeySelector CurrentMasqueradeTarget; // 0xe0(0x28)
	float KeepFleeingFromSpecificPlayerRadiusSquared; // 0x108(0x04)
	float BoxCenterDistanceFromNPCPosition; // 0x10c(0x04)
	bool bShowDebugFeatures; // 0x110(0x01)
	char pad_111[0x3]; // 0x111(0x03)
	struct TWeakObjectPtr<struct ATigerPlayer> PlayerFleeingFrom; // 0x114(0x08)
	char pad_11C[0x24]; // 0x11c(0x24)
};

// Class Tiger.TigerAIGetSuspectTargetService
// Size: 0xc8 (Inherited: 0x70)
struct UTigerAIGetSuspectTargetService : UBTService {
	struct FBlackboardKeySelector SuspectPosition; // 0x70(0x28)
	struct FBlackboardKeySelector CurrentSuspectTarget; // 0x98(0x28)
	bool bShowDebugFeatures; // 0xc0(0x01)
	char pad_C1[0x7]; // 0xc1(0x07)
};

// Class Tiger.TigerAiGiveOrderToSquad
// Size: 0x78 (Inherited: 0x70)
struct UTigerAiGiveOrderToSquad : UBTTaskNode {
	enum class ETigerNpcSquadOrder OrderToGive; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Tiger.TigerAiSpawningCap
// Size: 0x290 (Inherited: 0x258)
struct ATigerAiSpawningCap : ATigerAICAPBase {
	struct USceneComponent* SceneComp; // 0x258(0x08)
	struct UChildActorComponent* NPCSpawner; // 0x260(0x08)
	struct FName SpawningGroup; // 0x268(0x08)
	struct FName SpawnedNpcMovementGroup; // 0x270(0x08)
	struct FGuid SpawningSubGroupId; // 0x278(0x10)
	char pad_288[0x8]; // 0x288(0x08)
};

// Class Tiger.TigerAIGroupCAP
// Size: 0x2a0 (Inherited: 0x290)
struct ATigerAIGroupCAP : ATigerAiSpawningCap {
	struct TArray<struct FTigerAiGroupCapSlot> CapSlots; // 0x290(0x10)

	bool TriggerNextCommandForSlot(struct ATigerNPC* NPC, int32_t CapSlotIndex); // Function Tiger.TigerAIGroupCAP.TriggerNextCommandForSlot // (Final|Native|Public|BlueprintCallable) // @ game+0x1228e50
	bool OnRequestNewCommands(struct ATigerNPC* NPC); // Function Tiger.TigerAIGroupCAP.OnRequestNewCommands // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	bool OnIsAvailableCheck(); // Function Tiger.TigerAIGroupCAP.OnIsAvailableCheck // (Native|Event|Public|BlueprintEvent) // @ game+0x1228a50
	bool IsSlotAvailable(int32_t Index); // Function Tiger.TigerAIGroupCAP.IsSlotAvailable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12289b0
	int32_t GetSlotAssignedToNPC(struct ATigerNPC* NPC); // Function Tiger.TigerAIGroupCAP.GetSlotAssignedToNPC // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12288c0
	struct UTigerAICommandBase* GetNextCommand(struct FTigerAiGroupCapSlot CapSlot, int32_t CapSlotIndex); // Function Tiger.TigerAIGroupCAP.GetNextCommand // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1228770
	void CapCommandStarted(int32_t CapSlotIndex, int32_t CommandIndex); // Function Tiger.TigerAIGroupCAP.CapCommandStarted // (Final|Native|Public|BlueprintCallable) // @ game+0x1228550
	bool AssignNpcToSlot(int32_t SlotIndex, struct ATigerNPC* NPC); // Function Tiger.TigerAIGroupCAP.AssignNpcToSlot // (Final|Native|Public|BlueprintCallable) // @ game+0x1228390
};

// Class Tiger.TigerAiHasCurrentSquadOrder
// Size: 0x70 (Inherited: 0x68)
struct UTigerAiHasCurrentSquadOrder : UBTDecorator {
	enum class ETigerNpcSquadOrder SquadOrderToCompare; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
};

// Class Tiger.TigerAiHasPlayerInSightDecorator
// Size: 0x68 (Inherited: 0x68)
struct UTigerAiHasPlayerInSightDecorator : UBTDecorator {
};

// Class Tiger.TigerAiIsHeightElevationBlockingVision
// Size: 0xc0 (Inherited: 0x68)
struct UTigerAiIsHeightElevationBlockingVision : UBTDecorator {
	struct FBlackboardKeySelector TargetLocationKey; // 0x68(0x28)
	struct FBlackboardKeySelector bCanSeeTargetKey; // 0x90(0x28)
	float MaxVerticalAngleToTarget; // 0xb8(0x04)
	float LargeEnoughHeightDifference; // 0xbc(0x04)
};

// Class Tiger.TigerAiIsInMovementRestrictionBoundsArea
// Size: 0x70 (Inherited: 0x68)
struct UTigerAiIsInMovementRestrictionBoundsArea : UBTDecorator {
	enum class ETigerNpcMovementRestrictionBoundsArea AreaToCompare; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
};

// Class Tiger.TigerAiIsMovingOutOfBounds
// Size: 0x98 (Inherited: 0x68)
struct UTigerAiIsMovingOutOfBounds : UBTDecorator {
	struct FBlackboardKeySelector TargetPositionKey; // 0x68(0x28)
	float OutOfBoundsDistance; // 0x90(0x04)
	char pad_94[0x4]; // 0x94(0x04)
};

// Class Tiger.TigerAIIsReactingDecorator
// Size: 0x68 (Inherited: 0x68)
struct UTigerAIIsReactingDecorator : UBTDecorator {
};

// Class Tiger.TigerAiIsSquadCaptain
// Size: 0x68 (Inherited: 0x68)
struct UTigerAiIsSquadCaptain : UBTDecorator {
};

// Class Tiger.TigerAiJudgeController
// Size: 0x3f0 (Inherited: 0x3b0)
struct ATigerAiJudgeController : ATigerAiBaseController {
	struct UTigerAiJudgeSmComponent* JudgeStateMachineComp; // 0x3b0(0x08)
	struct FTigerSightConfigProperties StandardSightProperties; // 0x3b8(0x1c)
	struct FTigerSightConfigProperties CombatSightProperties; // 0x3d4(0x1c)

	void PlayTimedAnimationTriggers(struct TArray<struct FTigerTimedAnimationTrigger> AnimationTriggers); // Function Tiger.TigerAiJudgeController.PlayTimedAnimationTriggers // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x122cf30
	struct ATigerJudge* GetJudgePawn(); // Function Tiger.TigerAiJudgeController.GetJudgePawn // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1228960
};

// Class Tiger.TigerAiJudgeSmComponent
// Size: 0x178 (Inherited: 0xb0)
struct UTigerAiJudgeSmComponent : UActorComponent {
	struct TArray<struct ATigerPlayer*> CurrentlyPerceivedPlayersBySight; // 0xb0(0x10)
	struct TArray<struct ATigerPlayer*> BloodhuntedPlayersWithinCombatRadius; // 0xc0(0x10)
	struct UTigerJudgeBaseState* StartingState; // 0xd0(0x08)
	struct UTigerJudgeBaseState* DownedState; // 0xd8(0x08)
	struct UTigerJudgeBaseState* FeedingState; // 0xe0(0x08)
	struct UTigerJudgeBaseState* ActiveState; // 0xe8(0x08)
	struct TMap<struct UTigerJudgeBaseState*, struct UTigerJudgeBaseState*> InstancedStates; // 0xf0(0x50)
	float CombatRadiusSq; // 0x140(0x04)
	bool bIsSeeingAnyBloodhuntedPlayer; // 0x144(0x01)
	char pad_145[0x33]; // 0x145(0x33)

	void SwitchToState(struct UTigerJudgeBaseState* NewStateType); // Function Tiger.TigerAiJudgeSmComponent.SwitchToState // (Native|Public|BlueprintCallable) // @ game+0x122cfe0
	void AddMasqueradePointsToSeenPlayers(float AdjustAmount, float TimeBetweenAddingPoints); // Function Tiger.TigerAiJudgeSmComponent.AddMasqueradePointsToSeenPlayers // (Final|Native|Public|BlueprintCallable) // @ game+0x122ca80
};

// Class Tiger.TigerAimingCameraBehavior
// Size: 0x168 (Inherited: 0x128)
struct UTigerAimingCameraBehavior : UTigerActiveCameraBehavior {
	char pad_128[0x18]; // 0x128(0x18)
	float MaxWorldDistanceForFindingTarget; // 0x140(0x04)
	float AimAssistStrengthMultiplier; // 0x144(0x04)
	float PassiveAimAssistStrength; // 0x148(0x04)
	float YawRotationMultiplier; // 0x14c(0x04)
	float PitchRotationMultiplier; // 0x150(0x04)
	float MaximumFollowDegrees; // 0x154(0x04)
	float AimAssistTargetLeadAmount; // 0x158(0x04)
	float AimAssistStrengthByVelocityMultiplier; // 0x15c(0x04)
	char pad_160[0x8]; // 0x160(0x08)
};

// Class Tiger.TigerAiMoveAsyncTask
// Size: 0xa0 (Inherited: 0x98)
struct UTigerAiMoveAsyncTask : UBTTask_BlackboardBase {
	float AcceptableRadiusSq; // 0x98(0x04)
	float ObservedBlackboardValueToleranceSq; // 0x9c(0x04)
};

// Class Tiger.TigerAiMoveToTask
// Size: 0xb8 (Inherited: 0xb0)
struct UTigerAiMoveToTask : UBTTask_MoveTo {
	bool bResetMoveTargetOnEnd; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
};

// Class Tiger.TigerAiPathToTargetService
// Size: 0x158 (Inherited: 0x70)
struct UTigerAiPathToTargetService : UBTService {
	struct FBlackboardKeySelector TargetLocationKey; // 0x70(0x28)
	struct FBlackboardKeySelector SuitableEdgeLocationKey; // 0x98(0x28)
	struct FBlackboardKeySelector IsTargetOutOfBoundsKey; // 0xc0(0x28)
	struct FBlackboardKeySelector HasPathToTargetKey; // 0xe8(0x28)
	struct FBlackboardKeySelector IsPathOutOfBoundsKey; // 0x110(0x28)
	float OutOfBoundsDistance; // 0x138(0x04)
	float HeightDifferenceOutOfBounds; // 0x13c(0x04)
	bool bDebugDraw; // 0x140(0x01)
	char pad_141[0x17]; // 0x141(0x17)
};

// Class Tiger.TigerAIPerceptionSystem
// Size: 0x130 (Inherited: 0x130)
struct UTigerAIPerceptionSystem : UAIPerceptionSystem {
};

// Class Tiger.TigerAiPerfBenchUseWeapon
// Size: 0x90 (Inherited: 0x70)
struct UTigerAiPerfBenchUseWeapon : UBTTaskNode {
	char pad_70[0x10]; // 0x70(0x10)
	struct ATigerLocalAIControllerBase* LocalAIController; // 0x80(0x08)
	struct ATigerPlayerController* PlayerController; // 0x88(0x08)
};

// Class Tiger.TigerAiPermanentCap
// Size: 0x2c8 (Inherited: 0x290)
struct ATigerAiPermanentCap : ATigerAiSpawningCap {
	struct TArray<struct UTigerAICommandBase*> Commands; // 0x290(0x10)
	enum class ETigerCivilianEmotionalState EmotionalState; // 0x2a0(0x01)
	char pad_2A1[0x3]; // 0x2a1(0x03)
	struct FName CapContextBase; // 0x2a4(0x08)
	int32_t CapContextStartingIndex; // 0x2ac(0x04)
	struct UTigerNPCAsset* NpcAssetToSpawn; // 0x2b0(0x08)
	int32_t LoopingStartIndex; // 0x2b8(0x04)
	struct TWeakObjectPtr<struct ATigerNPC> PermanentNpc; // 0x2bc(0x08)
	char pad_2C4[0x4]; // 0x2c4(0x04)
};

// Class Tiger.TigerAIPetClearPathToMaster
// Size: 0x70 (Inherited: 0x70)
struct UTigerAIPetClearPathToMaster : UBTTaskNode {
};

// Class Tiger.TigerAIPetComponent
// Size: 0xf0 (Inherited: 0xb0)
struct UTigerAIPetComponent : UActorComponent {
	char pad_B0[0x40]; // 0xb0(0x40)

	bool HasGotEndPoint(); // Function Tiger.TigerAIPetComponent.HasGotEndPoint // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x122cc10
	struct TArray<struct FVector> GetMasterPlayersStoredPath(); // Function Tiger.TigerAIPetComponent.GetMasterPlayersStoredPath // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x122cb80
	struct FVector GetEndPoint(); // Function Tiger.TigerAIPetComponent.GetEndPoint // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x122cb50
};

// Class Tiger.TigerAIPetFindEndOfMastersPath
// Size: 0x98 (Inherited: 0x70)
struct UTigerAIPetFindEndOfMastersPath : UBTTaskNode {
	struct FBlackboardKeySelector MasterPlayer; // 0x70(0x28)
};

// Class Tiger.TigerAIPetPreparePathContinuing
// Size: 0x98 (Inherited: 0x70)
struct UTigerAIPetPreparePathContinuing : UBTTaskNode {
	struct FBlackboardKeySelector MasterPlayer; // 0x70(0x28)
};

// Class Tiger.TigerAIPetStoreValidMasterPos
// Size: 0x98 (Inherited: 0x70)
struct UTigerAIPetStoreValidMasterPos : UBTTaskNode {
	struct FBlackboardKeySelector MasterPlayer; // 0x70(0x28)
};

// Class Tiger.TigerAIPlayAnimationTask
// Size: 0xc8 (Inherited: 0x70)
struct UTigerAIPlayAnimationTask : UBTTaskNode {
	struct UAnimMontage* AnimationToPlay; // 0x70(0x08)
	struct FBlackboardKeySelector ContextualActionPointKey; // 0x78(0x28)
	struct UBehaviorTreeComponent* MyOwnerComp; // 0xa0(0x08)
	char pad_A8[0x20]; // 0xa8(0x20)
};

// Class Tiger.TigerAiPlayerAtWpRangeDecorator
// Size: 0x70 (Inherited: 0x68)
struct UTigerAiPlayerAtWpRangeDecorator : UBTDecorator {
	bool bConditionInvertedOnTick; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
};

// Class Tiger.TigerAIPlayerClearPrioritiesTask
// Size: 0x98 (Inherited: 0x98)
struct UTigerAIPlayerClearPrioritiesTask : UBTTask_BlackboardBase {
};

// Class Tiger.TigerAIPlayerClimbIfPossibleTask
// Size: 0xd0 (Inherited: 0x70)
struct UTigerAIPlayerClimbIfPossibleTask : UBTTaskNode {
	struct ATigerLocalAIControllerBase* LocalAIController; // 0x70(0x08)
	struct ATigerPlayerController* PlayerController; // 0x78(0x08)
	struct ATigerPlayerCameraManager* PlayerCamera; // 0x80(0x08)
	struct ATigerPlayer* CurrentPawn; // 0x88(0x08)
	struct UTigerCharacterMovementComponent* PlayerMovementComponent; // 0x90(0x08)
	struct UTigerTraversalClimbState* ClimbState; // 0x98(0x08)
	struct UTigerTraversalStateClimbingConfig* ClimbConfig; // 0xa0(0x08)
	float AngleFromForward; // 0xa8(0x04)
	char pad_AC[0x24]; // 0xac(0x24)
};

// Class Tiger.TigerAiPlayerCombatService
// Size: 0xe0 (Inherited: 0x70)
struct UTigerAiPlayerCombatService : UBTService {
	struct TMap<enum class ETigerWeaponType, struct FWeaponDistanceDesc> WeaponRanges; // 0x70(0x50)
	struct ATigerLocalAIController* LocalAIController; // 0xc0(0x08)
	struct AActor* CurrentLureTarget; // 0xc8(0x08)
	char pad_D0[0x10]; // 0xd0(0x10)
};

// Class Tiger.TigerAiPlayerDiablerizeTask
// Size: 0xc0 (Inherited: 0x98)
struct UTigerAiPlayerDiablerizeTask : UBTTask_BlackboardBase {
	float MaximumDiablerizeDistance; // 0x98(0x04)
	char pad_9C[0x24]; // 0x9c(0x24)
};

// Class Tiger.TigerAIPlayerFeeding
// Size: 0xa0 (Inherited: 0x98)
struct UTigerAIPlayerFeeding : UBTTask_BlackboardBase {
	float MaximumFeedingDistance; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class Tiger.TigerAIPlayerFindBloodHuntedTask
// Size: 0x70 (Inherited: 0x70)
struct UTigerAIPlayerFindBloodHuntedTask : UBTTaskNode {
};

// Class Tiger.TigerAIPlayerFindCivilianTask
// Size: 0xb8 (Inherited: 0x98)
struct UTigerAIPlayerFindCivilianTask : UBTTask_BlackboardBase {
	bool bUseHeightenedSensesSearchRadius; // 0x98(0x01)
	char pad_99[0x3]; // 0x99(0x03)
	float CustomSearchSphereRadius; // 0x9c(0x04)
	bool bDrawSearchSphere; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	float MaxVerticalPositionOffset; // 0xa4(0x04)
	float RaycastDistance; // 0xa8(0x04)
	int32_t SearchLowResonanceThreshold; // 0xac(0x04)
	float SearchLowHealthPercentageThreshold; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
};

// Class Tiger.TigerAIPlayerFindClosestItemTask
// Size: 0xb8 (Inherited: 0x98)
struct UTigerAIPlayerFindClosestItemTask : UBTTask_BlackboardBase {
	float MaxVerticalPositionOffset; // 0x98(0x04)
	float RaycastDistance; // 0x9c(0x04)
	float SearchSphereRadius; // 0xa0(0x04)
	char pad_A4[0x14]; // 0xa4(0x14)
};

// Class Tiger.TigerAIPlayerFindNewPointTask
// Size: 0xb0 (Inherited: 0x98)
struct UTigerAIPlayerFindNewPointTask : UBTTask_BlackboardBase {
	float NavigablePointRadius; // 0x98(0x04)
	float MaxCenterDistance; // 0x9c(0x04)
	char pad_A0[0x10]; // 0xa0(0x10)
};

// Class Tiger.TigerAiPlayerMainStateService
// Size: 0xc8 (Inherited: 0x70)
struct UTigerAiPlayerMainStateService : UBTService {
	struct ATigerLocalAIController* LocalAIController; // 0x70(0x08)
	struct ATigerPlayer* AiPlayer; // 0x78(0x08)
	struct ATigerCharacter* TargetCharacter; // 0x80(0x08)
	struct UTigerInventoryComponent* LocalAiInventory; // 0x88(0x08)
	struct ATigerCharacter* CharacterFromWhichFleeing; // 0x90(0x08)
	char pad_98[0x18]; // 0x98(0x18)
	float FleeAttackDistance; // 0xb0(0x04)
	char pad_B4[0x14]; // 0xb4(0x14)

	void OnPerceptionUpdated(struct AActor* InActor, struct FAIStimulus InStimulus); // Function Tiger.TigerAiPlayerMainStateService.OnPerceptionUpdated // (Final|Native|Private) // @ game+0x122cd80
	void OnDiablerizeStateChanged(bool InIsDiablerizeActive, bool InIsTarget); // Function Tiger.TigerAiPlayerMainStateService.OnDiablerizeStateChanged // (Final|Native|Private) // @ game+0x122cc30
};

// Class Tiger.TigerAIPlayerMoveToTask
// Size: 0x150 (Inherited: 0xb0)
struct UTigerAIPlayerMoveToTask : UBTTask_MoveTo {
	char pad_B0[0x8]; // 0xb0(0x08)
	struct UTigerAIPlayerClimbIfPossibleTask* ClimbTask; // 0xb8(0x08)
	struct UTigerAIPlayerSlideIfPossibleTask* SlideTask; // 0xc0(0x08)
	struct UTigerAIPlayerWallGrindTask* WallGrindTask; // 0xc8(0x08)
	float CheckStuckDelay; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
	float CheckClimbTaskTransitionsDelay; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)
	float CheckSlideTaskTransitionsDelay; // 0xe0(0x04)
	char pad_E4[0x4]; // 0xe4(0x04)
	float JumpGapTransitionsDelay; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
	struct ATigerLocalAIControllerBase* LocalAIController; // 0xf0(0x08)
	struct ATigerPlayer* CurrentTigerPlayer; // 0xf8(0x08)
	char pad_100[0x50]; // 0x100(0x50)

	void OnLifeStatusChanged(enum class ETigerPlayerLifeStatus InNewLifeStatus); // Function Tiger.TigerAIPlayerMoveToTask.OnLifeStatusChanged // (Final|Native|Public) // @ game+0x122cd00
};

// Class Tiger.TigerAIPlayerPickPriorityTask
// Size: 0xa0 (Inherited: 0x98)
struct UTigerAIPlayerPickPriorityTask : UBTTask_BlackboardBase {
	float MaxVerticalPositionOffset; // 0x98(0x04)
	float RaycastDistance; // 0x9c(0x04)
};

// Class Tiger.TigerAIPlayerPickUpItemTask
// Size: 0xc0 (Inherited: 0x98)
struct UTigerAIPlayerPickUpItemTask : UBTTask_BlackboardBase {
	float MaximumLootingDistance; // 0x98(0x04)
	char pad_9C[0x24]; // 0x9c(0x24)
};

// Class Tiger.TigerAIPlayerSlideIfPossibleTask
// Size: 0xa0 (Inherited: 0x70)
struct UTigerAIPlayerSlideIfPossibleTask : UBTTaskNode {
	float MinimumSlideDistanceSqrd; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	struct ATigerLocalAIController* LocalAIController; // 0x78(0x08)
	struct ATigerPlayerController* PlayerController; // 0x80(0x08)
	struct ATigerPlayer* CurrentPawn; // 0x88(0x08)
	struct UTigerCharacterMovementComponent* PlayerMovementComponent; // 0x90(0x08)
	struct UTigerTraversalSlideState* SlideState; // 0x98(0x08)
};

// Class Tiger.TigerAIPlayerTravelBloodVeinTask
// Size: 0xd8 (Inherited: 0x98)
struct UTigerAIPlayerTravelBloodVeinTask : UBTTask_BlackboardBase {
	struct UCurveFloat* JumpProbabilityDistribution; // 0x98(0x08)
	char pad_A0[0x8]; // 0xa0(0x08)
	enum class ETigerJumpDistribution JumpDistributionType; // 0xa8(0x01)
	char pad_A9[0x2f]; // 0xa9(0x2f)
};

// Class Tiger.TigerAIPlayerUseHealingItem
// Size: 0x90 (Inherited: 0x70)
struct UTigerAIPlayerUseHealingItem : UBTTaskNode {
	char pad_70[0x10]; // 0x70(0x10)
	struct ATigerLocalAIControllerBase* LocalAIController; // 0x80(0x08)
	struct ATigerPlayerController* PlayerController; // 0x88(0x08)
};

// Class Tiger.TigerAiPlayerUseWeapon
// Size: 0x90 (Inherited: 0x70)
struct UTigerAiPlayerUseWeapon : UBTTaskNode {
	char pad_70[0x10]; // 0x70(0x10)
	struct ATigerLocalAIControllerBase* LocalAIController; // 0x80(0x08)
	struct ATigerPlayerController* PlayerController; // 0x88(0x08)
};

// Class Tiger.TigerAiPlayerUseWeaponPower
// Size: 0x98 (Inherited: 0x70)
struct UTigerAiPlayerUseWeaponPower : UBTTaskNode {
	char pad_70[0x10]; // 0x70(0x10)
	struct ATigerLocalAIControllerBase* LocalAIController; // 0x80(0x08)
	struct ATigerPlayerController* PlayerController; // 0x88(0x08)
	struct UTigerDisciplineBase* WeaponAbility; // 0x90(0x08)
};

// Class Tiger.TigerAIPlayerWallGrindTask
// Size: 0xa0 (Inherited: 0x70)
struct UTigerAIPlayerWallGrindTask : UBTTaskNode {
	char pad_70[0x8]; // 0x70(0x08)
	struct ATigerLocalAIController* LocalAIController; // 0x78(0x08)
	struct ATigerPlayerController* PlayerController; // 0x80(0x08)
	struct ATigerPlayer* CurrentPawn; // 0x88(0x08)
	struct UTigerCharacterMovementComponent* PlayerMovementComponent; // 0x90(0x08)
	struct UTigerTraversalWallGrindState* GrindState; // 0x98(0x08)
};

// Class Tiger.TigerAiReloadWeaponTask
// Size: 0x80 (Inherited: 0x70)
struct UTigerAiReloadWeaponTask : UBTTaskNode {
	char pad_70[0x10]; // 0x70(0x10)

	void OnReloadAborted(); // Function Tiger.TigerAiReloadWeaponTask.OnReloadAborted // (Final|Native|Private) // @ game+0x122cf10
};

// Class Tiger.TigerAiReportNewThreatTask
// Size: 0x98 (Inherited: 0x70)
struct UTigerAiReportNewThreatTask : UBTTaskNode {
	struct FBlackboardKeySelector PlayerToReportKey; // 0x70(0x28)
};

// Class Tiger.TigerAIReportSuspciousPlayer
// Size: 0xe8 (Inherited: 0x70)
struct UTigerAIReportSuspciousPlayer : UBTTaskNode {
	struct FBlackboardKeySelector PoliceTarget; // 0x70(0x28)
	struct FBlackboardKeySelector CurrentMasqueradeTarget; // 0x98(0x28)
	struct FBlackboardKeySelector PlayerNeedsToBeReported; // 0xc0(0x28)
};

// Class Tiger.TigerAiRequestOutOfBoundsPursuitSquad
// Size: 0xa0 (Inherited: 0x70)
struct UTigerAiRequestOutOfBoundsPursuitSquad : UBTTaskNode {
	struct FBlackboardKeySelector TargetPlayer; // 0x70(0x28)
	float NearbySquadDistance; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class Tiger.TigerAISense_Masquerade
// Size: 0x90 (Inherited: 0x80)
struct UTigerAISense_Masquerade : UAISense {
	struct TArray<struct FTigerAIMasqueradeEvent> MasqueradeEvents; // 0x80(0x10)

	void ReportPlayerAction(struct ATigerPlayer* Instigator, struct FTigerAIPlayerAction PlayerAction); // Function Tiger.TigerAISense_Masquerade.ReportPlayerAction // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1231af0
};

// Class Tiger.TigerAISenseConfig_Masquerade
// Size: 0x50 (Inherited: 0x48)
struct UTigerAISenseConfig_Masquerade : UAISenseConfig {
	struct UTigerAISense_Masquerade* Implementation; // 0x48(0x08)
};

// Class Tiger.TigerAISense_Sight
// Size: 0x170 (Inherited: 0x170)
struct UTigerAISense_Sight : UAISense_Sight {
};

// Class Tiger.TigerAISenseConfig_Sight
// Size: 0x78 (Inherited: 0x48)
struct UTigerAISenseConfig_Sight : UAISenseConfig {
	struct UTigerAISense_Sight* Implementation; // 0x48(0x08)
	float SightRadius; // 0x50(0x04)
	float LoseSightRadius; // 0x54(0x04)
	float PeripheralVisionAngleDegrees; // 0x58(0x04)
	float CloseSightRadius; // 0x5c(0x04)
	float CloseLoseSightRadius; // 0x60(0x04)
	float ClosePeripheralVisionAngleDegrees; // 0x64(0x04)
	float HeightDifference; // 0x68(0x04)
	struct FAISenseAffiliationFilter DetectionByAffiliation; // 0x6c(0x04)
	float AutoSuccessRangeFromLastSeenLocation; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// Class Tiger.TigerSightConfigAsset
// Size: 0x80 (Inherited: 0x30)
struct UTigerSightConfigAsset : UDataAsset {
	struct TMap<enum class ETigerNPCType, struct FTigerSightConfigData> SightData; // 0x30(0x50)
};

// Class Tiger.TigerAiSetCrouchedTask
// Size: 0x78 (Inherited: 0x70)
struct UTigerAiSetCrouchedTask : UBTTaskNode {
	bool bShouldCrouch; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Tiger.TigerAiSetMovementMode
// Size: 0x78 (Inherited: 0x70)
struct UTigerAiSetMovementMode : UBTTaskNode {
	enum class ETigerAIAnimationMode MovementMode; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Tiger.TigerAiShouldFireFleeDecorator
// Size: 0x98 (Inherited: 0x90)
struct UTigerAiShouldFireFleeDecorator : UBTDecorator_BlackboardBase {
	char pad_90[0x8]; // 0x90(0x08)
};

// Class Tiger.TigerAiShouldReloadDecorator
// Size: 0x70 (Inherited: 0x68)
struct UTigerAiShouldReloadDecorator : UBTDecorator {
	bool bBaseUponFullAmmoPercentage; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	float ReloadAmmoPercentage; // 0x6c(0x04)
};

// Class Tiger.TigerAiShouldReportNewThreatDecorator
// Size: 0x90 (Inherited: 0x68)
struct UTigerAiShouldReportNewThreatDecorator : UBTDecorator {
	struct FBlackboardKeySelector PlayerToReportKey; // 0x68(0x28)
};

// Class Tiger.TigerAiShouldRequestOutOfBoundsPursuitSquad
// Size: 0x98 (Inherited: 0x68)
struct UTigerAiShouldRequestOutOfBoundsPursuitSquad : UBTDecorator {
	struct FBlackboardKeySelector CurrentTargetKey; // 0x68(0x28)
	float MaxDistanceFromCurrentSquad; // 0x90(0x04)
	char pad_94[0x4]; // 0x94(0x04)
};

// Class Tiger.TigerAiShouldUseDisciplineBase
// Size: 0x98 (Inherited: 0x68)
struct UTigerAiShouldUseDisciplineBase : UBTDecorator {
	float LowHealthPercentage; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
	struct ATigerLocalAIController* LocalAIController; // 0x70(0x08)
	struct ATigerPlayerController* LocalAiPlayerController; // 0x78(0x08)
	struct ATigerPlayer* AiTigerPlayer; // 0x80(0x08)
	struct UTigerDisciplineComponent* DisciplineComponent; // 0x88(0x08)
	struct ATigerCharacter* AiTigerCharacter; // 0x90(0x08)
};

// Class Tiger.TigerAiShouldUseArchDiscipline
// Size: 0xb0 (Inherited: 0x98)
struct UTigerAiShouldUseArchDiscipline : UTigerAiShouldUseDisciplineBase {
	float ShockwavePunchMinimumTargetDistance; // 0x98(0x04)
	float EarthshockUseWithoutJumpChance; // 0x9c(0x04)
	float TrapsAndScoutsUseNearLootDistance; // 0xa0(0x04)
	float ScoutsRedeployChance; // 0xa4(0x04)
	float RejuvenatingVoiceLowHealthPercentage; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class Tiger.TigerAiShouldUseClanDiscipline
// Size: 0xa8 (Inherited: 0x98)
struct UTigerAiShouldUseClanDiscipline : UTigerAiShouldUseDisciplineBase {
	float SoaringLeapRayClearance; // 0x98(0x04)
	float VanishCombatUseChance; // 0x9c(0x04)
	float ProjectionDashUseDistance; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// Class Tiger.TigerNPCSpawningBase
// Size: 0x260 (Inherited: 0x228)
struct ATigerNPCSpawningBase : AActor {
	struct ATigerAISplinePath* AISplinePath; // 0x228(0x08)
	struct FName SpawningGroup; // 0x230(0x08)
	int32_t SpawnAmount; // 0x238(0x04)
	struct FGuid SpawningSubGroupId; // 0x23c(0x10)
	float Prio; // 0x24c(0x04)
	bool bShouldBeManuallyActivated; // 0x250(0x01)
	char pad_251[0x3]; // 0x251(0x03)
	struct FName MovementGroup; // 0x254(0x08)
	char pad_25C[0x4]; // 0x25c(0x04)

	struct TArray<struct ATigerBaseNPC*> ManuallySpawnNPCs(int32_t Budget, int32_t OverrideSpawnAmount); // Function Tiger.TigerNPCSpawningBase.ManuallySpawnNPCs // (Final|Native|Public|BlueprintCallable) // @ game+0x12e0c60
};

// Class Tiger.TigerAISpawner
// Size: 0x268 (Inherited: 0x260)
struct ATigerAISpawner : ATigerNPCSpawningBase {
	struct UTigerNPCAsset* NPCAsset; // 0x260(0x08)
};

// Class Tiger.TigerAISplinePath
// Size: 0x2d0 (Inherited: 0x228)
struct ATigerAISplinePath : AActor {
	struct FTigerAISplinePathData PathData; // 0x228(0xa0)
	char pad_2C8[0x8]; // 0x2c8(0x08)
};

// Class Tiger.TigerAiSplinePathHub
// Size: 0x240 (Inherited: 0x228)
struct ATigerAiSplinePathHub : AActor {
	struct TArray<struct FTigerAISplinePathConnection> SplineConnections; // 0x228(0x10)
	float ConnectionRadius; // 0x238(0x04)
	char pad_23C[0x4]; // 0x23c(0x04)
};

// Class Tiger.TigerAiSquad
// Size: 0x68 (Inherited: 0x28)
struct UTigerAiSquad : UObject {
	char pad_28[0x40]; // 0x28(0x40)
};

// Class Tiger.TigerAiSquadFormationService
// Size: 0xb0 (Inherited: 0x70)
struct UTigerAiSquadFormationService : UBTService {
	struct FBlackboardKeySelector FormationLocationKey; // 0x70(0x28)
	bool bDebugDraw; // 0x98(0x01)
	char pad_99[0x17]; // 0x99(0x17)
};

// Class Tiger.TigerAIsRespondingToRoar
// Size: 0x68 (Inherited: 0x68)
struct UTigerAIsRespondingToRoar : UBTDecorator {
};

// Class Tiger.TigerAiStopActiveCapTask
// Size: 0x70 (Inherited: 0x70)
struct UTigerAiStopActiveCapTask : UBTTaskNode {
};

// Class Tiger.TigerAiTargetOutOfBounds
// Size: 0xe0 (Inherited: 0x68)
struct UTigerAiTargetOutOfBounds : UBTDecorator {
	struct FBlackboardKeySelector IsTargetOutOfBoundsKey; // 0x68(0x28)
	struct FBlackboardKeySelector HasPathToTargetKey; // 0x90(0x28)
	struct FBlackboardKeySelector IsPathOutOfBoundsKey; // 0xb8(0x28)
};

// Class Tiger.TigerAIThreateningTargetService
// Size: 0x148 (Inherited: 0x70)
struct UTigerAIThreateningTargetService : UBTService {
	struct FBlackboardKeySelector ThreatPosition; // 0x70(0x28)
	struct FBlackboardKeySelector CurrentThreatTarget; // 0x98(0x28)
	struct FBlackboardKeySelector SuggestedNonObstructedPosition; // 0xc0(0x28)
	struct FBlackboardKeySelector bIsAllowedToChaseKey; // 0xe8(0x28)
	struct FBlackboardKeySelector bCanShoot; // 0x110(0x28)
	bool bUseAttackPermissions; // 0x138(0x01)
	bool bShowDebugFeatures; // 0x139(0x01)
	char pad_13A[0xe]; // 0x13a(0x0e)
};

// Class Tiger.TigerAIThreateningTargetEntityService
// Size: 0x170 (Inherited: 0x148)
struct UTigerAIThreateningTargetEntityService : UTigerAIThreateningTargetService {
	struct FBlackboardKeySelector MasqueradeBreachTargetKey; // 0x148(0x28)
};

// Class Tiger.TigerAiTryFindLocationAgainstElevatedTarget
// Size: 0xd0 (Inherited: 0x70)
struct UTigerAiTryFindLocationAgainstElevatedTarget : UBTTaskNode {
	struct FBlackboardKeySelector TargetLocationKey; // 0x70(0x28)
	struct FBlackboardKeySelector SuggestedLocationKey; // 0x98(0x28)
	float MaxStepbackDistance; // 0xc0(0x04)
	float MinStepbackDistance; // 0xc4(0x04)
	float DesiredMaxVerticalAngle; // 0xc8(0x04)
	char pad_CC[0x4]; // 0xcc(0x04)
};

// Class Tiger.TigerAIUpdateBloodDrainedService
// Size: 0x78 (Inherited: 0x70)
struct UTigerAIUpdateBloodDrainedService : UBTService {
	float MaxTimeInBloodDrainedState; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// Class Tiger.TigerAIUpdateWaypoint
// Size: 0xf0 (Inherited: 0x70)
struct UTigerAIUpdateWaypoint : UBTService {
	struct FBlackboardKeySelector Index; // 0x70(0x28)
	struct FBlackboardKeySelector Waypoint; // 0x98(0x28)
	struct FBlackboardKeySelector bWaypointDirectionIsForward; // 0xc0(0x28)
	float Distance; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
};

// Class Tiger.TigerAiUseArchetypeDisciplineTask
// Size: 0xc8 (Inherited: 0xc8)
struct UTigerAiUseArchetypeDisciplineTask : UTigerAiDisciplineTaskBase {
};

// Class Tiger.TigerAiUseClanDisciplineTask
// Size: 0xc8 (Inherited: 0xc8)
struct UTigerAiUseClanDisciplineTask : UTigerAiDisciplineTaskBase {
};

// Class Tiger.TigerFearValueAsset
// Size: 0x80 (Inherited: 0x30)
struct UTigerFearValueAsset : UDataAsset {
	struct TMap<enum class ETigerAIMasqueradeState, float> FearValueThresholds; // 0x30(0x50)
};

// Class Tiger.TigerNpcPropAsset
// Size: 0x58 (Inherited: 0x30)
struct UTigerNpcPropAsset : UDataAsset {
	struct TArray<struct FName> TagsToAddToNpc; // 0x30(0x10)
	struct UTigerAnimationSetAsset* PropAnimationSet; // 0x40(0x08)
	struct TArray<struct FName> HeldPropAttachments; // 0x48(0x10)
};

// Class Tiger.TigerNPCVisualAsset
// Size: 0x150 (Inherited: 0x30)
struct UTigerNPCVisualAsset : UDataAsset {
	struct FName MainTag; // 0x30(0x08)
	struct TArray<struct FName> AdditionalTags; // 0x38(0x10)
	struct USkeletalMesh* SkeletalMesh; // 0x48(0x08)
	struct TArray<struct USkeletalMesh*> HeadSkeletalMeshes; // 0x50(0x10)
	struct TArray<struct USkeletalMesh*> HairSkeletalMeshes; // 0x60(0x10)
	struct TArray<struct UTigerColorSetAsset*> ColorSetAssets; // 0x70(0x10)
	struct TArray<struct UTigerLinearColorSetAsset*> HairColorSetAssets; // 0x80(0x10)
	struct UMaterialInstance* DefaultMaterial; // 0x90(0x08)
	bool bShowHeart; // 0x98(0x01)
	enum class ETigerGender Gender; // 0x99(0x01)
	char pad_9A[0x6]; // 0x9a(0x06)
	struct UAnimInstance* HairAnimationBlueprint; // 0xa0(0x08)
	bool bUseCharacterPreset; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)
	struct TSoftObjectPtr<struct UTigerCharacterPreset> CharacterPreset; // 0xb0(0x28)
	struct UAnimInstance* AnimationInstanceClass; // 0xd8(0x08)
	enum class ETigerCivilianEmotionalState EmotionalState; // 0xe0(0x01)
	char pad_E1[0x3]; // 0xe1(0x03)
	float ChanceForProp; // 0xe4(0x04)
	struct TMap<struct UTigerNpcPropAsset*, float> PossibleNpcProps; // 0xe8(0x50)
	float WalkSpeed; // 0x138(0x04)
	float WalkTurnSpeed; // 0x13c(0x04)
	float SprintSpeed; // 0x140(0x04)
	float SprintTurnSpeed; // 0x144(0x04)
	float StrafeSpeed; // 0x148(0x04)
	float StrafeTurnSpeed; // 0x14c(0x04)
};

// Class Tiger.TigerNPCBehaviorAsset
// Size: 0x228 (Inherited: 0x30)
struct UTigerNPCBehaviorAsset : UDataAsset {
	struct ATigerBaseNPC* NPCBlueprint; // 0x30(0x08)
	struct UTigerMasqueradeActionResponse* MasqueradeActionResponseClass; // 0x38(0x08)
	struct UBehaviorTree* DefaultBehaviorTree; // 0x40(0x08)
	struct TMap<enum class ETigerAIMasqueradeState, struct UBehaviorTree*> BehaviorTrees; // 0x48(0x50)
	struct TArray<struct UActorComponent*> AdditionalComponentClasses; // 0x98(0x10)
	struct UTigerWeapon* WeaponClass; // 0xa8(0x08)
	enum class ETigerNPCType NPCType; // 0xb0(0x01)
	enum class ETigerAIAnimationMode AnimationMode; // 0xb1(0x01)
	char pad_B2[0x2]; // 0xb2(0x02)
	struct FTigerCharacterStatModification BaseStatModifications; // 0xb4(0xb4)
	struct FTigerCharacterStatModification BaseGroupStatModifications; // 0x168(0xb4)
	bool bUseGroupStats; // 0x21c(0x01)
	char pad_21D[0x3]; // 0x21d(0x03)
	float OverrideBaseMaxHealth; // 0x220(0x04)
	char pad_224[0x4]; // 0x224(0x04)
};

// Class Tiger.TigerNPCAsset
// Size: 0x50 (Inherited: 0x30)
struct UTigerNPCAsset : UDataAsset {
	struct TArray<struct FTigerRandomVisualAsset> NormalizedVisualAssets; // 0x30(0x10)
	struct UTigerNPCBehaviorAsset* BehaviorAsset; // 0x40(0x08)
	struct UTigerGrimoireEntry* GrimoireEntry; // 0x48(0x08)
};

// Class Tiger.TigerColorSetAsset
// Size: 0xd0 (Inherited: 0x30)
struct UTigerColorSetAsset : UDataAsset {
	struct TMap<struct FName, struct FColor> ColorSets; // 0x30(0x50)
	struct TMap<struct FName, float> ScalarParameters; // 0x80(0x50)
};

// Class Tiger.TigerNPCCheatCommandsAsset
// Size: 0x80 (Inherited: 0x30)
struct UTigerNPCCheatCommandsAsset : UDataAsset {
	struct TMap<struct FName, struct UTigerNPCAsset*> Commands; // 0x30(0x50)
};

// Class Tiger.TigerLinearColorSetAsset
// Size: 0xd0 (Inherited: 0x30)
struct UTigerLinearColorSetAsset : UDataAsset {
	struct TMap<struct FName, struct FLinearColor> ColorSets; // 0x30(0x50)
	struct TMap<struct FName, float> ScalarParameters; // 0x80(0x50)
};

// Class Tiger.TigerAIWithinMovementBoundsServices
// Size: 0x98 (Inherited: 0x70)
struct UTigerAIWithinMovementBoundsServices : UBTService {
	struct FBlackboardKeySelector TargetLocationKey; // 0x70(0x28)
};

// Class Tiger.TigerDisciplineMetaData
// Size: 0x30 (Inherited: 0x28)
struct UTigerDisciplineMetaData : UAnimMetaData {
	enum class ETigerDisciplinesEnum DisicplineType; // 0x28(0x01)
	bool bAllowRotationLerp; // 0x29(0x01)
	char pad_2A[0x6]; // 0x2a(0x06)
};

// Class Tiger.TigerAnimationSet
// Size: 0x360 (Inherited: 0x28)
struct UTigerAnimationSet : UObject {
	struct TArray<struct UTigerAnimationSetAsset*> ParentSets; // 0x28(0x10)
	struct TMap<struct FName, struct UAnimSequence*> Sequences; // 0x38(0x50)
	struct TMap<struct FName, struct UAnimMontage*> Montages; // 0x88(0x50)
	struct TMap<struct FName, struct UTigerMontageList*> MontageLists; // 0xd8(0x50)
	struct TMap<struct FName, struct UBlendSpace*> BlendSpaces; // 0x128(0x50)
	struct TMap<struct FName, struct UBlendSpace1D*> BlendSpaces1D; // 0x178(0x50)
	struct TMap<struct FName, struct UTigerRandomSequenceList*> RandomSequenceLists; // 0x1c8(0x50)
	struct TMap<struct FName, struct UTigerCustomSequenceList*> CustomSequences; // 0x218(0x50)
	struct TMap<struct FName, struct UTigerCustomMontageList*> CustomMontages; // 0x268(0x50)
	struct TMap<struct FName, struct UTigerCustomBlendSpaceList*> CustomBlendSpaces; // 0x2b8(0x50)
	struct TMap<struct FName, struct UTigerCustomBlendSpace1DList*> CustomBlendSpaces1D; // 0x308(0x50)
	int32_t Priority; // 0x358(0x04)
	char pad_35C[0x4]; // 0x35c(0x04)
};

// Class Tiger.TigerAnimationSetAsset
// Size: 0x38 (Inherited: 0x30)
struct UTigerAnimationSetAsset : UDataAsset {
	struct UTigerAnimationSet* Set; // 0x30(0x08)
};

// Class Tiger.TigerAnimationSetCollection
// Size: 0x40 (Inherited: 0x28)
struct UTigerAnimationSetCollection : UObject {
	struct UTigerAnimationSet* ResultSet; // 0x28(0x08)
	struct TArray<struct UTigerAnimationSet*> AnimationSets; // 0x30(0x10)

	void AddSet(struct UTigerAnimationSetAsset* Asset); // Function Tiger.TigerAnimationSetCollection.AddSet // (Final|Native|Public|BlueprintCallable) // @ game+0x12355a0
};

// Class Tiger.TigerMontageList
// Size: 0x38 (Inherited: 0x28)
struct UTigerMontageList : UObject {
	struct TArray<struct UAnimMontage*> MontageList; // 0x28(0x10)

	struct UAnimMontage* GetRandomMontage(); // Function Tiger.TigerMontageList.GetRandomMontage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1235e00
};

// Class Tiger.TigerCustomSequenceList
// Size: 0x28 (Inherited: 0x28)
struct UTigerCustomSequenceList : UObject {
};

// Class Tiger.TigerCustomSequenceListClan
// Size: 0x40 (Inherited: 0x28)
struct UTigerCustomSequenceListClan : UTigerCustomSequenceList {
	struct UAnimSequence* Sequences[0x3]; // 0x28(0x18)
};

// Class Tiger.TigerCustomSequenceListGender
// Size: 0x38 (Inherited: 0x28)
struct UTigerCustomSequenceListGender : UTigerCustomSequenceList {
	struct UAnimSequence* Sequences[0x2]; // 0x28(0x10)
};

// Class Tiger.TigerCustomSequenceListClanAndGender
// Size: 0x58 (Inherited: 0x28)
struct UTigerCustomSequenceListClanAndGender : UTigerCustomSequenceList {
	struct FTigerPlayerSequenceByClan SequencesByClan[0x2]; // 0x28(0x30)
};

// Class Tiger.TigerCustomMontageList
// Size: 0x28 (Inherited: 0x28)
struct UTigerCustomMontageList : UObject {
};

// Class Tiger.TigerCustomMontageListClan
// Size: 0x40 (Inherited: 0x28)
struct UTigerCustomMontageListClan : UTigerCustomMontageList {
	struct UAnimMontage* Montages[0x3]; // 0x28(0x18)
};

// Class Tiger.TigerCustomMontageListGender
// Size: 0x38 (Inherited: 0x28)
struct UTigerCustomMontageListGender : UTigerCustomMontageList {
	struct UAnimMontage* Montages[0x2]; // 0x28(0x10)
};

// Class Tiger.TigerCustomMontageListClanAndGender
// Size: 0x58 (Inherited: 0x28)
struct UTigerCustomMontageListClanAndGender : UTigerCustomMontageList {
	struct FTigerPlayerMontageByClan MontagesByClan[0x2]; // 0x28(0x30)
};

// Class Tiger.TigerCustomMontageListMeleeWeapon
// Size: 0x78 (Inherited: 0x28)
struct UTigerCustomMontageListMeleeWeapon : UTigerCustomMontageList {
	struct TMap<struct UTigerMeleeWeapon*, struct UAnimMontage*> Montages; // 0x28(0x50)
};

// Class Tiger.TigerCustomBlendSpaceList
// Size: 0x28 (Inherited: 0x28)
struct UTigerCustomBlendSpaceList : UObject {
};

// Class Tiger.TigerCustomBlendSpaceListClan
// Size: 0x40 (Inherited: 0x28)
struct UTigerCustomBlendSpaceListClan : UTigerCustomBlendSpaceList {
	struct UBlendSpace* BlendSpaces[0x3]; // 0x28(0x18)
};

// Class Tiger.TigerCustomBlendSpaceListGender
// Size: 0x38 (Inherited: 0x28)
struct UTigerCustomBlendSpaceListGender : UTigerCustomBlendSpaceList {
	struct UBlendSpace* BlendSpaces[0x2]; // 0x28(0x10)
};

// Class Tiger.TigerCustomBlendSpaceListClanAndGender
// Size: 0x58 (Inherited: 0x28)
struct UTigerCustomBlendSpaceListClanAndGender : UTigerCustomBlendSpaceList {
	struct FTigerPlayerBlendSpaceByClan BlendSpacesByClan[0x2]; // 0x28(0x30)
};

// Class Tiger.TigerCustomBlendSpace1DList
// Size: 0x28 (Inherited: 0x28)
struct UTigerCustomBlendSpace1DList : UObject {
};

// Class Tiger.TigerCustomBlendSpace1DListClan
// Size: 0x40 (Inherited: 0x28)
struct UTigerCustomBlendSpace1DListClan : UTigerCustomBlendSpace1DList {
	struct UBlendSpace1D* BlendSpaces[0x3]; // 0x28(0x18)
};

// Class Tiger.TigerCustomBlendSpace1DListGender
// Size: 0x38 (Inherited: 0x28)
struct UTigerCustomBlendSpace1DListGender : UTigerCustomBlendSpace1DList {
	struct UBlendSpace1D* BlendSpaces[0x2]; // 0x28(0x10)
};

// Class Tiger.TigerCustomBlendSpace1DListClanAndGender
// Size: 0x58 (Inherited: 0x28)
struct UTigerCustomBlendSpace1DListClanAndGender : UTigerCustomBlendSpace1DList {
	struct FTigerPlayerBlendSpace1DByClan BlendSpacesByClan[0x2]; // 0x28(0x30)
};

// Class Tiger.TigerAnimIKWindow
// Size: 0x78 (Inherited: 0x30)
struct UTigerAnimIKWindow : UAnimNotifyState {
	struct FName SocketName; // 0x30(0x08)
	struct FName SocketToLineTraceFrom; // 0x38(0x08)
	enum class ETigerIKDirection IKSearchDirection; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	struct FName TargetJoint; // 0x44(0x08)
	float TargetJointVerticalOffsetAmount; // 0x4c(0x04)
	float TargetJointHorizontalOffsetAmount; // 0x50(0x04)
	float TargetJointDepthOffsetAmount; // 0x54(0x04)
	float IKResultVerticalAdjustment; // 0x58(0x04)
	float IKResultHorizontalAdjustment; // 0x5c(0x04)
	float IKResultDepthAdjustment; // 0x60(0x04)
	float IKResultAlpha; // 0x64(0x04)
	bool bIKShouldRemainActiveWhenAnimationLoops; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	float InOutBlendSpeed; // 0x6c(0x04)
	bool bShouldBlendInAndOut; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Tiger.TigerFaceCurvesAnimationMap
// Size: 0xc8 (Inherited: 0x28)
struct UTigerFaceCurvesAnimationMap : UObject {
	struct TMap<struct FName, struct UAnimSequence*> CurveAnimations; // 0x28(0x50)
	struct TMap<struct FName, struct UAnimMontage*> FaceMontages; // 0x78(0x50)
};

// Class Tiger.TigerAnimInstance
// Size: 0x3c0 (Inherited: 0x2c0)
struct UTigerAnimInstance : UAnimInstance {
	enum class ETigerEquippedWeaponType EquippedWeaponType; // 0x2b8(0x01)
	bool bOwnerIsLocked; // 0x2b9(0x01)
	struct UPoseAsset* FacePoseAsset; // 0x2c0(0x08)
	struct UAnimSequence* FacePoseAnimation; // 0x2c8(0x08)
	struct UBlendSpace* BlockStanceBlendSpace; // 0x2d0(0x08)
	char pad_2DA[0x4e]; // 0x2da(0x4e)
	struct UTigerAnimationSetAsset* DefaultAnimationSet; // 0x328(0x08)
	struct UTigerFaceCurvesAnimationMap* FaceCurvesAnimationMap; // 0x330(0x08)
	struct TArray<struct FName> AvailableFaceCurves; // 0x338(0x10)
	struct UTigerAnimationFilter* FacialAnimationFilter; // 0x348(0x08)
	struct UTigerAnimationSetCollection* AnimationSetCollection; // 0x350(0x08)
	struct UTigerAnimationSetCollection* PreviousAnimationSetCollection; // 0x358(0x08)
	struct UAnimMontage* LatestFacialAnim; // 0x360(0x08)
	struct FVector Velocity; // 0x368(0x0c)
	struct FVector PreviousVelocity; // 0x374(0x0c)
	float Speed; // 0x380(0x04)
	float Direction; // 0x384(0x04)
	float AimAnglePitch; // 0x388(0x04)
	float AimAngleYaw; // 0x38c(0x04)
	char pad_390[0x4]; // 0x390(0x04)
	bool bIsDead; // 0x394(0x01)
	bool bShooting; // 0x395(0x01)
	bool bIsBlocking; // 0x396(0x01)
	bool bIsMontagePlaying; // 0x397(0x01)
	char pad_398[0x4]; // 0x398(0x04)
	float MaxRootYawOffset; // 0x39c(0x04)
	float MaxAimingRootYawOffset; // 0x3a0(0x04)
	float RootYawOffset; // 0x3a4(0x04)
	float SmoothCharacterYaw; // 0x3a8(0x04)
	float CharacterYawLastTick; // 0x3ac(0x04)
	float CharacterYawChangeOverFrame; // 0x3b0(0x04)
	float CharacterDeltaYawSmooth; // 0x3b4(0x04)
	char pad_3B8[0x8]; // 0x3b8(0x08)

	void WeaponTypeBranch(enum class ETigerEquippedWeaponType WeaponType); // Function Tiger.TigerAnimInstance.WeaponTypeBranch // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x1236150
	void UpdateAnimNotifyIKAlphaBlendOnBones(float DeltaTime); // Function Tiger.TigerAnimInstance.UpdateAnimNotifyIKAlphaBlendOnBones // (Final|Native|Public|BlueprintCallable) // @ game+0x12360d0
	void TurnInPlace(bool bInIsStandingOnGround); // Function Tiger.TigerAnimInstance.TurnInPlace // (Final|Native|Public|BlueprintCallable) // @ game+0x1236040
	void OnSuccessfulMeleeHit(); // Function Tiger.TigerAnimInstance.OnSuccessfulMeleeHit // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void OnSettle(struct FTigerSettleEvent SettleEvent); // Function Tiger.TigerAnimInstance.OnSettle // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x16c0340
	void OnMeleeAttack(int32_t InAttackIndex); // Function Tiger.TigerAnimInstance.OnMeleeAttack // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void OnInitiateAnimationBlueprint(); // Function Tiger.TigerAnimInstance.OnInitiateAnimationBlueprint // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void OnFootstep(bool bIsLeftFoot, float FootstepDuration); // Function Tiger.TigerAnimInstance.OnFootstep // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void OnFiredWeapon(bool bInSecondaryWeaponFired); // Function Tiger.TigerAnimInstance.OnFiredWeapon // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void OnChangeAnimationSet(); // Function Tiger.TigerAnimInstance.OnChangeAnimationSet // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	bool IsActiveMontageRootMotion(); // Function Tiger.TigerAnimInstance.IsActiveMontageRootMotion // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1235f40
	struct UAnimSequence* GetSequence(struct FName SequenceName); // Function Tiger.TigerAnimInstance.GetSequence // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1235ea0
	struct UAnimMontage* GetRandomMontage(struct FName MontageListName); // Function Tiger.TigerAnimInstance.GetRandomMontage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1235d60
	struct UTigerRandomSequenceList* GetRandomAnimationSequenceList(struct FName SequenceListName); // Function Tiger.TigerAnimInstance.GetRandomAnimationSequenceList // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1235cc0
	struct UTigerRandomSequenceList* GetPreviousRandomAnimationSequenceList(struct FName SequenceListName); // Function Tiger.TigerAnimInstance.GetPreviousRandomAnimationSequenceList // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1235c20
	struct UBlendSpace* GetPreviousBlendSpace(struct FName BlendSpaceName); // Function Tiger.TigerAnimInstance.GetPreviousBlendSpace // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1235b80
	struct UAnimMontage* GetMontage(struct FName InMontageName); // Function Tiger.TigerAnimInstance.GetMontage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1235ae0
	void GetFaceAnimSlotsWithActiveCurves(struct FName OutSlot0, struct FName OutSlot1, struct FName OutSlot2, struct FName OutSlot3); // Function Tiger.TigerAnimInstance.GetFaceAnimSlotsWithActiveCurves // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x12358a0
	struct UAnimSequence* GetFaceAnimationForCurve(struct FName CurveName); // Function Tiger.TigerAnimInstance.GetFaceAnimationForCurve // (Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1235a40
	struct UBlendSpace1D* GetBlendSpace1D(struct FName BlendSpace1DName); // Function Tiger.TigerAnimInstance.GetBlendSpace1D // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1235760
	struct UBlendSpace* GetBlendSpace(struct FName BlendSpaceName); // Function Tiger.TigerAnimInstance.GetBlendSpace // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1235800
	struct UTigerAnimationSetAsset* GetAnimSetAssetFromWeaponClass(struct UTigerWeapon* InWeaponClass); // Function Tiger.TigerAnimInstance.GetAnimSetAssetFromWeaponClass // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	bool GetAnimNotifyIKDataForBone(struct FName BoneName, struct FTigerAnimNotifyIKData IKData); // Function Tiger.TigerAnimInstance.GetAnimNotifyIKDataForBone // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1235630
	void AddSets(struct UTigerAnimationSetCollection* SetCollection); // Function Tiger.TigerAnimInstance.AddSets // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void AbortFacialAnimCallback(); // Function Tiger.TigerAnimInstance.AbortFacialAnimCallback // (Final|Native|Public) // @ game+0x1235580
};

// Class Tiger.TigerAnimNotiftyStateFlying
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnimNotiftyStateFlying : UAnimNotifyState {
};

// Class Tiger.TigerAnimNotify_AddProps
// Size: 0x50 (Inherited: 0x38)
struct UTigerAnimNotify_AddProps : UAnimNotify {
	struct ATigerPropDummy* PropDummyClass; // 0x38(0x08)
	struct TArray<struct FName> PropsToSpawn; // 0x40(0x10)
};

// Class Tiger.TigerAnimNotify_CameraAnimation
// Size: 0x48 (Inherited: 0x38)
struct UTigerAnimNotify_CameraAnimation : UAnimNotify {
	struct UCameraAnim* CameraAnimation; // 0x38(0x08)
	float AnimationRate; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Tiger.TigerAnimNotify_CameraShake
// Size: 0x48 (Inherited: 0x38)
struct UTigerAnimNotify_CameraShake : UAnimNotify {
	struct UMatineeCameraShake* ShakeType; // 0x38(0x08)
	float ShakeScale; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Tiger.TigerAnimNotify_Discipline
// Size: 0x40 (Inherited: 0x38)
struct UTigerAnimNotify_Discipline : UAnimNotify {
	enum class ETigerDisciplinesEnum Discipline; // 0x38(0x01)
	enum class ETigerDisciplineEvent DisciplineEvent; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
};

// Class Tiger.TigerAnimNotify_DropProps
// Size: 0x38 (Inherited: 0x38)
struct UTigerAnimNotify_DropProps : UAnimNotify {
};

// Class Tiger.TigerAnimNotify_Footstep
// Size: 0x40 (Inherited: 0x38)
struct UTigerAnimNotify_Footstep : UAnimNotify {
	bool bIsLeftFoot; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float FootstepDuration; // 0x3c(0x04)

	void SetData(bool bIsLeftFootIn, float FootstepDurationIn); // Function Tiger.TigerAnimNotify_Footstep.SetData // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x1235f70
};

// Class Tiger.TigerAnimNotify_Melee
// Size: 0x40 (Inherited: 0x38)
struct UTigerAnimNotify_Melee : UAnimNotify {
	struct FName EventName; // 0x38(0x08)
};

// Class Tiger.TigerAnimNotify_NiagaraEffect
// Size: 0x80 (Inherited: 0x38)
struct UTigerAnimNotify_NiagaraEffect : UAnimNotify {
	struct FSoftObjectPath NiagaraPath; // 0x38(0x18)
	struct UNiagaraSystem* CachedNiagaraEffect; // 0x50(0x08)
	struct FName AttachPointName; // 0x58(0x08)
	struct FVector EffectLocation; // 0x60(0x0c)
	struct FRotator EffectRotation; // 0x6c(0x0c)
	enum class EAttachLocation AttachLocationRule; // 0x78(0x01)
	bool bOnlySpawnOnLocalPlayer; // 0x79(0x01)
	char pad_7A[0x6]; // 0x7a(0x06)
};

// Class Tiger.TigerAnimNotify_ParticleEffect
// Size: 0xd0 (Inherited: 0x90)
struct UTigerAnimNotify_ParticleEffect : UAnimNotify_PlayParticleEffect {
	struct UParticleSystem* IndoorPSTemplate; // 0x90(0x08)
	struct UParticleSystem* OutdoorPSTemplate; // 0x98(0x08)
	enum class ETigerPlayOnClients PlayOnClients; // 0xa0(0x01)
	char pad_A1[0x1f]; // 0xa1(0x1f)
	struct UTigerParticleStrategyChooseSystem* ChooseParticleSystemOverride; // 0xc0(0x08)
	struct UTigerParticleStrategyPostSpawn* ParticlePostSpawnModification; // 0xc8(0x08)
};

// Class Tiger.TigerAnimNotify_PlayCharEffect
// Size: 0x48 (Inherited: 0x38)
struct UTigerAnimNotify_PlayCharEffect : UAnimNotify {
	struct UTigerCharacterEffect* Effect; // 0x38(0x08)
	struct FName SocketToUse; // 0x40(0x08)
};

// Class Tiger.TigerAnimNotify_PlayVoEvent
// Size: 0x40 (Inherited: 0x38)
struct UTigerAnimNotify_PlayVoEvent : UAnimNotify {
	struct FTigerNpcVoCategory VoCategory; // 0x38(0x08)
};

// Class Tiger.TigerAnimNotify_PrimeWeapon
// Size: 0x38 (Inherited: 0x38)
struct UTigerAnimNotify_PrimeWeapon : UAnimNotify {
};

// Class Tiger.TigerAnimNotify_Ragdoll
// Size: 0x48 (Inherited: 0x38)
struct UTigerAnimNotify_Ragdoll : UAnimNotify {
	struct FName RagdollOnlyBelowBone; // 0x38(0x08)
	bool bIncludeNamedBone; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float VelocityScale; // 0x44(0x04)
};

// Class Tiger.TigerAnimNotify_Recklessness
// Size: 0x40 (Inherited: 0x38)
struct UTigerAnimNotify_Recklessness : UAnimNotify {
	bool bActivate; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Tiger.TigerAnimNotify_ReloadComplete
// Size: 0x38 (Inherited: 0x38)
struct UTigerAnimNotify_ReloadComplete : UAnimNotify {
};

// Class Tiger.TigerAnimNotify_ReloadFull
// Size: 0x38 (Inherited: 0x38)
struct UTigerAnimNotify_ReloadFull : UAnimNotify {
};

// Class Tiger.TigerAnimNotify_ReloadSingle
// Size: 0x38 (Inherited: 0x38)
struct UTigerAnimNotify_ReloadSingle : UAnimNotify {
};

// Class Tiger.TigerAnimNotify_SetCapContext
// Size: 0x40 (Inherited: 0x38)
struct UTigerAnimNotify_SetCapContext : UAnimNotify {
	struct FName ContextName; // 0x38(0x08)
};

// Class Tiger.TigerAnimNotify_SpawnMesh
// Size: 0x70 (Inherited: 0x38)
struct UTigerAnimNotify_SpawnMesh : UAnimNotify {
	struct UStaticMesh* MeshToSpawn; // 0x38(0x08)
	struct FName SocketToSpawnFrom; // 0x40(0x08)
	struct FVector Direction[0x2]; // 0x48(0x18)
	float Speed[0x2]; // 0x60(0x08)
	float RandomAngularImpulseStrength; // 0x68(0x04)
	bool bShowInEditor; // 0x6c(0x01)
	char pad_6D[0x3]; // 0x6d(0x03)
};

// Class Tiger.TigerAnimNotify_TriggerUpdateWpnAppearance
// Size: 0x38 (Inherited: 0x38)
struct UTigerAnimNotify_TriggerUpdateWpnAppearance : UAnimNotify {
};

// Class Tiger.TigerAnimNotifyState_AbortAnimationOnInput
// Size: 0x38 (Inherited: 0x30)
struct UTigerAnimNotifyState_AbortAnimationOnInput : UAnimNotifyState {
	float BlendOutTime; // 0x30(0x04)
	bool bShouldAbortOnMovement; // 0x34(0x01)
	bool bShouldAbortOnHeldBlock; // 0x35(0x01)
	char pad_36[0x2]; // 0x36(0x02)
};

// Class Tiger.TigerAnimNotifyState_CameraPresetOverride
// Size: 0x38 (Inherited: 0x30)
struct UTigerAnimNotifyState_CameraPresetOverride : UAnimNotifyState {
	struct UTigerCameraPreset* CameraPreset; // 0x30(0x08)
};

// Class Tiger.TigerAnimNotifyState_CancelReactionIfThreatened
// Size: 0x38 (Inherited: 0x30)
struct UTigerAnimNotifyState_CancelReactionIfThreatened : UAnimNotifyState {
	enum class ETigerAIAnimationMode StateToCancelFor; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)

	void OnReactionCanceled(struct ATigerNPC* NPC); // Function Tiger.TigerAnimNotifyState_CancelReactionIfThreatened.OnReactionCanceled // (Event|Public|BlueprintEvent|Const) // @ game+0x16c0340
};

// Class Tiger.TigerAnimNotifyState_DamageImmunity
// Size: 0x40 (Inherited: 0x30)
struct UTigerAnimNotifyState_DamageImmunity : UAnimNotifyState {
	struct TArray<struct UDamageType*> ImmunityTo; // 0x30(0x10)
};

// Class Tiger.TigerAnimNotifyState_EnableTurnStart
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnimNotifyState_EnableTurnStart : UAnimNotifyState {
};

// Class Tiger.TigerAnimNotifyState_EnableWeaponHitbox
// Size: 0x50 (Inherited: 0x30)
struct UTigerAnimNotifyState_EnableWeaponHitbox : UAnimNotifyState {
	char pad_30[0x10]; // 0x30(0x10)
	struct UCurveFloat* pitchOffsetCurve; // 0x40(0x08)
	int32_t WeaponIndex; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class Tiger.TigerAnimNotifyState_FaceCameraDirection
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnimNotifyState_FaceCameraDirection : UAnimNotifyState {
};

// Class Tiger.TigerAnimNotifyState_HeavyAttackRange
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnimNotifyState_HeavyAttackRange : UAnimNotifyState {

	void OnChargeUpEnded(struct ATigerPlayer* Player, struct UTigerMeleeWeapon* EquippedWeapon, float ChargeUpRatio); // Function Tiger.TigerAnimNotifyState_HeavyAttackRange.OnChargeUpEnded // (Event|Public|BlueprintEvent|Const) // @ game+0x16c0340
	struct UTigerMeleeWeapon* GetEquippedWeapon(struct USkeletalMeshComponent* MeshComp); // Function Tiger.TigerAnimNotifyState_HeavyAttackRange.GetEquippedWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1239e90
};

// Class Tiger.TigerAnimNotifyState_HideWeapon
// Size: 0x38 (Inherited: 0x30)
struct UTigerAnimNotifyState_HideWeapon : UAnimNotifyState {
	enum class ETigerTriggerUpdateWpnAppearance WeaponAppearanceUpdate; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Tiger.TigerAnimNotifyState_Invulnerability
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnimNotifyState_Invulnerability : UAnimNotifyState {
};

// Class Tiger.TigerAnimNotifyState_LockOwner
// Size: 0x38 (Inherited: 0x30)
struct UTigerAnimNotifyState_LockOwner : UAnimNotifyState {
	bool bStopActiveMovement; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Tiger.TigerAnimNotifyState_MeleeRecoveryEnableMove
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnimNotifyState_MeleeRecoveryEnableMove : UAnimNotifyState {
};

// Class Tiger.TigerAnimNotifyState_OverrideCanInteractInDodge
// Size: 0x38 (Inherited: 0x30)
struct UTigerAnimNotifyState_OverrideCanInteractInDodge : UAnimNotifyState {
	struct UTigerMeleeWeapon* RequiredWeapon; // 0x30(0x08)
};

// Class Tiger.TigerAnimNotifyState_RangedHitAnimInterruptRange
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnimNotifyState_RangedHitAnimInterruptRange : UAnimNotifyState {
};

// Class Tiger.TigerAnimNotifyState_ResetCloth
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnimNotifyState_ResetCloth : UAnimNotifyState {
};

// Class Tiger.TigerAnimNotifyState_TimedIndoorOutDoorParticleEffect
// Size: 0x78 (Inherited: 0x30)
struct UTigerAnimNotifyState_TimedIndoorOutDoorParticleEffect : UAnimNotifyState {
	struct UParticleSystem* IndoorPSTemplate; // 0x30(0x08)
	struct UParticleSystem* OutdoorPSTemplate; // 0x38(0x08)
	enum class ETigerPlayOnClients PlayOnClients; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	struct FName SocketName; // 0x44(0x08)
	struct FVector LocationOffset; // 0x4c(0x0c)
	struct FRotator RotationOffset; // 0x58(0x0c)
	bool bDestroyAtEnd; // 0x64(0x01)
	char pad_65[0x3]; // 0x65(0x03)
	struct UTigerParticleStrategyChooseSystem* ChooseParticleSystemOverride; // 0x68(0x08)
	struct UTigerParticleStrategyPostSpawn* ParticlePostSpawnModification; // 0x70(0x08)
};

// Class Tiger.TigerAnimNotifyState_WallGrindFX
// Size: 0x40 (Inherited: 0x30)
struct UTigerAnimNotifyState_WallGrindFX : UAnimNotifyState {
	struct TArray<struct FName> SocketsToUse; // 0x30(0x10)
};

// Class Tiger.TigerAnimNotifyState_WeaponGlow
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnimNotifyState_WeaponGlow : UAnimNotifyState {

	void OnWeaponGlowEnd(struct USkeletalMeshComponent* WeaponMeshComponent, struct UTigerMeleeWeaponTrailConfig* WeaponEffectsConfig); // Function Tiger.TigerAnimNotifyState_WeaponGlow.OnWeaponGlowEnd // (Event|Protected|BlueprintEvent|Const) // @ game+0x16c0340
	void OnWeaponGlowBegin(struct USkeletalMeshComponent* WeaponMeshComponent, struct UTigerMeleeWeaponTrailConfig* WeaponEffectsConfig); // Function Tiger.TigerAnimNotifyState_WeaponGlow.OnWeaponGlowBegin // (Event|Protected|BlueprintEvent|Const) // @ game+0x16c0340
};

// Class Tiger.TigerAnimNotifyState_WeaponTrail
// Size: 0x58 (Inherited: 0x30)
struct UTigerAnimNotifyState_WeaponTrail : UAnimNotifyState {
	int32_t WeaponIndex; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct UParticleSystem* PSTemplate; // 0x38(0x08)
	struct FName FirstSocketName; // 0x40(0x08)
	struct FName SecondSocketName; // 0x48(0x08)
	enum class ETrailWidthMode WidthScaleMode; // 0x50(0x01)
	char pad_51[0x3]; // 0x51(0x03)
	float WidthScale; // 0x54(0x04)

	void OnWeaponTrailsEnd(struct USkeletalMeshComponent* WeaponMeshComponent, struct UParticleSystemComponent* TrailParticleSystemComponent, struct ATigerCharacter* Character); // Function Tiger.TigerAnimNotifyState_WeaponTrail.OnWeaponTrailsEnd // (Event|Protected|BlueprintEvent|Const) // @ game+0x16c0340
	void OnWeaponTrailsBegin(struct USkeletalMeshComponent* WeaponMeshComponent, struct UParticleSystemComponent* TrailParticleSystemComponent, struct ATigerCharacter* Character, struct UTigerMeleeWeaponTrailConfig* WeaponTrailConfig); // Function Tiger.TigerAnimNotifyState_WeaponTrail.OnWeaponTrailsBegin // (Event|Protected|BlueprintEvent|Const) // @ game+0x16c0340
};

// Class Tiger.TigerAnimNotifyStateAttachMesh
// Size: 0x48 (Inherited: 0x30)
struct UTigerAnimNotifyStateAttachMesh : UAnimNotifyState {
	struct UStaticMesh* MeshToSpawn; // 0x30(0x08)
	struct FName SocketName; // 0x38(0x08)
	bool bShowInEditor; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float PropTimeout; // 0x44(0x04)
};

// Class Tiger.TigerAnimNotifyStateJdgSword
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnimNotifyStateJdgSword : UAnimNotifyState {
};

// Class Tiger.TigerANS_DeltaCorrectionWindow
// Size: 0x30 (Inherited: 0x30)
struct UTigerANS_DeltaCorrectionWindow : UAnimNotifyState {
};

// Class Tiger.TigerAnsSidewaysClimbBlocker
// Size: 0x30 (Inherited: 0x30)
struct UTigerAnsSidewaysClimbBlocker : UAnimNotifyState {
};

// Class Tiger.TigerApartmentArchetype
// Size: 0x250 (Inherited: 0x228)
struct ATigerApartmentArchetype : AActor {
	struct USceneComponent* Root; // 0x228(0x08)
	struct USceneComponent* Min; // 0x230(0x08)
	struct USceneComponent* Max; // 0x238(0x08)
	struct TArray<struct UMaterialInterface*> PossibleWallpapers; // 0x240(0x10)
};

// Class Tiger.TigerApartmentLight
// Size: 0x228 (Inherited: 0x228)
struct ATigerApartmentLight : AActor {
};

// Class Tiger.TigerWidget
// Size: 0x280 (Inherited: 0x260)
struct UTigerWidget : UUserWidget {
	char pad_260[0x8]; // 0x260(0x08)
	struct UTigerTooltipWidget* TigerTooltipWidget; // 0x268(0x08)
	struct TArray<struct FTigerTooltipAction> TooltipActions; // 0x270(0x10)

	void UpdateScrollOffsetFromGamepadInput(struct UScrollBox* ScrollBox); // Function Tiger.TigerWidget.UpdateScrollOffsetFromGamepadInput // (Final|Native|Public|BlueprintCallable) // @ game+0x1371ea0
	bool ShouldIgnoreVisibilityChanges(); // Function Tiger.TigerWidget.ShouldIgnoreVisibilityChanges // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x1371e40
	struct UTigerTooltipWidget* ReuseOrCreateNewTooltipWidget(struct UTigerTooltipWidget* InTooltipClass); // Function Tiger.TigerWidget.ReuseOrCreateNewTooltipWidget // (Final|Native|Public|BlueprintCallable) // @ game+0x1371da0
	void PostAkEvent(struct UAkAudioEvent* AudioEvent); // Function Tiger.TigerWidget.PostAkEvent // (Final|Native|Public|BlueprintCallable) // @ game+0x1371c80
	void OnPlayerStateReceived(struct ATigerPlayerState* InPlayerState); // Function Tiger.TigerWidget.OnPlayerStateReceived // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	bool IsSharkmobAccountLoginsEnabled(); // Function Tiger.TigerWidget.IsSharkmobAccountLoginsEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x13717b0
	void IncrementCollapseVisibility(); // Function Tiger.TigerWidget.IncrementCollapseVisibility // (Final|Native|Public|BlueprintCallable) // @ game+0x1371790
	struct ATigerPlayer* GetViewTargetTigerPlayer(); // Function Tiger.TigerWidget.GetViewTargetTigerPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13714b0
	struct ATigerSpectatorPawn* GetTigerSpectator(); // Function Tiger.TigerWidget.GetTigerSpectator // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1371480
	struct ATigerPlayerState* GetTigerPlayerState(); // Function Tiger.TigerWidget.GetTigerPlayerState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1371450
	struct ATigerPlayerController* GetTigerPlayerController(); // Function Tiger.TigerWidget.GetTigerPlayerController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1371420
	struct ATigerPlayer* GetTigerPlayer(); // Function Tiger.TigerWidget.GetTigerPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13713f0
	struct UTigerPersistentPlayerState* GetTigerPersistentPlayerState(); // Function Tiger.TigerWidget.GetTigerPersistentPlayerState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13713c0
	struct ATigerMatchHUD* GetTigerMatchHUD(); // Function Tiger.TigerWidget.GetTigerMatchHUD // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1371390
	struct ATigerMatchGameState* GetTigerMatchGameState(); // Function Tiger.TigerWidget.GetTigerMatchGameState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1371360
	struct ATigerElysiumHUD* GetTigerElysiumHUD(); // Function Tiger.TigerWidget.GetTigerElysiumHUD // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1371330
	struct ATigerHUD* GetTigerBaseHUD(); // Function Tiger.TigerWidget.GetTigerBaseHUD // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1371300
	struct ATigerPlayer* GetSpectatedTigerPlayer(); // Function Tiger.TigerWidget.GetSpectatedTigerPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13712d0
	float GetScrollOffsetFromGamepadInput(); // Function Tiger.TigerWidget.GetScrollOffsetFromGamepadInput // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x13712a0
	struct UWidget* GetRootWidget(); // Function Tiger.TigerWidget.GetRootWidget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1371270
	struct UTigerPartyManager* GetPartyManager(); // Function Tiger.TigerWidget.GetPartyManager // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1371240
	void DecrementCollapseVisibility(); // Function Tiger.TigerWidget.DecrementCollapseVisibility // (Final|Native|Public|BlueprintCallable) // @ game+0x1371220
	struct UTigerTooltipWidget* ConstructTooltipWidget(); // Function Tiger.TigerWidget.ConstructTooltipWidget // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
	void CallReleasedForAction(struct FName InputAction); // Function Tiger.TigerWidget.CallReleasedForAction // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x13710a0
	void CallPressedForAction(struct FName InputAction); // Function Tiger.TigerWidget.CallPressedForAction // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1371010
	void AddTooltipAction(struct FTigerTooltipAction NewTooltipAction, struct FDelegate OnPressed, struct FDelegate OnReleased); // Function Tiger.TigerWidget.AddTooltipAction // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1370da0
};

// Class Tiger.TigerArchetypeLevelWidget
// Size: 0x290 (Inherited: 0x280)
struct UTigerArchetypeLevelWidget : UTigerWidget {
	int32_t ArchetypeLevel; // 0x280(0x04)
	struct TWeakObjectPtr<struct ATigerPlayer> RepresentedPlayer; // 0x284(0x08)
	char pad_28C[0x4]; // 0x28c(0x04)

	void UpdateArchetypeLevel(); // Function Tiger.TigerArchetypeLevelWidget.UpdateArchetypeLevel // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void OnSelectedCharacterChanged(struct UTigerPersistentPlayerState* InPersistentPlayerState); // Function Tiger.TigerArchetypeLevelWidget.OnSelectedCharacterChanged // (Final|Native|Protected) // @ game+0x123a390
	void OnArchetypeChanged(struct UTigerPlayerClanData* InClanData, struct UTigerPowerKit* InArchetypeData); // Function Tiger.TigerArchetypeLevelWidget.OnArchetypeChanged // (Final|Native|Protected) // @ game+0x1239fc0
	void Init(struct ATigerPlayer* InRepresentedPlayer); // Function Tiger.TigerArchetypeLevelWidget.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x1239f30
};

// Class Tiger.TigerMenuWidget
// Size: 0x290 (Inherited: 0x280)
struct UTigerMenuWidget : UTigerWidget {
	struct UTigerSharedMouseCursor* SharedMouseCursor; // 0x280(0x08)
	bool bStopPlayerInteractionsOnOpen; // 0x288(0x01)
	char pad_289[0x1]; // 0x289(0x01)
	bool bShouldCloseOtherMenusOnOpen; // 0x28a(0x01)
	char pad_28B[0x5]; // 0x28b(0x05)

	bool TryMakeDateTime(int32_t InYear, int32_t InMonth, int32_t InDay, struct FDateTime OutDateTime); // Function Tiger.TigerMenuWidget.TryMakeDateTime // (Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x12d27f0
	void Open(); // Function Tiger.TigerMenuWidget.Open // (Native|Public|BlueprintCallable) // @ game+0x12d2210
	void OnPersistentPlayerStateInitialized(struct UTigerPersistentPlayerState* InPersistentPlayerState); // Function Tiger.TigerMenuWidget.OnPersistentPlayerStateInitialized // (Native|Event|Protected|BlueprintEvent) // @ game+0x12d2040
	void OnPersistentPlayerInitialized(struct ATigerPlayerController* InPlayerController); // Function Tiger.TigerMenuWidget.OnPersistentPlayerInitialized // (Final|Native|Protected) // @ game+0x12d1fb0
	void OnOpen(); // Function Tiger.TigerMenuWidget.OnOpen // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void OnClose(); // Function Tiger.TigerMenuWidget.OnClose // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	bool IsOpen(); // Function Tiger.TigerMenuWidget.IsOpen // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12d1ea0
	void Close(); // Function Tiger.TigerMenuWidget.Close // (Native|Public|BlueprintCallable) // @ game+0x12c9fd0
};

// Class Tiger.TigerIngameSubmenuWidget
// Size: 0x2b8 (Inherited: 0x290)
struct UTigerIngameSubmenuWidget : UTigerMenuWidget {
	struct FText MenuName; // 0x290(0x18)
	struct UTigerIngameMenuWidget* MenuContainer; // 0x2a8(0x08)
	bool InGameMenuEnabled; // 0x2b0(0x01)
	enum class ETigerNewNotificationMenuOptions NewNotificationMenuOption; // 0x2b1(0x01)
	char pad_2B2[0x6]; // 0x2b2(0x06)

	void UnregisterSharedInputs(); // Function Tiger.TigerIngameSubmenuWidget.UnregisterSharedInputs // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
	void RegisterSharedInputs(); // Function Tiger.TigerIngameSubmenuWidget.RegisterSharedInputs // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
};

// Class Tiger.TigerSceneBackgroundUI
// Size: 0x3b0 (Inherited: 0x2b8)
struct UTigerSceneBackgroundUI : UTigerIngameSubmenuWidget {
	struct TSoftObjectPtr<struct UWorld> DefaultSubLevel; // 0x2b8(0x28)
	char pad_2E0[0x8]; // 0x2e0(0x08)
	struct UTigerSubLevelList* SubLevelList; // 0x2e8(0x08)
	struct FName DefaultCameraTag; // 0x2f0(0x08)
	struct FName SpawnLocationTag; // 0x2f8(0x08)
	struct FViewTargetTransitionParams CameraTransitionParams; // 0x300(0x10)
	struct TSoftObjectPtr<struct UTigerItemPreviewAsset> ItemPreviews; // 0x310(0x28)
	struct FName ItemParentTag; // 0x338(0x08)
	struct ATigerSingleChildActor* ItemParentActor; // 0x340(0x08)
	SoftClassProperty CurrentPreviewItem; // 0x348(0x28)
	struct TArray<struct ACineCameraActor*> CinematicCameras; // 0x370(0x10)
	char pad_380[0x20]; // 0x380(0x20)
	struct FMulticastInlineDelegate OnBackgroundShown; // 0x3a0(0x10)

	bool TransitionToCameraWithTag(struct FName CameraTag, bool bUseCameraTransition); // Function Tiger.TigerSceneBackgroundUI.TransitionToCameraWithTag // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x132f3f0
	void ShowDefaultBackgroundScene(); // Function Tiger.TigerSceneBackgroundUI.ShowDefaultBackgroundScene // (Final|Native|Protected|BlueprintCallable) // @ game+0x132f320
	void ShowBackgroundScene(int32_t InSubLevelIndex); // Function Tiger.TigerSceneBackgroundUI.ShowBackgroundScene // (Final|Native|Protected|BlueprintCallable) // @ game+0x132f290
	void RetryPreviewItem(); // Function Tiger.TigerSceneBackgroundUI.RetryPreviewItem // (Final|Native|Protected) // @ game+0x132f270
	void PreviewReward(struct FTigerItemId ItemId); // Function Tiger.TigerSceneBackgroundUI.PreviewReward // (Final|Native|Protected|BlueprintCallable) // @ game+0x132f1e0
	void PreviewItem(SoftClassProperty InItemClassPath); // Function Tiger.TigerSceneBackgroundUI.PreviewItem // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x132f120
	void OnPreviewItemUpdated(struct UTigerInventoryItemBase* InPreviewItem, struct ATigerBattlepassRewardPreview* InPreviewActor, struct UTigerInventoryItemBase* InCombinedItemParent); // Function Tiger.TigerSceneBackgroundUI.OnPreviewItemUpdated // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
	void OnBackgroundSceneShownNative(); // Function Tiger.TigerSceneBackgroundUI.OnBackgroundSceneShownNative // (Native|Protected) // @ game+0x12c9380
	void OnBackgroundSceneShown(); // Function Tiger.TigerSceneBackgroundUI.OnBackgroundSceneShown // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void HidePreviewItem(); // Function Tiger.TigerSceneBackgroundUI.HidePreviewItem // (Final|Native|Protected|BlueprintCallable) // @ game+0x132f070
	struct TArray<struct AActor*> GetCurrentPaperDollArray(struct FName InBattlePassSubLevelName); // Function Tiger.TigerSceneBackgroundUI.GetCurrentPaperDollArray // (Final|Native|Protected|BlueprintCallable) // @ game+0x132ef40
};

// Class Tiger.TigerArchetypeSelectElysiumUI
// Size: 0x3d0 (Inherited: 0x3b0)
struct UTigerArchetypeSelectElysiumUI : UTigerSceneBackgroundUI {
	struct TArray<struct FTigerPersistentPlayerCharacter> PlayerCharacters; // 0x3b0(0x10)
	struct FTigerItemId AdditionalCharacterSlotItem; // 0x3c0(0x08)
	char NumCharacterSlots; // 0x3c8(0x01)
	char pad_3C9[0x7]; // 0x3c9(0x07)

	void SelectCharacter(struct FTigerPersistentCharacterID InCharacterId); // Function Tiger.TigerArchetypeSelectElysiumUI.SelectCharacter // (Final|Native|Protected|BlueprintCallable) // @ game+0x123a4b0
	void OnSelectedCharacterChanged(struct UTigerPersistentPlayerState* InPersistentPlayerState); // Function Tiger.TigerArchetypeSelectElysiumUI.OnSelectedCharacterChanged // (Final|Native|Protected) // @ game+0x123a420
	void OnPlayerInventoryChanged(struct UTigerPersistentPlayerState* InPersistentPlayerState); // Function Tiger.TigerArchetypeSelectElysiumUI.OnPlayerInventoryChanged // (Final|Native|Protected) // @ game+0x123a300
	void OnGotPlayerCharacters(struct TArray<struct FTigerPersistentPlayerCharacter> InCharacters, struct FString InErrorString); // Function Tiger.TigerArchetypeSelectElysiumUI.OnGotPlayerCharacters // (Final|Native|Protected|HasOutParms) // @ game+0x123a1d0
	void OnBuyCharacterSlotServerResponse(bool bInSuccess, struct FTigerItemId InItemId, struct FString InErrorMessage); // Function Tiger.TigerArchetypeSelectElysiumUI.OnBuyCharacterSlotServerResponse // (Final|Native|Protected|HasOutParms) // @ game+0x123a090
	void OnBuyCharacterSlotResults(bool bInSuccess, struct FString InErrorString); // Function Tiger.TigerArchetypeSelectElysiumUI.OnBuyCharacterSlotResults // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void OnArchetypeChanged(struct UTigerPowerKit* InArchetypeData, struct TArray<int32_t> InPlayerArchetypeCharacterIndices); // Function Tiger.TigerArchetypeSelectElysiumUI.OnArchetypeChanged // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x16c0340
	struct FTigerItemIdWithPrice GetAdditionalSlotPrice(); // Function Tiger.TigerArchetypeSelectElysiumUI.GetAdditionalSlotPrice // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1239e50
	void CreateNewCharacter(struct UTigerPowerKit* InArchetypeData); // Function Tiger.TigerArchetypeSelectElysiumUI.CreateNewCharacter // (Final|Native|Protected|BlueprintCallable) // @ game+0x1239dc0
	void ChangeArchetype(struct UTigerPowerKit* InArchetypeData); // Function Tiger.TigerArchetypeSelectElysiumUI.ChangeArchetype // (Final|Native|Protected|BlueprintCallable) // @ game+0x1239d30
	void BuyAdditionalCharacterSlot(); // Function Tiger.TigerArchetypeSelectElysiumUI.BuyAdditionalCharacterSlot // (Final|Native|Protected|BlueprintCallable) // @ game+0x1239d10
};

// Class Tiger.TigerArchetypeSelectPragueUI
// Size: 0x2f8 (Inherited: 0x290)
struct UTigerArchetypeSelectPragueUI : UTigerMenuWidget {
	int32_t GroupSize; // 0x290(0x04)
	int32_t PreGameStateEndTime; // 0x294(0x04)
	struct FString PreHighlightTag; // 0x298(0x10)
	float TimeLeftUntilStateChange; // 0x2a8(0x04)
	enum class ETigerArchetypeSelectUiState UiState; // 0x2ac(0x01)
	char pad_2AD[0x3]; // 0x2ad(0x03)
	struct TArray<struct FTigerPersistentPlayerCharacter> PlayerCharacters; // 0x2b0(0x10)
	enum class ETigerPowerKitType SelectedArchetypeType; // 0x2c0(0x01)
	char pad_2C1[0x7]; // 0x2c1(0x07)
	struct UTigerPreMatchPaperDollComponent* PreMatchPaperDollComp; // 0x2c8(0x08)
	char pad_2D0[0x28]; // 0x2d0(0x28)

	void SelectCharacterForArchetype(struct UTigerPowerKit* InArchetypeData); // Function Tiger.TigerArchetypeSelectPragueUI.SelectCharacterForArchetype // (Final|Native|Protected|BlueprintCallable) // @ game+0x123e190
	void OnUiStateChanged(enum class ETigerArchetypeSelectUiState InPreviousUiState); // Function Tiger.TigerArchetypeSelectPragueUI.OnUiStateChanged // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void OnPlayerCharactersReceived(struct TArray<struct FTigerPersistentPlayerCharacter> InCharacters, struct FString InErrorString); // Function Tiger.TigerArchetypeSelectPragueUI.OnPlayerCharactersReceived // (Final|Native|Protected|HasOutParms) // @ game+0x123de70
	void OnPlayerChangedSelection(struct ATigerPlayerState* InPlayerState); // Function Tiger.TigerArchetypeSelectPragueUI.OnPlayerChangedSelection // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
	void OnGroupMembersChanged(struct UTigerGroupStateComponent* InGroupStateComponent, struct TArray<struct ATigerPlayerState*> InPreviousGroupMembers); // Function Tiger.TigerArchetypeSelectPragueUI.OnGroupMembersChanged // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
	void OnArchetypeSelectionLocked(struct ATigerPlayerState* InPlayerState, enum class ETigerPowerKitType InArchetype); // Function Tiger.TigerArchetypeSelectPragueUI.OnArchetypeSelectionLocked // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	float GetSecondsLeftUntilPlayerSelection(enum class ETigerArchetypeSelectUiState InPlayerUiState); // Function Tiger.TigerArchetypeSelectPragueUI.GetSecondsLeftUntilPlayerSelection // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x123db40
	void EnablePaperDollHighlight(struct ATigerPaperDoll* InPaperDoll, bool bInEnable); // Function Tiger.TigerArchetypeSelectPragueUI.EnablePaperDollHighlight // (Final|Native|Protected|BlueprintCallable) // @ game+0x123d8f0
};

// Class Tiger.TigerAreaEffect
// Size: 0x4c0 (Inherited: 0x228)
struct ATigerAreaEffect : AActor {
	struct UParticleSystem* StartParticleType; // 0x228(0x08)
	struct UParticleSystem* LoopedParticleType; // 0x230(0x08)
	struct UParticleSystem* EndParticleType; // 0x238(0x08)
	struct UDamageType* DamageType; // 0x240(0x08)
	enum class ETigerDamageCauser DamageCauserType; // 0x248(0x01)
	char pad_249[0x7]; // 0x249(0x07)
	struct FRuntimeFloatCurve TimeDamageModifierCurve; // 0x250(0x88)
	struct FRuntimeFloatCurve RangeDamageModifierCurve; // 0x2d8(0x88)
	struct FRuntimeFloatCurve TimeHealingModifierCurve; // 0x360(0x88)
	struct FRuntimeFloatCurve RangeHealingModifierCurve; // 0x3e8(0x88)
	float Range; // 0x470(0x04)
	float InitialDamageAmount; // 0x474(0x04)
	float DamageAmount; // 0x478(0x04)
	float InitialHealAmount; // 0x47c(0x04)
	float HealAmount; // 0x480(0x04)
	float TickRate; // 0x484(0x04)
	float Duration; // 0x488(0x04)
	float Delay; // 0x48c(0x04)
	bool bShouldAffectCivilians; // 0x490(0x01)
	char pad_491[0x7]; // 0x491(0x07)
	struct UParticleSystemComponent* LoopedParticleComponent; // 0x498(0x08)
	char pad_4A0[0x20]; // 0x4a0(0x20)

	void Trigger(); // Function Tiger.TigerAreaEffect.Trigger // (Final|Native|Public) // @ game+0x123e220
	void OnVehicleHit(struct AActor* InActor); // Function Tiger.TigerAreaEffect.OnVehicleHit // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void OnTriggerClient(); // Function Tiger.TigerAreaEffect.OnTriggerClient // (Event|Public|BlueprintEvent) // @ game+0x16c0340
};

// Class Tiger.TigerSimpleTextPrompt
// Size: 0x2a8 (Inherited: 0x280)
struct UTigerSimpleTextPrompt : UTigerWidget {
	struct FText DisplayText; // 0x280(0x18)
	float PromptLifetimeFailsafe; // 0x298(0x04)
	bool bIsVisible; // 0x29c(0x01)
	char pad_29D[0xb]; // 0x29d(0x0b)

	void SetText(struct FText Text); // Function Tiger.TigerSimpleTextPrompt.SetText // (Final|Native|Public|BlueprintCallable) // @ game+0x1337eb0
	void OnShowPrompt(); // Function Tiger.TigerSimpleTextPrompt.OnShowPrompt // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void OnHidePrompt(); // Function Tiger.TigerSimpleTextPrompt.OnHidePrompt // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void Hide(); // Function Tiger.TigerSimpleTextPrompt.Hide // (Final|Native|Public|BlueprintCallable) // @ game+0x1337a70
	void FailsafeHide(); // Function Tiger.TigerSimpleTextPrompt.FailsafeHide // (Final|Native|Private) // @ game+0x1337940
	bool CanBeShown(); // Function Tiger.TigerSimpleTextPrompt.CanBeShown // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x13378f0
};

// Class Tiger.TigerArtifactPickedupPrompt
// Size: 0x2b0 (Inherited: 0x2a8)
struct UTigerArtifactPickedupPrompt : UTigerSimpleTextPrompt {
	struct UTigerArtifactAsset* ArtifactAsset; // 0x2a8(0x08)

	void OnArtifactAssetSet(struct UTigerArtifactAsset* InArtifactAsset); // Function Tiger.TigerArtifactPickedupPrompt.OnArtifactAssetSet // (Event|Public|BlueprintEvent) // @ game+0x16c0340
};

// Class Tiger.TigerAsyncChooseNextWaypoint
// Size: 0xf8 (Inherited: 0x70)
struct UTigerAsyncChooseNextWaypoint : UBTTaskNode {
	struct FBlackboardKeySelector Index; // 0x70(0x28)
	struct FBlackboardKeySelector Waypoint; // 0x98(0x28)
	struct FBlackboardKeySelector bWaypointDirectionIsForward; // 0xc0(0x28)
	char pad_E8[0x10]; // 0xe8(0x10)
};

// Class Tiger.TigerAudioVisualizationSpawnerComponent
// Size: 0xd8 (Inherited: 0xb0)
struct UTigerAudioVisualizationSpawnerComponent : UActorComponent {
	struct UParticleSystem* ParticleSystemToSpawn; // 0xb0(0x08)
	int32_t MaxSimultaneousVisualizations; // 0xb8(0x04)
	char pad_BC[0x4]; // 0xbc(0x04)
	struct TArray<struct FTigerHeightenedSensesAudioVisualization> ActiveVisualizations; // 0xc0(0x10)
	char pad_D0[0x8]; // 0xd0(0x08)

	void VisualizeAudioEvent(struct FVector InLocation, bool InShowOnlyInHeightenedSenses); // Function Tiger.TigerAudioVisualizationSpawnerComponent.VisualizeAudioEvent // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x123e240
};

// Class Tiger.TigerAuthenticationManager
// Size: 0x168 (Inherited: 0x38)
struct UTigerAuthenticationManager : UTigerAuthenticationManagerBase {
	char pad_38[0x30]; // 0x38(0x30)
	bool bEnableSharkmobAccountLogin; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
	struct UTigerGameInstance* GameInstance; // 0x70(0x08)
	char pad_78[0xf0]; // 0x78(0xf0)

	bool IsSharkmobAccountLoginsEnabled(); // Function Tiger.TigerAuthenticationManager.IsSharkmobAccountLoginsEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x123dc80
	struct FString GetUserLocation(); // Function Tiger.TigerAuthenticationManager.GetUserLocation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x123dc00
	enum class EShAccountChannel GetAuthenticatedChannel(); // Function Tiger.TigerAuthenticationManager.GetAuthenticatedChannel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x123d9c0
};

// Class Tiger.TigerBalconyVolumeDefaultValues
// Size: 0x40 (Inherited: 0x30)
struct UTigerBalconyVolumeDefaultValues : UDataAsset {
	struct TArray<struct FTigerBuildingSystemBalconyVolumeDefaults> DefaultBalconyVolumeSets; // 0x30(0x10)
};

// Class Tiger.TigerNPCFacePoseMap
// Size: 0x38 (Inherited: 0x28)
struct UTigerNPCFacePoseMap : UObject {
	struct TArray<struct FTigerFacePoseData> HeadMeshsPoseAssets; // 0x28(0x10)
};

// Class Tiger.TigerCharacter
// Size: 0x780 (Inherited: 0x4c0)
struct ATigerCharacter : ACharacter {
	struct UTigerCharacterMeshManager* MeshManager; // 0x4c0(0x08)
	struct UTigerRangedWeaponComponent* RangedWeaponComponent; // 0x4c8(0x08)
	struct UTigerMeleeWeaponComponent* MeleeWeaponComponent; // 0x4d0(0x08)
	struct UTigerCombatComponent* CombatComponent; // 0x4d8(0x08)
	struct UTigerFeedingComponent* FeedingComponent; // 0x4e0(0x08)
	struct UTigerBuffComponent* BuffComponent; // 0x4e8(0x08)
	struct UTigerOutlineComponent* OutlineComponent; // 0x4f0(0x08)
	struct UAkComponent* AudioComponent; // 0x4f8(0x08)
	struct UAkComponent* NonOccludedAudioComponent; // 0x500(0x08)
	struct USceneComponent* AdditionalMeshes; // 0x508(0x08)
	struct USkeletalMeshComponent* HeadMesh; // 0x510(0x08)
	struct USkeletalMeshComponent* HoodieMesh; // 0x518(0x08)
	struct USkeletalMeshComponent* HairMesh; // 0x520(0x08)
	struct USkeletalMeshComponent* HeadgearMesh; // 0x528(0x08)
	struct USkeletalMeshComponent* EyewearMesh; // 0x530(0x08)
	struct USkeletalMeshComponent* BodyAdditionalMesh; // 0x538(0x08)
	char pad_540[0x18]; // 0x540(0x18)
	struct FMulticastInlineDelegate OnCharacterAction; // 0x558(0x10)
	bool bIsRootMotionDisabled; // 0x568(0x01)
	char pad_569[0x3]; // 0x569(0x03)
	float BaseMaxHealth; // 0x56c(0x04)
	struct USkeletalMeshComponent* ThirdPersonWeaponMeshRef; // 0x570(0x08)
	struct USkeletalMeshComponent* SecondaryWeaponMeshRef; // 0x578(0x08)
	struct USceneComponent* ProjectileSpawnRef; // 0x580(0x08)
	struct USceneComponent* SecondaryProjectileSpawnRef; // 0x588(0x08)
	struct FTigerReplicatedCharacterStats ReplicatedCharacterStats; // 0x590(0x18)
	char pad_5A8[0x9c]; // 0x5a8(0x9c)
	bool bBlueprintReferencesSetup; // 0x644(0x01)
	bool bShouldRestrictOffensiveActionsInElysium; // 0x645(0x01)
	char pad_646[0x2]; // 0x646(0x02)
	struct FMulticastInlineDelegate OnCharacterDeath; // 0x648(0x10)
	char pad_658[0x30]; // 0x658(0x30)
	float CurrentHealth; // 0x688(0x04)
	char pad_68C[0x4]; // 0x68c(0x04)
	struct FMulticastInlineDelegate OnMaxShieldReplicated; // 0x690(0x10)
	uint16_t MaxShield; // 0x6a0(0x02)
	uint16_t CurrentShield; // 0x6a2(0x02)
	float LowHealthThreshold; // 0x6a4(0x04)
	char pad_6A8[0x4]; // 0x6a8(0x04)
	float HitAnimationInterval; // 0x6ac(0x04)
	char pad_6B0[0xc]; // 0x6b0(0x0c)
	struct FVector HealthBarOffset; // 0x6bc(0x0c)
	enum class ETigerGender BodyType; // 0x6c8(0x01)
	bool bIsKindred; // 0x6c9(0x01)
	enum class ETigerCharacterType CharacterType; // 0x6ca(0x01)
	char pad_6CB[0x1]; // 0x6cb(0x01)
	struct FName RangedHitAnimationListName; // 0x6cc(0x08)
	struct FName MeleeHitAnimationListName; // 0x6d4(0x08)
	char pad_6DC[0x4]; // 0x6dc(0x04)
	struct UPhysicsAsset* HitboxPhysicsAsset; // 0x6e0(0x08)
	struct UPhysicsAsset* RagdollPhysicsAsset; // 0x6e8(0x08)
	char pad_6F0[0x10]; // 0x6f0(0x10)
	struct FTimerHandle RagdollTimer; // 0x700(0x08)
	struct UAnimMontage* TimedMontageLoop; // 0x708(0x08)
	struct FTimerHandle TimedMontageLoopTimer; // 0x710(0x08)
	char pad_718[0x10]; // 0x718(0x10)
	struct TArray<struct TWeakObjectPtr<struct ATigerCharacter>> CharmedByCharacters; // 0x728(0x10)
	bool bIsDodging; // 0x738(0x01)
	char pad_739[0x7]; // 0x739(0x07)
	float SmoothYawInterpSpeed; // 0x740(0x04)
	char pad_744[0x4]; // 0x744(0x04)
	struct UWidgetComponent* HealthBarComponent; // 0x748(0x08)
	struct USkeletalMeshSocket* WidgetSocket; // 0x750(0x08)
	char pad_758[0x28]; // 0x758(0x28)

	void TriggerLimitedHitAnimation(bool bIsRangedHit); // Function Tiger.TigerCharacter.TriggerLimitedHitAnimation // (Final|Native|Public|BlueprintCallable) // @ game+0x12564a0
	float TriggerHitAnimation(bool bInIsRangedHit); // Function Tiger.TigerCharacter.TriggerHitAnimation // (Native|Public|BlueprintCallable) // @ game+0x1256400
	float TriggerAnimationByName(struct FName AnimationMontageName, float PlayRate); // Function Tiger.TigerCharacter.TriggerAnimationByName // (Final|Native|Public|BlueprintCallable) // @ game+0x1256330
	void TigerOnMaxShieldReplicated__DelegateSignature(); // DelegateFunction Tiger.TigerCharacter.TigerOnMaxShieldReplicated__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x16c0340
	void TigerOnCharacterDeath__DelegateSignature(); // DelegateFunction Tiger.TigerCharacter.TigerOnCharacterDeath__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x16c0340
	void TigerOnCharacterAction__DelegateSignature(enum class ETigerCharacterAction InCharacterAction); // DelegateFunction Tiger.TigerCharacter.TigerOnCharacterAction__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x16c0340
	void SpawnBloodDecal(); // Function Tiger.TigerCharacter.SpawnBloodDecal // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	bool ShouldHealthbarBeVisible(); // Function Tiger.TigerCharacter.ShouldHealthbarBeVisible // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1256300
	void SetBaseMaxHealth(float NewMaxHealth); // Function Tiger.TigerCharacter.SetBaseMaxHealth // (Final|Native|Public|BlueprintCallable) // @ game+0x1256280
	void ReportCharacterAction(enum class ETigerCharacterAction Action); // Function Tiger.TigerCharacter.ReportCharacterAction // (Final|Native|Public|BlueprintCallable) // @ game+0x1256200
	void RefreshCharacterStats(); // Function Tiger.TigerCharacter.RefreshCharacterStats // (Final|Native|Public|BlueprintCallable) // @ game+0x12561e0
	int32_t PostAkEvent(struct UAkAudioEvent* AudioEvent, bool bEnableOcclusion); // Function Tiger.TigerCharacter.PostAkEvent // (Final|Native|Public|BlueprintCallable) // @ game+0x1256110
	void OnWeaponVisualChangedEvent(); // Function Tiger.TigerCharacter.OnWeaponVisualChangedEvent // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void OnWeaponFired(bool bSecondaryWeaponFired); // Function Tiger.TigerCharacter.OnWeaponFired // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void OnShowDamageAmount(struct FVector InHitLocation, struct FLinearColor InDamageColor, int32_t InTotalDamageAmount, int32_t InHealthDamageAmount, bool bInHasExtraHealth, bool bInHasShield, float InRangedDamageFalloffPercent); // Function Tiger.TigerCharacter.OnShowDamageAmount // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x16c0340
	void OnRep_MaxShieldChanged(uint16_t InOldMaxShield); // Function Tiger.TigerCharacter.OnRep_MaxShieldChanged // (Final|Native|Protected) // @ game+0x1255e10
	void OnRep_CurrentShieldChanged(); // Function Tiger.TigerCharacter.OnRep_CurrentShieldChanged // (Final|Native|Protected) // @ game+0x1255df0
	void OnRep_CurrentHealth(float InOldHealth); // Function Tiger.TigerCharacter.OnRep_CurrentHealth // (Native|Protected) // @ game+0x1255d60
	void OnPlayMeleeHitEffects(struct UTigerMeleeWeapon* WeaponHitBy, struct FVector ImpactLocation, struct FVector HitDirection); // Function Tiger.TigerCharacter.OnPlayMeleeHitEffects // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x16c0340
	void OnLocalDisciplineUseFailed(struct FDisciplineUse DisciplineUse); // Function Tiger.TigerCharacter.OnLocalDisciplineUseFailed // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x16c0340
	void OnLocalDisciplineUse(struct FDisciplineUse DisciplineUse, float ExpectedDuration); // Function Tiger.TigerCharacter.OnLocalDisciplineUse // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x16c0340
	void OnLocalDisciplineReleaseFailed(struct FDisciplineUse DisciplineUse); // Function Tiger.TigerCharacter.OnLocalDisciplineReleaseFailed // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x16c0340
	void OnLocalDisciplineRelease(struct FDisciplineUse DisciplineUse, float ExpectedDuration); // Function Tiger.TigerCharacter.OnLocalDisciplineRelease // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x16c0340
	void OnDodged(bool IsControllingPlayer, bool bLaunchedInAir, struct FVector LaunchDirection, char DodgeStage); // Function Tiger.TigerCharacter.OnDodged // (Event|Protected|HasDefaults|BlueprintEvent) // @ game+0x16c0340
	void OnDisciplineUseSucceeded(struct FDisciplineUse DisciplineUse); // Function Tiger.TigerCharacter.OnDisciplineUseSucceeded // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x16c0340
	void OnDisciplineReleaseSucceeded(struct FDisciplineUse DisciplineUse); // Function Tiger.TigerCharacter.OnDisciplineReleaseSucceeded // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x16c0340
	void OnChangedAkAlignment(enum class ETigerCharacterAkAlignmentType InAlignment); // Function Tiger.TigerCharacter.OnChangedAkAlignment // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void Multicast_SetRagdollDeath(bool bEnableRagdoll); // Function Tiger.TigerCharacter.Multicast_SetRagdollDeath // (Net|Native|Event|NetMulticast|Public) // @ game+0x1255bc0
	void Multicast_PostAkEvent(struct UAkAudioEvent* AudioEvent, bool bSkipLocallyControlled); // Function Tiger.TigerCharacter.Multicast_PostAkEvent // (Net|Native|Event|NetMulticast|Public) // @ game+0x1255af0
	void Multicast_PlaySoundAtActorLocation(struct USoundBase* SoundBase); // Function Tiger.TigerCharacter.Multicast_PlaySoundAtActorLocation // (Net|Native|Event|NetMulticast|Public) // @ game+0x1255a60
	void Multicast_PlayAnimationBroadcastUnreliable(struct UAnimMontage* Animation, bool bSkipLocallyControlled); // Function Tiger.TigerCharacter.Multicast_PlayAnimationBroadcastUnreliable // (Net|Native|Event|NetMulticast|Public) // @ game+0x1255990
	void Multicast_PlayAnimationBroadcast(struct UAnimMontage* Animation, bool bSkipLocallyControlled); // Function Tiger.TigerCharacter.Multicast_PlayAnimationBroadcast // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x12558c0
	void Multicast_OnJumped(int32_t InJumpCount); // Function Tiger.TigerCharacter.Multicast_OnJumped // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x1255830
	void Multicast_ApplyEffectWithTarget(struct UTigerCharacterEffect* Effect, struct ATigerCharacter* Target); // Function Tiger.TigerCharacter.Multicast_ApplyEffectWithTarget // (Net|Native|Event|NetMulticast|Protected) // @ game+0x1255760
	void Multicast_ApplyEffectWithSocket(struct UTigerCharacterEffect* Effect, struct FName SocketName); // Function Tiger.TigerCharacter.Multicast_ApplyEffectWithSocket // (Net|Native|Event|NetMulticast|Protected) // @ game+0x1255690
	void Multicast_ApplyEffect(struct UTigerCharacterEffect* Effect); // Function Tiger.TigerCharacter.Multicast_ApplyEffect // (Net|Native|Event|NetMulticast|Protected) // @ game+0x1255600
	void Multicast_AbortAnimationBroadcastUnreliable(struct UAnimMontage* Animation, bool bSkipLocallyControlled); // Function Tiger.TigerCharacter.Multicast_AbortAnimationBroadcastUnreliable // (Net|Native|Event|NetMulticast|Public) // @ game+0x1255530
	void Multicast_AbortAnimationBroadcast(struct UAnimMontage* Animation, bool bSkipLocallyControlled); // Function Tiger.TigerCharacter.Multicast_AbortAnimationBroadcast // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1255460
	void LocalApplyEffectWithTarget(struct UTigerCharacterEffect* Effect, struct ATigerCharacter* Target); // Function Tiger.TigerCharacter.LocalApplyEffectWithTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x1255390
	void LocalApplyEffectWithSocket(struct UTigerCharacterEffect* Effect, struct FName SocketName); // Function Tiger.TigerCharacter.LocalApplyEffectWithSocket // (Final|Native|Public|BlueprintCallable) // @ game+0x12552c0
	void LocalApplyEffect(struct UTigerCharacterEffect* Effect); // Function Tiger.TigerCharacter.LocalApplyEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x1255230
	bool IsSprinting(); // Function Tiger.TigerCharacter.IsSprinting // (Final|Native|Public|BlueprintCallable) // @ game+0x1255200
	bool IsSimulatedProxy(); // Function Tiger.TigerCharacter.IsSimulatedProxy // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12551d0
	bool IsPlayingAnimationMontage(); // Function Tiger.TigerCharacter.IsPlayingAnimationMontage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12551a0
	bool IsInvulnerable(); // Function Tiger.TigerCharacter.IsInvulnerable // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1255170
	bool IsInJump(); // Function Tiger.TigerCharacter.IsInJump // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1255140
	bool IsInAir(); // Function Tiger.TigerCharacter.IsInAir // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1255110
	bool IsFriendlyWith(struct ATigerCharacter* OtherCharacter); // Function Tiger.TigerCharacter.IsFriendlyWith // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1255070
	bool IsDowned(); // Function Tiger.TigerCharacter.IsDowned // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1255040
	bool IsDead(); // Function Tiger.TigerCharacter.IsDead // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1255020
	bool IsClimbing(); // Function Tiger.TigerCharacter.IsClimbing // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1254ff0
	bool IsCharacterVisible(); // Function Tiger.TigerCharacter.IsCharacterVisible // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1254fd0
	bool IsBelowLowHealthThreshold(float InHealthOffset); // Function Tiger.TigerCharacter.IsBelowLowHealthThreshold // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1254f40
	struct UTigerCharacterMovementComponent* GetTigerCharacterMovement(); // Function Tiger.TigerCharacter.GetTigerCharacterMovement // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1254730
	struct UTigerAnimInstance* GetTigerAnimInstance(); // Function Tiger.TigerCharacter.GetTigerAnimInstance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1254700
	float GetSmoothYaw(); // Function Tiger.TigerCharacter.GetSmoothYaw // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12546d0
	struct FTigerReplicatedCharacterStats GetReplicatedStats(); // Function Tiger.TigerCharacter.GetReplicatedStats // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1254690
	struct FTigerNonReplicatedCharacterStats GetNonReplicatedStats(); // Function Tiger.TigerCharacter.GetNonReplicatedStats // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12545f0
	float GetMaxShield(); // Function Tiger.TigerCharacter.GetMaxShield // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12545c0
	float GetMaxHealth(); // Function Tiger.TigerCharacter.GetMaxHealth // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1254580
	float GetHeartVisibility(); // Function Tiger.TigerCharacter.GetHeartVisibility // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1254560
	float GetCurrentShield(); // Function Tiger.TigerCharacter.GetCurrentShield // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1254530
	float GetCurrentHealthPercentage(); // Function Tiger.TigerCharacter.GetCurrentHealthPercentage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1254500
	float GetCurrentHealth(); // Function Tiger.TigerCharacter.GetCurrentHealth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12544d0
	float GetBaseMaxHealth(); // Function Tiger.TigerCharacter.GetBaseMaxHealth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12544a0
	enum class ETigerCharacterAkAlignmentType GetAkCharacterAlignment(); // Function Tiger.TigerCharacter.GetAkCharacterAlignment // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12543f0
	struct FRotator GetAimRotation(); // Function Tiger.TigerCharacter.GetAimRotation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x12543b0
	float GetAimAnglePitch(); // Function Tiger.TigerCharacter.GetAimAnglePitch // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1254380
	float ChangeHealth(float InHealAmount, bool bInOnlyHealRecentDamage); // Function Tiger.TigerCharacter.ChangeHealth // (Native|Public|BlueprintCallable) // @ game+0x12542a0
	void CalculateCharacterStats(struct FTigerCharacterStatModification AccumulatedStats); // Function Tiger.TigerCharacter.CalculateCharacterStats // (Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x12541d0
	void AuthorityApplyEffectWithTarget(struct UTigerCharacterEffect* Effect, struct ATigerCharacter* Target); // Function Tiger.TigerCharacter.AuthorityApplyEffectWithTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x1254100
	void AuthorityApplyEffectWithSocket(struct UTigerCharacterEffect* Effect, struct FName SocketName); // Function Tiger.TigerCharacter.AuthorityApplyEffectWithSocket // (Final|Native|Public|BlueprintCallable) // @ game+0x1254030
	void AuthorityApplyEffect(struct UTigerCharacterEffect* Effect); // Function Tiger.TigerCharacter.AuthorityApplyEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x1253fa0
};

// Class Tiger.TigerBaseNPC
// Size: 0x9a0 (Inherited: 0x780)
struct ATigerBaseNPC : ATigerCharacter {
	char pad_780[0x10]; // 0x780(0x10)
	struct UTigerHSensesTargetComponent* HeightenedSensesTargetComponent; // 0x790(0x08)
	struct UTigerNPCAsset* NPCAsset; // 0x798(0x08)
	struct UTigerBloodPotencyComponent* BloodPotencyComponent; // 0x7a0(0x08)
	struct UTigerNPCVisualAsset* VisualAsset; // 0x7a8(0x08)
	struct UTigerNpcPropAsset* PropAsset; // 0x7b0(0x08)
	struct UTigerMasqueradeActionResponse* MasqueradeActionResponse; // 0x7b8(0x08)
	struct UTigerNPCFacePoseMap* HeadMeshsPoseAssetsClass; // 0x7c0(0x08)
	enum class ETigerNPCType NPCType; // 0x7c8(0x01)
	char pad_7C9[0x7]; // 0x7c9(0x07)
	struct UTigerInteractiveNpcComponent* InteractiveNpcComponent; // 0x7d0(0x08)
	struct FTigerMeshCollection ReplicatedMeshCollection; // 0x7d8(0xf0)
	struct UObject* ReplicatedAnimationInstanceClass; // 0x8c8(0x08)
	struct ATigerAISplinePath* ActiveSplinePath; // 0x8d0(0x08)
	struct ATigerNPCSpawningBase* Spawner; // 0x8d8(0x08)
	struct USkeletalMeshComponent* HeightenedSensesHeartMesh; // 0x8e0(0x08)
	struct USkeletalMeshComponent* InWorldHeartMesh; // 0x8e8(0x08)
	float LastTimeReactingToLocalPlayerAction; // 0x8f0(0x04)
	int32_t LastPlayedVoEventId; // 0x8f4(0x04)
	bool bHasSightOfLocalPlayer; // 0x8f8(0x01)
	char pad_8F9[0x7]; // 0x8f9(0x07)
	enum class ETigerBloodType BloodType; // 0x900(0x01)
	enum class ETigerBloodPotency BloodPotency; // 0x901(0x01)
	char pad_902[0x6]; // 0x902(0x06)
	struct TArray<struct ATigerAISplinePath*> StoredSplines; // 0x908(0x10)
	struct ATigerWorldCompositionGrid* StreamingGrid; // 0x918(0x08)
	char pad_920[0x80]; // 0x920(0x80)

	void QueueVoEvent(struct FName InVoCategory, bool bInShouldMulticast); // Function Tiger.TigerBaseNPC.QueueVoEvent // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x123e020
	void PickHeartMeshes(); // Function Tiger.TigerBaseNPC.PickHeartMeshes // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
	void OverrideBloodPotency(enum class ETigerBloodPotency InNewBloodPotency); // Function Tiger.TigerBaseNPC.OverrideBloodPotency // (Final|Native|Public|BlueprintCallable) // @ game+0x123d7d0
	void OnStoppedBeingClosestNpcWithPotencyInHeightenedSenses(); // Function Tiger.TigerBaseNPC.OnStoppedBeingClosestNpcWithPotencyInHeightenedSenses // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void OnSawLocalPlayerBreachMasquerade(); // Function Tiger.TigerBaseNPC.OnSawLocalPlayerBreachMasquerade // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void OnRep_ReplicatedAnimationInstanceClassChanged(); // Function Tiger.TigerBaseNPC.OnRep_ReplicatedAnimationInstanceClassChanged // (Final|Native|Protected) // @ game+0x123e000
	void OnRep_BloodType(); // Function Tiger.TigerBaseNPC.OnRep_BloodType // (Final|Native|Protected) // @ game+0x123dfe0
	void OnRep_BloodPotency(); // Function Tiger.TigerBaseNPC.OnRep_BloodPotency // (Final|Native|Protected) // @ game+0x123dfc0
	void OnRep_AdditionalMeshCollectionChanged(); // Function Tiger.TigerBaseNPC.OnRep_AdditionalMeshCollectionChanged // (Final|Native|Protected) // @ game+0x123dfa0
	void OnLostSightOfLocalPlayer(struct ATigerPlayer* InPlayer); // Function Tiger.TigerBaseNPC.OnLostSightOfLocalPlayer // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void OnGainedSightOfLocalPlayer(struct ATigerPlayer* InPlayer); // Function Tiger.TigerBaseNPC.OnGainedSightOfLocalPlayer // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void OnBloodTypeChanged(enum class ETigerBloodType InBloodType); // Function Tiger.TigerBaseNPC.OnBloodTypeChanged // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void OnBloodPotencyChanged(enum class ETigerBloodPotency InBloodPotency); // Function Tiger.TigerBaseNPC.OnBloodPotencyChanged // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void OnBecameClosestNpcWithPotencyInHeightenedSenses(); // Function Tiger.TigerBaseNPC.OnBecameClosestNpcWithPotencyInHeightenedSenses // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void Multicast_VerifySimulationLocation(struct FVector InAuthorityLocation); // Function Tiger.TigerBaseNPC.Multicast_VerifySimulationLocation // (Final|Net|NetReliableNative|Event|NetMulticast|Private|HasDefaults) // @ game+0x123ddf0
	void Multicast_QueueVoEvent(int8_t InVoCategoryIndex); // Function Tiger.TigerBaseNPC.Multicast_QueueVoEvent // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x123dd70
	void Multicast_ChangeBlood(enum class ETigerBloodPotency InNewBloodPotency, enum class ETigerBloodType InNewBloodType); // Function Tiger.TigerBaseNPC.Multicast_ChangeBlood // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x123dca0
	struct ATigerAiBaseController* GetTigerAiBaseController(); // Function Tiger.TigerBaseNPC.GetTigerAiBaseController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x123dbd0
	enum class ETigerBloodType GetBloodType(); // Function Tiger.TigerBaseNPC.GetBloodType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x123da00
	enum class ETigerBloodPotency GetBloodPotency(); // Function Tiger.TigerBaseNPC.GetBloodPotency // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x123d9e0
	void DeactivateHeightenedSensesVisualization(); // Function Tiger.TigerBaseNPC.DeactivateHeightenedSensesVisualization // (Final|Native|Protected|BlueprintCallable) // @ game+0x123d8d0
	void AuthoritySetBloodType(enum class ETigerBloodType InBloodType); // Function Tiger.TigerBaseNPC.AuthoritySetBloodType // (Final|Native|Public|BlueprintCallable) // @ game+0x123d850
	void AuthoritySetBloodPotency(enum class ETigerBloodPotency InNewBloodPotency); // Function Tiger.TigerBaseNPC.AuthoritySetBloodPotency // (Final|Native|Public|BlueprintCallable) // @ game+0x123d7d0
	void AuthoritySetBlood(enum class ETigerBloodPotency InNewBloodPotency, enum class ETigerBloodType InNewBloodType); // Function Tiger.TigerBaseNPC.AuthoritySetBlood // (Final|Native|Public|BlueprintCallable) // @ game+0x123d700
	void ActivateHeightenedSensesVisualization(); // Function Tiger.TigerBaseNPC.ActivateHeightenedSensesVisualization // (Final|Native|Protected|BlueprintCallable) // @ game+0x123d6e0
};

// Class Tiger.TigerBaseThrallData
// Size: 0xc8 (Inherited: 0x30)
struct UTigerBaseThrallData : UDataAsset {
	enum class ETigerThrallId ThrallId; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct FText ThrallName; // 0x38(0x18)
	struct FText ThrallDescription; // 0x50(0x18)
	struct FText ThrallHintText; // 0x68(0x18)
	struct TArray<struct UTexture2D*> ThrallPortraits; // 0x80(0x10)
	struct FText ThrallKeepsakeName; // 0x90(0x18)
	struct UTexture2D* ThrallKeepsakePortrait; // 0xa8(0x08)
	struct FTigerThrallStats StartingStats; // 0xb0(0x10)
	struct UTigerGrimoireEntry* GrimoireEntry; // 0xc0(0x08)
};

// Class Tiger.TigerBattlepassUI
// Size: 0x3e0 (Inherited: 0x3b0)
struct UTigerBattlepassUI : UTigerSceneBackgroundUI {
	int32_t MaxPageItems; // 0x3b0(0x04)
	char pad_3B4[0x4]; // 0x3b4(0x04)
	struct TArray<int32_t> PageSizes; // 0x3b8(0x10)
	int32_t CurrentPageIndex; // 0x3c8(0x04)
	char pad_3CC[0x4]; // 0x3cc(0x04)
	struct TArray<struct UTigerClientSeasonalRewardTier*> RewardTiers; // 0x3d0(0x10)

	void GetPageItemIndices(int32_t PageIndex, int32_t FirstItemIndex, int32_t LastItemIndex); // Function Tiger.TigerBattlepassUI.GetPageItemIndices // (Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x123da20
};

// Class Tiger.TigerBelowBalconyEntryTrigger
// Size: 0x268 (Inherited: 0x260)
struct ATigerBelowBalconyEntryTrigger : ATriggerVolume {
	struct FName EnterBalconyFromBelowAnimName; // 0x260(0x08)
};

// Class Tiger.TigerBlindingBeautyEffectActor
// Size: 0x238 (Inherited: 0x228)
struct ATigerBlindingBeautyEffectActor : AActor {
	struct ATigerPlayer* Player; // 0x228(0x08)
	float TriggerTime; // 0x230(0x04)
	char pad_234[0x4]; // 0x234(0x04)

	void OnDashExit(bool bInShouldTrigger); // Function Tiger.TigerBlindingBeautyEffectActor.OnDashExit // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void OnDashEnter(); // Function Tiger.TigerBlindingBeautyEffectActor.OnDashEnter // (Event|Public|BlueprintEvent) // @ game+0x16c0340
};

// Class Tiger.TigerBloodDecalTrail
// Size: 0x230 (Inherited: 0x228)
struct ATigerBloodDecalTrail : AActor {
	char pad_228[0x8]; // 0x228(0x08)
};

// Class Tiger.TigerBloodPotencyVisualizationConfig
// Size: 0x80 (Inherited: 0x30)
struct UTigerBloodPotencyVisualizationConfig : UDataAsset {
	struct TArray<struct UMaterialInstance*> HeartMeshMaterialTarget; // 0x30(0x10)
	struct TSoftObjectPtr<struct UNiagaraSystem> NiagaraPath; // 0x40(0x28)
	struct UParticleSystem* ParticleSystem; // 0x68(0x08)
	struct FName ParticleSystemAttachmentSocket; // 0x70(0x08)
	bool bParticleSystemAbsoluteRotation; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
};

// Class Tiger.TigerBloodPotencyComponent
// Size: 0x220 (Inherited: 0xb0)
struct UTigerBloodPotencyComponent : UActorComponent {
	float BloodTypeWeights[0x4]; // 0xb0(0x10)
	bool bEnableBloodTypeEffects; // 0xc0(0x01)
	char pad_C1[0x7]; // 0xc1(0x07)
	struct UTigerBloodPotencyVisualizationConfig* CurrentHeightenedSensesConfig; // 0xc8(0x08)
	struct UTigerBloodPotencyVisualizationConfig* CurrentInWorldConfig; // 0xd0(0x08)
	struct UTigerBloodPotencyVisualizationConfig* HeightenedSensesVisualConfiguration[0x4]; // 0xd8(0x20)
	struct UTigerBloodPotencyVisualizationConfig* HeightenedSensesVisualConfigurationByBloodType[0x4]; // 0xf8(0x20)
	struct UTigerBloodPotencyVisualizationConfig* InWorldVisualConfiguration[0x4]; // 0x118(0x20)
	struct UTigerBloodPotencyVisualizationConfig* InWorldVisualConfigurationByBloodType[0x4]; // 0x138(0x20)
	struct FName HeartMeshMaximumVisibilityDistanceName; // 0x158(0x08)
	struct TArray<struct UMaterialInstance*> HsMeshPreviousMaterials; // 0x160(0x10)
	struct TArray<struct UMaterialInstance*> HsMeshTargetMaterials; // 0x170(0x10)
	struct TArray<struct UMaterialInstanceDynamic*> HsMeshCurrentMaterials; // 0x180(0x10)
	struct USkeletalMeshComponent* HsSkeletalMeshComponent; // 0x190(0x08)
	struct UParticleSystemComponent* HsParticleSystemComponent; // 0x198(0x08)
	struct UNiagaraComponent* HsNiagaraComponent; // 0x1a0(0x08)
	struct TArray<struct UMaterialInstance*> InWorldMeshPreviousMaterials; // 0x1a8(0x10)
	struct TArray<struct UMaterialInstance*> InWorldMeshTargetMaterials; // 0x1b8(0x10)
	struct TArray<struct UMaterialInstanceDynamic*> InWorldMeshCurrentMaterials; // 0x1c8(0x10)
	struct USkeletalMeshComponent* InWorldSkeletalMeshComponent; // 0x1d8(0x08)
	struct UParticleSystemComponent* InWorldParticleSystemComponent; // 0x1e0(0x08)
	struct UNiagaraComponent* InWorldNiagaraComponent; // 0x1e8(0x08)
	struct ATigerBaseNPC* NpcOwner; // 0x1f0(0x08)
	char pad_1F8[0x10]; // 0x1f8(0x10)
	float MaterialInterpolationDuration; // 0x208(0x04)
	char pad_20C[0x14]; // 0x20c(0x14)

	void RefreshBloodPotencyVisualization(bool bInForceRefresh); // Function Tiger.TigerBloodPotencyComponent.RefreshBloodPotencyVisualization // (Final|Native|Public|BlueprintCallable) // @ game+0x123e100
};

// Class Tiger.TigerBloodResonanceAsset
// Size: 0x1f8 (Inherited: 0x30)
struct UTigerBloodResonanceAsset : UDataAsset {
	struct FText ResonanceName; // 0x30(0x18)
	struct FText InventoryLevel1Description; // 0x48(0x18)
	struct FText InventoryLevel2Description; // 0x60(0x18)
	struct FText InventoryLevel3Description; // 0x78(0x18)
	struct FText FeedRewardLevel1Description; // 0x90(0x18)
	struct FText FeedRewardLevel2Description; // 0xa8(0x18)
	struct FText FeedRewardLevel3Description; // 0xc0(0x18)
	struct FColor ResonanceColor; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)
	struct TSoftObjectPtr<struct UTexture2D> ResonanceLevel1; // 0xe0(0x28)
	struct TSoftObjectPtr<struct UTexture2D> ResonanceLevel2; // 0x108(0x28)
	struct TSoftObjectPtr<struct UTexture2D> ResonanceLevel3; // 0x130(0x28)
	struct TSoftObjectPtr<struct UTexture2D> SlotLevel1; // 0x158(0x28)
	struct TSoftObjectPtr<struct UTexture2D> SlotLevel2; // 0x180(0x28)
	struct TSoftObjectPtr<struct UTexture2D> SlotLevel3; // 0x1a8(0x28)
	struct TSoftObjectPtr<struct UMaterial> ResonanceVfx; // 0x1d0(0x28)
};

// Class Tiger.TigerBloodResonanceComponent
// Size: 0x1f0 (Inherited: 0xb0)
struct UTigerBloodResonanceComponent : UActorComponent {
	struct FMulticastInlineDelegate OnBloodResonanceBlockedByCap; // 0xb0(0x10)
	float BloodCapIncreasePerEvent[0x1d]; // 0xc0(0x74)
	char pad_134[0x4]; // 0x134(0x04)
	struct FTigerBloodResonanceBuffs BloodResonanceBuffs[0x4]; // 0x138(0x40)
	int32_t StartingBloodCap; // 0x178(0x04)
	int32_t BloodTypeCap; // 0x17c(0x04)
	int32_t MaxBloodCap; // 0x180(0x04)
	int32_t CurrentBloodCap; // 0x184(0x04)
	struct FMulticastInlineDelegate OnBloodCapChanged; // 0x188(0x10)
	struct FMulticastInlineDelegate OnBloodResonanceAdded; // 0x198(0x10)
	char pad_1A8[0x48]; // 0x1a8(0x48)

	void OnPlayerEvent(enum class ETigerPlayerEvent InEvent, struct ATigerCharacter* InEventTiedCharacter); // Function Tiger.TigerBloodResonanceComponent.OnPlayerEvent // (Final|Native|Private) // @ game+0x1242410
	void OnLifeStatusChanged(enum class ETigerPlayerLifeStatus InNewLifeStatus); // Function Tiger.TigerBloodResonanceComponent.OnLifeStatusChanged // (Final|Native|Private) // @ game+0x12422c0
	int32_t GetTotalBloodResonanceNum(); // Function Tiger.TigerBloodResonanceComponent.GetTotalBloodResonanceNum // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1241fb0
	int32_t GetMaxBloodCap(); // Function Tiger.TigerBloodResonanceComponent.GetMaxBloodCap // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1241f00
	int32_t GetCurrentBloodResonanceOfType(enum class ETigerBloodType InBloodType); // Function Tiger.TigerBloodResonanceComponent.GetCurrentBloodResonanceOfType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1241d40
	struct TArray<enum class ETigerBloodType> GetCurrentBloodResonance(); // Function Tiger.TigerBloodResonanceComponent.GetCurrentBloodResonance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1241cb0
	int32_t GetCurrentBloodCap(); // Function Tiger.TigerBloodResonanceComponent.GetCurrentBloodCap // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1241c90
	void Client_IncreaseBloodCap(float InBloodCapIncrease); // Function Tiger.TigerBloodResonanceComponent.Client_IncreaseBloodCap // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x1241bc0
	void Client_AddBloodResonance(enum class ETigerBloodType InBloodType); // Function Tiger.TigerBloodResonanceComponent.Client_AddBloodResonance // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x1241b40
};

// Class Tiger.TigerPassiveConfig
// Size: 0x138 (Inherited: 0x30)
struct UTigerPassiveConfig : UDataAsset {
	struct FText Name; // 0x30(0x18)
	struct FText Description; // 0x48(0x18)
	struct UTexture2D* Icon; // 0x60(0x08)
	struct UMediaSource* PreviewVideo; // 0x68(0x08)
	struct UTigerWidget* CustomWidget; // 0x70(0x08)
	struct UTigerPassiveComponent* LogicComponent; // 0x78(0x08)
	struct FTigerCharacterStatModification PassiveStatChanges; // 0x80(0xb4)
	char PowerIncrease; // 0x134(0x01)
	char pad_135[0x3]; // 0x135(0x03)
};

// Class Tiger.TigerBloodTrackPassiveConfig
// Size: 0x140 (Inherited: 0x138)
struct UTigerBloodTrackPassiveConfig : UTigerPassiveConfig {
	enum class ETigerBloodTrackPassiveCategory Category; // 0x138(0x01)
	bool bCanBeMoved; // 0x139(0x01)
	char pad_13A[0x6]; // 0x13a(0x06)
};

// Class Tiger.TigerBloodTrackPreset
// Size: 0x40 (Inherited: 0x30)
struct UTigerBloodTrackPreset : UDataAsset {
	struct FTigerBloodTrack BloodTrack; // 0x30(0x10)

	bool VerifyCustomization(struct FTigerBloodTrack Customization, struct UTigerPowerKit* PowerKit); // Function Tiger.TigerBloodTrackPreset.VerifyCustomization // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1242890
	struct TArray<int32_t> CalculateBloodTrackSlotMovement(struct TArray<struct UTigerBloodTrackPassiveConfig*> BloodTrackToModify, int32_t IndexToMove, int32_t IndexToMoveTo); // Function Tiger.TigerBloodTrackPreset.CalculateBloodTrackSlotMovement // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x12419a0
};

// Class Tiger.TigerBloodTrackPassiveList
// Size: 0x40 (Inherited: 0x30)
struct UTigerBloodTrackPassiveList : UDataAsset {
	struct TArray<struct UTigerBloodTrackPassiveConfig*> PassivesAvailableToAll; // 0x30(0x10)
};

// Class Tiger.TigerBloodTrackHealthUpgradePassiveConfig
// Size: 0x140 (Inherited: 0x140)
struct UTigerBloodTrackHealthUpgradePassiveConfig : UTigerBloodTrackPassiveConfig {
};

// Class Tiger.TigerBloodTrackPassiveUltimatePredatorConfig
// Size: 0x140 (Inherited: 0x140)
struct UTigerBloodTrackPassiveUltimatePredatorConfig : UTigerBloodTrackPassiveConfig {
};

// Class Tiger.TigerBloodTrackPassiveUnlockPowersConfig
// Size: 0x140 (Inherited: 0x140)
struct UTigerBloodTrackPassiveUnlockPowersConfig : UTigerBloodTrackPassiveConfig {
};

// Class Tiger.TigerBloodVein
// Size: 0x278 (Inherited: 0x228)
struct ATigerBloodVein : AActor {
	struct FMulticastInlineDelegate OnEndOfVeinReached; // 0x228(0x10)
	struct USplineComponent* Spline; // 0x238(0x08)
	struct USceneComponent* CurrentPlayerSpot; // 0x240(0x08)
	float EarliestDisconnectPoint; // 0x248(0x04)
	float LatestDisconnectPoint; // 0x24c(0x04)
	float VeinMovementSpeed; // 0x250(0x04)
	bool bIsVeinActive; // 0x254(0x01)
	char pad_255[0x3]; // 0x255(0x03)
	struct ATigerHolyIncense* HolyIncense; // 0x258(0x08)
	char pad_260[0xc]; // 0x260(0x0c)
	float StartSynchronizedTime; // 0x26c(0x04)
	char pad_270[0x8]; // 0x270(0x08)

	void TigerOnEndOfVeinReached__DelegateSignature(); // DelegateFunction Tiger.TigerBloodVein.TigerOnEndOfVeinReached__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x16c0340
	void OnVeinActivated(); // Function Tiger.TigerBloodVein.OnVeinActivated // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void OnRep_IsVeinActive(); // Function Tiger.TigerBloodVein.OnRep_IsVeinActive // (Final|Native|Private) // @ game+0x1242520
	void Multicast_StartMovement(float ServerTime); // Function Tiger.TigerBloodVein.Multicast_StartMovement // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x1242230
	void MatchStateChanged(enum class ETigerMatchState OldMatchState, enum class ETigerMatchState NewMatchState); // Function Tiger.TigerBloodVein.MatchStateChanged // (Final|Native|Private) // @ game+0x12420e0
	struct FVector GetCurrentPlayerLocation(); // Function Tiger.TigerBloodVein.GetCurrentPlayerLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1241e10
	struct FVector GetCurrentPlayerDirection(); // Function Tiger.TigerBloodVein.GetCurrentPlayerDirection // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1241dd0
};

// Class Tiger.TigerBloodVeinBranch
// Size: 0x288 (Inherited: 0x228)
struct ATigerBloodVeinBranch : AActor {
	struct FMulticastInlineDelegate OnReachedEndOfBloodVeinBranch; // 0x228(0x10)
	struct UStaticMesh* VeinSplineMesh; // 0x238(0x08)
	struct ATigerBloodVeinPawn* ControllingPawn; // 0x240(0x08)
	struct USceneComponent* CurrentPlayerSpot; // 0x248(0x08)
	float LandSoundEventTimeOffset; // 0x250(0x04)
	float SplineMeshDistance; // 0x254(0x04)
	float SplineScale; // 0x258(0x04)
	char pad_25C[0x4]; // 0x25c(0x04)
	struct TArray<struct USplineMeshComponent*> GeneratedSplineMeshes; // 0x260(0x10)
	struct UTigerBloodVeinBranchMovementComponent* MovementComponent; // 0x270(0x08)
	char pad_278[0x10]; // 0x278(0x10)

	void TigerDelegateReachedEndOfBloodVeinBranch__DelegateSignature(); // DelegateFunction Tiger.TigerBloodVeinBranch.TigerDelegateReachedEndOfBloodVeinBranch__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x16c0340
	void PostLandingSoundEvent(); // Function Tiger.TigerBloodVeinBranch.PostLandingSoundEvent // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	bool IsLocalPlayerInThisBranch(); // Function Tiger.TigerBloodVeinBranch.IsLocalPlayerInThisBranch // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1242070
	void HitGround(); // Function Tiger.TigerBloodVeinBranch.HitGround // (Final|Native|Private) // @ game+0x1242030
	void HideGeneratedMeshes(); // Function Tiger.TigerBloodVeinBranch.HideGeneratedMeshes // (Final|Native|Protected|BlueprintCallable) // @ game+0x1242010
	struct TArray<struct USplineMeshComponent*> GetGeneratedSplineMeshes(); // Function Tiger.TigerBloodVeinBranch.GetGeneratedSplineMeshes // (Final|Native|Protected|BlueprintCallable) // @ game+0x1241e50
};

// Class Tiger.TigerBloodVeinBranchMovementComponent
// Size: 0x170 (Inherited: 0xb0)
struct UTigerBloodVeinBranchMovementComponent : UActorComponent {
	char pad_B0[0x10]; // 0xb0(0x10)
	struct ACharacter* PlayerPawn; // 0xc0(0x08)
	struct ATigerGameState* GameState; // 0xc8(0x08)
	struct TArray<struct FVector> MovementTargets; // 0xd0(0x10)
	float StartSimulationTime; // 0xe0(0x04)
	bool bHitGround; // 0xe4(0x01)
	char pad_E5[0x3]; // 0xe5(0x03)
	float SecondsPerStep; // 0xe8(0x04)
	struct FTigerBloodVeinBranchMovementSettings PrimaryMovementSettings; // 0xec(0x24)
	struct FTigerBloodVeinBranchMovementSettings SecondaryMovementSettings; // 0x110(0x24)
	char pad_134[0xc]; // 0x134(0x0c)
	struct ATigerBloodVeinBranch* Branch; // 0x140(0x08)
	struct ATigerHolyIncense* HolyIncense; // 0x148(0x08)
	char pad_150[0x20]; // 0x150(0x20)

	void TigerDelegateBloodVeinBranchHitGround__DelegateSignature(); // DelegateFunction Tiger.TigerBloodVeinBranchMovementComponent.TigerDelegateBloodVeinBranchHitGround__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x16c0340
	void Multicast_AddBranchPoint(struct FVector InNewTarget); // Function Tiger.TigerBloodVeinBranchMovementComponent.Multicast_AddBranchPoint // (Final|Net|NetReliableNative|Event|NetMulticast|Private|HasDefaults) // @ game+0x12421b0
	void HitGround(); // Function Tiger.TigerBloodVeinBranchMovementComponent.HitGround // (Final|Native|Private) // @ game+0x1242050
};

// Class Tiger.TigerBloodVeinPawn
// Size: 0x2f8 (Inherited: 0x288)
struct ATigerBloodVeinPawn : APawn {
	struct FMulticastInlineDelegate OnIsCoterieNavigatorChanged; // 0x288(0x10)
	struct ATigerBloodVein* BloodVein; // 0x298(0x08)
	bool bIsCoterieNavigator; // 0x2a0(0x01)
	bool bWantsToLaunchSolo; // 0x2a1(0x01)
	char pad_2A2[0x6]; // 0x2a2(0x06)
	struct UStaticMeshComponent* StaticMesh; // 0x2a8(0x08)
	struct UTigerSpringArmComponent* SpringArm; // 0x2b0(0x08)
	struct UCameraComponent* Camera; // 0x2b8(0x08)
	enum class ETigerBloodVeinAlternateAction AlternateAction; // 0x2c0(0x01)
	char pad_2C1[0x17]; // 0x2c1(0x17)
	struct ATigerBloodVeinBranch* BranchClass; // 0x2d8(0x08)
	float AlternateActionHoldTime; // 0x2e0(0x04)
	char pad_2E4[0x14]; // 0x2e4(0x14)

	void SpawnPlayer(); // Function Tiger.TigerBloodVeinPawn.SpawnPlayer // (Final|Native|Private) // @ game+0x1242870
	void Server_SetLaunchSolo(bool bInWantsToLaunchSolo); // Function Tiger.TigerBloodVeinPawn.Server_SetLaunchSolo // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x12427b0
	void Server_SendInputData(char InPackedInputVector, char InCompressedCameraYaw, char InCompressedCameraPitch); // Function Tiger.TigerBloodVeinPawn.Server_SendInputData // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1242660
	void Server_PassCoterieNavigator(); // Function Tiger.TigerBloodVeinPawn.Server_PassCoterieNavigator // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x1242610
	void Server_LaunchBranch(struct FRotator InCameraRotation); // Function Tiger.TigerBloodVeinPawn.Server_LaunchBranch // (Final|Net|NetReliableNative|Event|Private|NetServer|HasDefaults|NetValidate) // @ game+0x1242540
	void OnRep_IsCoterieNavigator(); // Function Tiger.TigerBloodVeinPawn.OnRep_IsCoterieNavigator // (Final|Native|Private) // @ game+0x1242500
	void OnRep_BloodVein(); // Function Tiger.TigerBloodVeinPawn.OnRep_BloodVein // (Final|Native|Private) // @ game+0x12424e0
	void OnMatchStateChanged(enum class ETigerMatchState InOldState, enum class ETigerMatchState InNewState); // Function Tiger.TigerBloodVeinPawn.OnMatchStateChanged // (Final|Native|Private) // @ game+0x1242340
	void OnIsCoterieNavigatorChanged__DelegateSignature(bool bInIsCoterieNavigator); // DelegateFunction Tiger.TigerBloodVeinPawn.OnIsCoterieNavigatorChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x16c0340
	void OnConnectedToMainVein(); // Function Tiger.TigerBloodVeinPawn.OnConnectedToMainVein // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void OnBranchedOffFromMainVein(); // Function Tiger.TigerBloodVeinPawn.OnBranchedOffFromMainVein // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	bool IsNavigatingBranch(); // Function Tiger.TigerBloodVeinPawn.IsNavigatingBranch // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12420a0
	bool HasBranchedOff(); // Function Tiger.TigerBloodVeinPawn.HasBranchedOff // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1241fe0
	void EndOfVeinReached(); // Function Tiger.TigerBloodVeinPawn.EndOfVeinReached // (Final|Native|Private) // @ game+0x1241c70
	void Client_OnDetachedFromMainVein(); // Function Tiger.TigerBloodVeinPawn.Client_OnDetachedFromMainVein // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x1241c50
	bool CanDoSecondaryLaunch(); // Function Tiger.TigerBloodVeinPawn.CanDoSecondaryLaunch // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1241b10
};

// Class Tiger.TigerBloodVeinTooltipLocation
// Size: 0x230 (Inherited: 0x228)
struct ATigerBloodVeinTooltipLocation : AActor {
	float MaximumDistance; // 0x228(0x04)
	bool bIsVisible; // 0x22c(0x01)
	char pad_22D[0x3]; // 0x22d(0x03)

	void OnVisiblityChanged(); // Function Tiger.TigerBloodVeinTooltipLocation.OnVisiblityChanged // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
};

// Class Tiger.TigerBloodVeinTrackWidget
// Size: 0x280 (Inherited: 0x280)
struct UTigerBloodVeinTrackWidget : UTigerWidget {
};

// Class Tiger.TigerBlueprintLootComponent
// Size: 0xc8 (Inherited: 0xb0)
struct UTigerBlueprintLootComponent : UActorComponent {
	struct UTigerItemLootTable* LootTable; // 0xb0(0x08)
	struct TArray<struct AActor*> SpawnedItemActors; // 0xb8(0x10)

	struct TArray<struct AActor*> GetSpawnedItemActors(); // Function Tiger.TigerBlueprintLootComponent.GetSpawnedItemActors // (Final|Native|Public|Const) // @ game+0x1241f20
	struct UTigerItemLootTable* GetLootTable(); // Function Tiger.TigerBlueprintLootComponent.GetLootTable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1241ee0
};

// Class Tiger.TigerBlueprintLootLocationComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UTigerBlueprintLootLocationComponent : UActorComponent {
	struct UTigerLootLocationConfiguration* Configuration; // 0xb0(0x08)
	char GameTypeFilter; // 0xb8(0x01)
	char pad_B9[0x7]; // 0xb9(0x07)
};

// Class Tiger.TigerBootGameMode
// Size: 0x2e0 (Inherited: 0x2c8)
struct ATigerBootGameMode : AGameModeBase {
	enum class ESessionType SessionTraveledFrom; // 0x2c8(0x01)
	char pad_2C9[0x7]; // 0x2c9(0x07)
	struct UTigerGameFlowStateMap* GameFlowStateMap; // 0x2d0(0x08)
	struct UTigerGameFlowStateMap* BotGameFlowStateMap; // 0x2d8(0x08)
};

// Class Tiger.TigerBrujahBaneRecklessness
// Size: 0x140 (Inherited: 0x138)
struct UTigerBrujahBaneRecklessness : UTigerPassiveConfig {
	float DamageTakenMultiplier; // 0x138(0x04)
	float AutoDeactivateTimer; // 0x13c(0x04)
};

// Class Tiger.TigerPassiveComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UTigerPassiveComponent : UActorComponent {
	struct ATigerPlayer* PlayerOwner; // 0xb0(0x08)
	struct UTigerWidget* PassiveWidget; // 0xb8(0x08)

	void SetPassiveWidget(struct UTigerWidget* InWidget); // Function Tiger.TigerPassiveComponent.SetPassiveWidget // (Final|Native|Public|BlueprintCallable) // @ game+0x12e6190
	void OnCreated(struct ATigerPlayer* InPlayer, bool InHasAuthority); // Function Tiger.TigerPassiveComponent.OnCreated // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	bool IsPassiveActive(); // Function Tiger.TigerPassiveComponent.IsPassiveActive // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x12e5f70
	struct UTigerWidget* GetPassiveWidget(); // Function Tiger.TigerPassiveComponent.GetPassiveWidget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12e5c90
};

// Class Tiger.TigerBrujahBaneRecklessnessLogic
// Size: 0x190 (Inherited: 0xc0)
struct UTigerBrujahBaneRecklessnessLogic : UTigerPassiveComponent {
	struct UTigerBrujahBaneRecklessness* Config; // 0xc0(0x08)
	struct ATigerPlayer* Player; // 0xc8(0x08)
	char pad_D0[0xc0]; // 0xd0(0xc0)
};

// Class Tiger.TigerBrujahTraitMomentum
// Size: 0x158 (Inherited: 0x138)
struct UTigerBrujahTraitMomentum : UTigerPassiveConfig {
	float MomentumActiveTimer; // 0x138(0x04)
	float GroundSlamRadiusMultiplier; // 0x13c(0x04)
	float MightyLeapVelocityMultiplier; // 0x140(0x04)
	float FOTTKnockbackDistanceMultiplier; // 0x144(0x04)
	float FOTTWallImpactDamageMultiplier; // 0x148(0x04)
	char pad_14C[0x4]; // 0x14c(0x04)
	struct UAkAudioEvent* MomentumStartedAudioEvent; // 0x150(0x08)
};

// Class Tiger.TigerBrujahTraitMomentumLogic
// Size: 0xe0 (Inherited: 0xc0)
struct UTigerBrujahTraitMomentumLogic : UTigerPassiveComponent {
	struct UTigerBrujahTraitMomentum* Config; // 0xc0(0x08)
	struct ATigerPlayer* Player; // 0xc8(0x08)
	char pad_D0[0x10]; // 0xd0(0x10)

	bool IsMomentumActive(); // Function Tiger.TigerBrujahTraitMomentumLogic.IsMomentumActive // (Final|Native|Public|BlueprintCallable) // @ game+0x1247080
};

// Class Tiger.TigerBuffInstance
// Size: 0x88 (Inherited: 0x28)
struct UTigerBuffInstance : UObject {
	struct FTigerBuffReplicatedInstanceData BuffReplicatedInstanceData; // 0x28(0x20)
	struct TWeakObjectPtr<struct ATigerCharacter> OwnerCharacter; // 0x48(0x08)
	struct UTigerBuff* Buff; // 0x50(0x08)
	char pad_58[0x10]; // 0x58(0x10)
	struct UParticleSystemComponent* ActiveBuffParticles; // 0x68(0x08)
	struct UNiagaraComponent* ActiveNiagaraParticles; // 0x70(0x08)
	struct TArray<struct UNiagaraComponent*> AdditionalActiveNiagaraParticles; // 0x78(0x10)

	struct ATigerCharacter* GetOwningCharacter(); // Function Tiger.TigerBuffInstance.GetOwningCharacter // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1246f10
	struct UNiagaraComponent* GetActiveNiagaraParticles(); // Function Tiger.TigerBuffInstance.GetActiveNiagaraParticles // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1246ef0
	struct UParticleSystemComponent* GetActiveBuffParticles(); // Function Tiger.TigerBuffInstance.GetActiveBuffParticles // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1246ed0
};

// Class Tiger.TigerBuffAdrenalineRushInstance
// Size: 0x88 (Inherited: 0x88)
struct UTigerBuffAdrenalineRushInstance : UTigerBuffInstance {
};

// Class Tiger.TigerBuffAdrenalineRush
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffAdrenalineRush : UTigerBuff {
};

// Class Tiger.TigerBuffAnarchHuntingKnife
// Size: 0x290 (Inherited: 0x270)
struct UTigerBuffAnarchHuntingKnife : UTigerBuff {
	struct UCurveFloat* EffectStrengthBasedOnDistance; // 0x270(0x08)
	struct UCurveFloat* EffectStrengthBasedOnKills; // 0x278(0x08)
	struct UCurveFloat* DamageBasedOnEnemiesKilled; // 0x280(0x08)
	float MaxDistanceToCheckForEnemies; // 0x288(0x04)
	char pad_28C[0x4]; // 0x28c(0x04)
};

// Class Tiger.TigerBuffAnarchHuntingKnifeInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffAnarchHuntingKnifeInstance : UTigerBuffInstance {
	struct UTigerBuffAnarchHuntingKnife* HuntingKnifeBuff; // 0x88(0x08)
	struct ATigerPlayer* Player; // 0x90(0x08)
};

// Class Tiger.TigerBuffAnarchHuntingKnifeStack
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffAnarchHuntingKnifeStack : UTigerBuff {
};

// Class Tiger.TigerBuffAnarchHuntingKnifeStackInstance
// Size: 0x90 (Inherited: 0x88)
struct UTigerBuffAnarchHuntingKnifeStackInstance : UTigerBuffInstance {
	struct ATigerPlayer* Player; // 0x88(0x08)
};

// Class Tiger.TigerBuffArtifactFeedingBonus
// Size: 0x278 (Inherited: 0x270)
struct UTigerBuffArtifactFeedingBonus : UTigerBuff {
	float FeedBonusHealthMultiplier; // 0x270(0x04)
	char pad_274[0x4]; // 0x274(0x04)
};

// Class Tiger.TigerBuffArtifactFeedingBonusInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffArtifactFeedingBonusInstance : UTigerBuffInstance {
	struct UTigerBuffArtifactFeedingBonus* ArtifactFeedingBonusBuff; // 0x88(0x08)
	struct ATigerPlayer* Player; // 0x90(0x08)
};

// Class Tiger.TigerBuffHealthRegenBase
// Size: 0x278 (Inherited: 0x270)
struct UTigerBuffHealthRegenBase : UTigerBuff {
	float HealthToHeal; // 0x270(0x04)
	char pad_274[0x4]; // 0x274(0x04)
};

// Class Tiger.TigerBuffArtifactHealthRegen
// Size: 0x278 (Inherited: 0x278)
struct UTigerBuffArtifactHealthRegen : UTigerBuffHealthRegenBase {
};

// Class Tiger.TigerBuffHealthRegenBaseInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffHealthRegenBaseInstance : UTigerBuffInstance {
	struct UTigerBuffHealthRegenBase* HealthRegenBuff; // 0x88(0x08)
	char pad_90[0x8]; // 0x90(0x08)
};

// Class Tiger.TigerBuffArtifactHealthRegenInstance
// Size: 0x98 (Inherited: 0x98)
struct UTigerBuffArtifactHealthRegenInstance : UTigerBuffHealthRegenBaseInstance {
};

// Class Tiger.TigerBuffBlindingBeautyInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffBlindingBeautyInstance : UTigerBuffInstance {
	char pad_88[0x10]; // 0x88(0x10)
};

// Class Tiger.TigerBuffBlindingBeauty
// Size: 0x278 (Inherited: 0x270)
struct UTigerBuffBlindingBeauty : UTigerBuff {
	float BlockJumpDuration; // 0x270(0x04)
	float TurnRateCap; // 0x274(0x04)
};

// Class Tiger.TigerBuffClanReducesCooldown
// Size: 0x278 (Inherited: 0x270)
struct UTigerBuffClanReducesCooldown : UTigerBuff {
	float AbilityCooldownReduction; // 0x270(0x04)
	char pad_274[0x4]; // 0x274(0x04)
};

// Class Tiger.TigerBuffClanReducesCooldownInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffClanReducesCooldownInstance : UTigerBuffInstance {
	struct UTigerBuffClanReducesCooldown* ClanReduceCooldownBuff; // 0x88(0x08)
	struct ATigerPlayer* Player; // 0x90(0x08)
};

// Class Tiger.TigerBuffClimbInterrupt
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffClimbInterrupt : UTigerBuffDisableClimbing {
};

// Class Tiger.TigerBuffClimbInterruptInstance
// Size: 0x88 (Inherited: 0x88)
struct UTigerBuffClimbInterruptInstance : UTigerBuffInstance {
};

// Class Tiger.TigerBuffComponent
// Size: 0x140 (Inherited: 0xb0)
struct UTigerBuffComponent : UActorComponent {
	struct FMulticastInlineDelegate OnBuffAdded; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnBuffRemoved; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnBuffRefreshed; // 0xd0(0x10)
	struct FMulticastInlineDelegate OnClientBuffIdUpdated; // 0xe0(0x10)
	bool bDrawDebugString; // 0xf0(0x01)
	char pad_F1[0x7]; // 0xf1(0x07)
	struct TArray<struct UTigerBuffInstance*> BuffInstances; // 0xf8(0x10)
	struct TArray<struct UTigerBuffInstance*> NonVerifiedBuffInstances; // 0x108(0x10)
	struct TArray<struct FTigerDeferredBuffInstantiation> DeferredBuffs; // 0x118(0x10)
	char pad_128[0x18]; // 0x128(0x18)

	void Server_RequestRemoveBuffIfNonExistentFor(struct ATigerCharacter* Target, struct UTigerBuff* BuffType, int32_t BuffID, struct ATigerCharacter* BuffCaster, float BuffEndTime); // Function Tiger.TigerBuffComponent.Server_RequestRemoveBuffIfNonExistentFor // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x1247490
	void RemoveBuffByID(int32_t BuffID); // Function Tiger.TigerBuffComponent.RemoveBuffByID // (Final|Native|Public|BlueprintCallable) // @ game+0x1247400
	void OnRep_BuffInstances(); // Function Tiger.TigerBuffComponent.OnRep_BuffInstances // (Final|Native|Private) // @ game+0x12473e0
	void Multicast_ClearBuff(int32_t BuffID); // Function Tiger.TigerBuffComponent.Multicast_ClearBuff // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x1247270
	void Multicast_ClearAllBuffs(); // Function Tiger.TigerBuffComponent.Multicast_ClearAllBuffs // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x1247250
	void Multicast_AddBuff(struct UTigerBuff* BuffType, int32_t BuffID, struct ATigerCharacter* BuffCaster, float Length, float BuffStrength); // Function Tiger.TigerBuffComponent.Multicast_AddBuff // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x12470b0
	bool HasBuff(struct UTigerBuff* BuffType); // Function Tiger.TigerBuffComponent.HasBuff // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1246fe0
	float GetTimeLeft(struct UTigerBuff* BuffType); // Function Tiger.TigerBuffComponent.GetTimeLeft // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1246f40
	struct UTigerBuffInstance* FindExistingBuffOfType(struct UTigerBuff* BuffType, struct ATigerCharacter* Caster); // Function Tiger.TigerBuffComponent.FindExistingBuffOfType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1246e00
	void Client_ClearBuffFor(struct ATigerCharacter* Target, int32_t BuffID); // Function Tiger.TigerBuffComponent.Client_ClearBuffFor // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x1246c60
	void Client_ClearAllBuffs(); // Function Tiger.TigerBuffComponent.Client_ClearAllBuffs // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x1246c40
	void Client_AddBuff(struct UTigerBuff* BuffType, int32_t BuffID, struct ATigerCharacter* BuffCaster, float Length, float BuffStrength); // Function Tiger.TigerBuffComponent.Client_AddBuff // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x1246aa0
	int32_t ApplyStun(float Length, struct ATigerCharacter* BuffCaster); // Function Tiger.TigerBuffComponent.ApplyStun // (Final|Native|Public|BlueprintCallable) // @ game+0x12469d0
	int32_t ApplyInvulnerable(float Length, struct ATigerCharacter* BuffCaster); // Function Tiger.TigerBuffComponent.ApplyInvulnerable // (Final|Native|Public|BlueprintCallable) // @ game+0x1246900
	int32_t ApplyImmobilized(float Length, struct ATigerCharacter* BuffCaster); // Function Tiger.TigerBuffComponent.ApplyImmobilized // (Final|Native|Public|BlueprintCallable) // @ game+0x1246830
	int32_t ApplyGrounded(float Length, struct ATigerCharacter* BuffCaster); // Function Tiger.TigerBuffComponent.ApplyGrounded // (Final|Native|Public|BlueprintCallable) // @ game+0x1246760
	int32_t ApplyBuff(struct UTigerBuff* BuffType, struct ATigerCharacter* BuffCaster, float OverrideLength, float OverrideBuffStrength, bool bDoLagCompensation); // Function Tiger.TigerBuffComponent.ApplyBuff // (Final|Native|Public|BlueprintCallable) // @ game+0x12465c0
};

// Class Tiger.TigerBuffDOT
// Size: 0x280 (Inherited: 0x270)
struct UTigerBuffDOT : UTigerBuff {
	struct UDamageType* DamageType; // 0x270(0x08)
	float DamagePerTick; // 0x278(0x04)
	bool bPlayHitAnimation; // 0x27c(0x01)
	bool bSpawnBloodDecals; // 0x27d(0x01)
	char pad_27E[0x2]; // 0x27e(0x02)
};

// Class Tiger.TigerBuffDOTInstance
// Size: 0x90 (Inherited: 0x88)
struct UTigerBuffDOTInstance : UTigerBuffInstance {
	struct UTigerBuffDOT* BuffDOT; // 0x88(0x08)
};

// Class Tiger.TigerBufferedAction
// Size: 0x48 (Inherited: 0x28)
struct UTigerBufferedAction : UObject {
	struct ATigerPlayerController* OwnerPlayerController; // 0x28(0x08)
	struct UTigerActionBuffer* OwnerActionBuffer; // 0x30(0x08)
	char pad_38[0x10]; // 0x38(0x10)
};

// Class Tiger.TigerBufferedActionQuickAttack
// Size: 0x48 (Inherited: 0x48)
struct UTigerBufferedActionQuickAttack : UTigerBufferedAction {
};

// Class Tiger.TigerBuffExtraArtifacts
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffExtraArtifacts : UTigerBuff {
};

// Class Tiger.TigerBuffExtraArtifactsInstance
// Size: 0x88 (Inherited: 0x88)
struct UTigerBuffExtraArtifactsInstance : UTigerBuffInstance {
};

// Class Tiger.TigerBuffFOTTChargeup
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffFOTTChargeup : UTigerBuff {
};

// Class Tiger.TigerBuffFOTTChargeupInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffFOTTChargeupInstance : UTigerBuffInstance {
	struct UTigerBuffFOTTChargeup* FOTTChargeupBuff; // 0x88(0x08)
	char pad_90[0x8]; // 0x90(0x08)
};

// Class Tiger.TigerBuffFOTTKnockbackWallStun
// Size: 0x278 (Inherited: 0x270)
struct UTigerBuffFOTTKnockbackWallStun : UTigerBuff {
	float WallStunnedTimer; // 0x270(0x04)
	char pad_274[0x4]; // 0x274(0x04)
};

// Class Tiger.TigerBuffFOTTKnockbackWallStunInstance
// Size: 0xa0 (Inherited: 0x88)
struct UTigerBuffFOTTKnockbackWallStunInstance : UTigerBuffInstance {
	struct UTigerBuffFOTTKnockbackWallStun* FOTTKnockbackWallStun; // 0x88(0x08)
	char pad_90[0x8]; // 0x90(0x08)
	struct ATigerCharacter* Target; // 0x98(0x08)
};

// Class Tiger.TigerBuffFrenzy
// Size: 0x280 (Inherited: 0x270)
struct UTigerBuffFrenzy : UTigerBuff {
	float HPRegenPercentPerSecond; // 0x270(0x04)
	char pad_274[0x4]; // 0x274(0x04)
	struct UTigerWeapon* WeaponClassToEquip; // 0x278(0x08)
};

// Class Tiger.TigerBuffFrenzyInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffFrenzyInstance : UTigerBuffInstance {
	struct UTigerBuffFrenzy* FrenzyBuff; // 0x88(0x08)
	char pad_90[0x8]; // 0x90(0x08)
};

// Class Tiger.TigerBuffInAirMomentumLossInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffInAirMomentumLossInstance : UTigerBuffInstance {
	char pad_88[0x10]; // 0x88(0x10)

	void OnLandedDelegate(struct FHitResult InHit); // Function Tiger.TigerBuffInAirMomentumLossInstance.OnLandedDelegate // (Final|Native|Public|HasOutParms) // @ game+0x1247300
};

// Class Tiger.TigerBuffInAirMomentumLoss
// Size: 0x278 (Inherited: 0x270)
struct UTigerBuffInAirMomentumLoss : UTigerBuff {
	float MinimumHorizontalSpeed; // 0x270(0x04)
	float TimeToDecelerate; // 0x274(0x04)
};

// Class Tiger.TigerBuffKindredCharmInstance
// Size: 0x88 (Inherited: 0x88)
struct UTigerBuffKindredCharmInstance : UTigerBuffInstance {
};

// Class Tiger.TigerBuffKindredCharm
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffKindredCharm : UTigerBuff {
};

// Class Tiger.TigerBuffMasqueradeKeepingMovement
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffMasqueradeKeepingMovement : UTigerBuff {
};

// Class Tiger.TigerBuffMasqueradeKeepingMovementInstance
// Size: 0x90 (Inherited: 0x88)
struct UTigerBuffMasqueradeKeepingMovementInstance : UTigerBuffInstance {
	char pad_88[0x8]; // 0x88(0x08)
};

// Class Tiger.TigerBuffMeleeCharge
// Size: 0x280 (Inherited: 0x270)
struct UTigerBuffMeleeCharge : UTigerBuff {
	float TimeRunningBeforeBuffIsActive; // 0x270(0x04)
	float MaxDeviationAllowedInDegrees; // 0x274(0x04)
	struct UTigerBuff* AttackBuff; // 0x278(0x08)
};

// Class Tiger.TigerBuffMeleeChargeInstance
// Size: 0xb0 (Inherited: 0x88)
struct UTigerBuffMeleeChargeInstance : UTigerBuffInstance {
	struct UTigerBuffMeleeCharge* MeleeChargeBuff; // 0x88(0x08)
	struct ATigerPlayer* Player; // 0x90(0x08)
	char pad_98[0x18]; // 0x98(0x18)
};

// Class Tiger.TigerBuffMeleeChargeAttack
// Size: 0x278 (Inherited: 0x270)
struct UTigerBuffMeleeChargeAttack : UTigerBuff {
	struct UParticleSystem* AttackParticleEffect; // 0x270(0x08)
};

// Class Tiger.TigerBuffMeleeChargeAttackInstance
// Size: 0xa8 (Inherited: 0x88)
struct UTigerBuffMeleeChargeAttackInstance : UTigerBuffInstance {
	struct UTigerBuffMeleeChargeAttack* MeleeChargeAttackBuff; // 0x88(0x08)
	struct ATigerPlayer* Player; // 0x90(0x08)
	struct UParticleSystemComponent* ActiveAttackParticles; // 0x98(0x08)
	char pad_A0[0x8]; // 0xa0(0x08)

	void SwingFinished(); // Function Tiger.TigerBuffMeleeChargeAttackInstance.SwingFinished // (Final|Native|Private) // @ game+0x124be10
};

// Class Tiger.TigerBuffApathy
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffApathy : UTigerBuff {
};

// Class Tiger.TigerBuffApathyInstance
// Size: 0x88 (Inherited: 0x88)
struct UTigerBuffApathyInstance : UTigerBuffInstance {
};

// Class Tiger.TigerBuffWrath
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffWrath : UTigerBuff {
};

// Class Tiger.TigerBuffWrathInstance
// Size: 0x88 (Inherited: 0x88)
struct UTigerBuffWrathInstance : UTigerBuffInstance {
};

// Class Tiger.TigerBuffPostProcess
// Size: 0x238 (Inherited: 0x228)
struct ATigerBuffPostProcess : AActor {
	struct USceneComponent* Root; // 0x228(0x08)
	struct UPostProcessComponent* PostProcess; // 0x230(0x08)
};

// Class Tiger.TigerBuffPreventMasqueradeBreak
// Size: 0x278 (Inherited: 0x270)
struct UTigerBuffPreventMasqueradeBreak : UTigerBuff {
	struct UAkAudioEvent* ArtifactBreakAudioEvent; // 0x270(0x08)
};

// Class Tiger.TigerBuffPreventMasqueradeBreakInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffPreventMasqueradeBreakInstance : UTigerBuffInstance {
	struct UTigerBuffPreventMasqueradeBreak* PreventMasqueradeBreakBuff; // 0x88(0x08)
	struct ATigerPlayer* Player; // 0x90(0x08)
};

// Class Tiger.TigerBuffRejuvenatingVoiceInstance
// Size: 0x90 (Inherited: 0x88)
struct UTigerBuffRejuvenatingVoiceInstance : UTigerBuffInstance {
	char pad_88[0x8]; // 0x88(0x08)
};

// Class Tiger.TigerBuffRejuvenatingVoice
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffRejuvenatingVoice : UTigerBuff {

	void OnHealStop(struct ATigerCharacter* InBuffOwner, struct ATigerCharacter* InBuffCaster); // Function Tiger.TigerBuffRejuvenatingVoice.OnHealStop // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void OnHealStart(struct ATigerCharacter* InBuffOwner, struct ATigerCharacter* InBuffCaster); // Function Tiger.TigerBuffRejuvenatingVoice.OnHealStart // (Event|Public|BlueprintEvent) // @ game+0x16c0340
};

// Class Tiger.TigerBuffShackles
// Size: 0x288 (Inherited: 0x270)
struct UTigerBuffShackles : UTigerBuff {
	struct UTigerCharacterEffect* ActiveEffect; // 0x270(0x08)
	struct FName ShacklesStaggerAnimationName; // 0x278(0x08)
	float DamageToDeal; // 0x280(0x04)
	char pad_284[0x4]; // 0x284(0x04)
};

// Class Tiger.TigerBuffShacklesInstance
// Size: 0x90 (Inherited: 0x88)
struct UTigerBuffShacklesInstance : UTigerBuffInstance {
	struct UTigerBuffShackles* ShacklesBuff; // 0x88(0x08)
};

// Class Tiger.TigerBuffShark
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffShark : UTigerBuff {
};

// Class Tiger.TigerBuffSharkInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffSharkInstance : UTigerBuffInstance {
	struct UTigerBuffShark* SharkBuff; // 0x88(0x08)
	struct ATigerPlayer* Player; // 0x90(0x08)
};

// Class Tiger.TigerBuffShieldBase
// Size: 0x278 (Inherited: 0x270)
struct UTigerBuffShieldBase : UTigerBuff {
	float MaxShield; // 0x270(0x04)
	float InitialShield; // 0x274(0x04)
};

// Class Tiger.TigerBuffShieldAdrenalineRush
// Size: 0x288 (Inherited: 0x278)
struct UTigerBuffShieldAdrenalineRush : UTigerBuffShieldBase {
	float TimeBeforeDecay; // 0x278(0x04)
	float DecayPerSecond; // 0x27c(0x04)
	float DamageToShieldScale; // 0x280(0x04)
	char pad_284[0x4]; // 0x284(0x04)
};

// Class Tiger.TigerBuffShieldBaseInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffShieldBaseInstance : UTigerBuffInstance {
	char pad_88[0x10]; // 0x88(0x10)
};

// Class Tiger.TigerBuffShieldAdrenalineRushInstance
// Size: 0xa0 (Inherited: 0x98)
struct UTigerBuffShieldAdrenalineRushInstance : UTigerBuffShieldBaseInstance {
	char pad_98[0x8]; // 0x98(0x08)
};

// Class Tiger.TigerBuffSingleSwing
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffSingleSwing : UTigerBuff {
};

// Class Tiger.TigerBuffSingleSwingInstance
// Size: 0x98 (Inherited: 0x88)
struct UTigerBuffSingleSwingInstance : UTigerBuffInstance {
	struct ATigerPlayer* Player; // 0x88(0x08)
	char pad_90[0x8]; // 0x90(0x08)

	void SwingFinished(); // Function Tiger.TigerBuffSingleSwingInstance.SwingFinished // (Final|Native|Private) // @ game+0x124be30
};

// Class Tiger.TigerBuffStunBaton
// Size: 0x290 (Inherited: 0x270)
struct UTigerBuffStunBaton : UTigerBuff {
	float StunBonusDamage; // 0x270(0x04)
	float ChargeGainedOnHit; // 0x274(0x04)
	float ChargeGainedPerUpdate; // 0x278(0x04)
	float PassiveChargeRate; // 0x27c(0x04)
	bool bRegisterMultipleHitsOnChargeUp; // 0x280(0x01)
	bool bRegisterMultipleHitsOnStun; // 0x281(0x01)
	char pad_282[0x6]; // 0x282(0x06)
	struct UTigerBuffInstance* TBPInstanceBuff; // 0x288(0x08)
};

// Class Tiger.TigerBuffStunBatonInstance
// Size: 0xa8 (Inherited: 0x88)
struct UTigerBuffStunBatonInstance : UTigerBuffInstance {
	struct UTigerBuffStunBaton* StunBatonBuff; // 0x88(0x08)
	char pad_90[0x10]; // 0x90(0x10)
	struct ATigerPlayer* Player; // 0xa0(0x08)

	void TargetHitShockConsumed(struct ATigerCharacter* Target); // Function Tiger.TigerBuffStunBatonInstance.TargetHitShockConsumed // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void SwingStarted(bool bWasHeavyAttack); // Function Tiger.TigerBuffStunBatonInstance.SwingStarted // (Final|Native|Public) // @ game+0x124be70
	void SwingFinished(); // Function Tiger.TigerBuffStunBatonInstance.SwingFinished // (Final|Native|Public) // @ game+0x124be50
	void MaxChargeReachedEvent(); // Function Tiger.TigerBuffStunBatonInstance.MaxChargeReachedEvent // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	bool IsStunReady(); // Function Tiger.TigerBuffStunBatonInstance.IsStunReady // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124bcd0
	void HitTarget(struct ATigerCharacter* InTarget); // Function Tiger.TigerBuffStunBatonInstance.HitTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x124bc40
	void ChargeGainedEvent(float CurrentChargeValue); // Function Tiger.TigerBuffStunBatonInstance.ChargeGainedEvent // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void AddCharge(float ValueToAdd); // Function Tiger.TigerBuffStunBatonInstance.AddCharge // (Final|Native|Public|BlueprintCallable) // @ game+0x124bbc0
};

// Class Tiger.TigerBuffThorns
// Size: 0x298 (Inherited: 0x280)
struct UTigerBuffThorns : UTigerBuffDOT {
	float HealInterval; // 0x280(0x04)
	float HealPercentage; // 0x284(0x04)
	struct UTigerCharacterEffect* HealEffect; // 0x288(0x08)
	struct UAkAudioEvent* DOTTriggerEvent; // 0x290(0x08)
};

// Class Tiger.TigerBuffThornsInstance
// Size: 0xa0 (Inherited: 0x90)
struct UTigerBuffThornsInstance : UTigerBuffDOTInstance {
	char pad_90[0x8]; // 0x90(0x08)
	struct UTigerBuffThorns* ThornsBuff; // 0x98(0x08)
};

// Class Tiger.TigerBuffUnholyStimulant
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffUnholyStimulant : UTigerBuff {
};

// Class Tiger.TigerBuffUnholyStimulantInstance
// Size: 0x88 (Inherited: 0x88)
struct UTigerBuffUnholyStimulantInstance : UTigerBuffInstance {

	void OnInsideHolyIncenseChanged(bool bInIsInsideHolyIncense); // Function Tiger.TigerBuffUnholyStimulantInstance.OnInsideHolyIncenseChanged // (Final|Native|Private) // @ game+0x124bcf0
};

// Class Tiger.TigerBuffVanish
// Size: 0x290 (Inherited: 0x270)
struct UTigerBuffVanish : UTigerBuffInvisible {
	float TimeReductionPerMeterMoved; // 0x270(0x04)
	float NoiseNotifyEventRange; // 0x274(0x04)
	struct UCurveFloat* MaterialTransitionIntoCurve; // 0x278(0x08)
	struct UCurveFloat* MaterialTransitionOutFromCurve; // 0x280(0x08)
	struct UParticleSystem* BlendOutParticles; // 0x288(0x08)
};

// Class Tiger.TigerBuffVanishInstance
// Size: 0xb0 (Inherited: 0x88)
struct UTigerBuffVanishInstance : UTigerBuffInstance {
	struct UTigerBuffVanish* VanishBuff; // 0x88(0x08)
	struct ATigerPlayer* Player; // 0x90(0x08)
	char pad_98[0x18]; // 0x98(0x18)
};

// Class Tiger.TigerBuffVoiceOfInspiration
// Size: 0x270 (Inherited: 0x270)
struct UTigerBuffVoiceOfInspiration : UTigerBuff {
};

// Class Tiger.TigerBuffVoiceOfInspirationInstance
// Size: 0x88 (Inherited: 0x88)
struct UTigerBuffVoiceOfInspirationInstance : UTigerBuffInstance {
};

// Class Tiger.TigerBuildingWallPreset
// Size: 0x38 (Inherited: 0x28)
struct UTigerBuildingWallPreset : UObject {
	struct TArray<struct TSoftObjectPtr<struct UStaticMesh>> Meshes; // 0x28(0x10)
};

// Class Tiger.TigerBuildingSystem
// Size: 0x290 (Inherited: 0x228)
struct ATigerBuildingSystem : AActor {
	struct USceneComponent* Root; // 0x228(0x08)
	struct USplineComponent* SplineLeft; // 0x230(0x08)
	struct USplineComponent* SplineRight; // 0x238(0x08)
	struct TArray<struct FTigerBuildingSystemTransformableCorner> PoseableCornerFrontComponents; // 0x240(0x10)
	struct TArray<struct FTigerBuildingSystemTransformableCorner> PoseableCornerLeftComponents; // 0x250(0x10)
	struct TArray<struct FTigerBuildingSystemTransformableCorner> PoseableCornerBackComponents; // 0x260(0x10)
	struct TArray<struct FTigerBuildingSystemTransformableCorner> PoseableCornerRightComponents; // 0x270(0x10)
	struct FTigerBuildingSystemWallPieceInstancingData WallPieceInstancingDatas; // 0x280(0x10)

	void OnUpgrade(int32_t InVersion); // Function Tiger.TigerBuildingSystem.OnUpgrade // (Native|Event|Protected|BlueprintEvent) // @ game+0x124bd80
};

// Class Tiger.TigerBuildingSystemDepricated
// Size: 0x4b0 (Inherited: 0x290)
struct ATigerBuildingSystemDepricated : ATigerBuildingSystem {
	struct UHierarchicalInstancedStaticMeshComponent* Front_00; // 0x290(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Front_01; // 0x298(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Front_02; // 0x2a0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Front_03; // 0x2a8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Front_04; // 0x2b0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Front_05; // 0x2b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Front_06; // 0x2c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Front_07; // 0x2c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Left_00; // 0x2d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Left_01; // 0x2d8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Left_02; // 0x2e0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Left_03; // 0x2e8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Left_04; // 0x2f0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Left_05; // 0x2f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Left_06; // 0x300(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Left_07; // 0x308(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Back_00; // 0x310(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Back_01; // 0x318(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Back_02; // 0x320(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Back_03; // 0x328(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Back_04; // 0x330(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Back_05; // 0x338(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Back_06; // 0x340(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Back_07; // 0x348(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Right_00; // 0x350(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Right_01; // 0x358(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Right_02; // 0x360(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Right_03; // 0x368(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Right_04; // 0x370(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Right_05; // 0x378(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Right_06; // 0x380(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* Right_07; // 0x388(0x08)
	struct UStaticMeshComponent* CornerFL_00; // 0x390(0x08)
	struct UStaticMeshComponent* CornerFL_01; // 0x398(0x08)
	struct UStaticMeshComponent* CornerFL_02; // 0x3a0(0x08)
	struct UStaticMeshComponent* CornerFL_03; // 0x3a8(0x08)
	struct UStaticMeshComponent* CornerFL_04; // 0x3b0(0x08)
	struct UStaticMeshComponent* CornerFL_05; // 0x3b8(0x08)
	struct UStaticMeshComponent* CornerFL_06; // 0x3c0(0x08)
	struct UStaticMeshComponent* CornerFL_07; // 0x3c8(0x08)
	struct UStaticMeshComponent* CornerLB_00; // 0x3d0(0x08)
	struct UStaticMeshComponent* CornerLB_01; // 0x3d8(0x08)
	struct UStaticMeshComponent* CornerLB_02; // 0x3e0(0x08)
	struct UStaticMeshComponent* CornerLB_03; // 0x3e8(0x08)
	struct UStaticMeshComponent* CornerLB_04; // 0x3f0(0x08)
	struct UStaticMeshComponent* CornerLB_05; // 0x3f8(0x08)
	struct UStaticMeshComponent* CornerLB_06; // 0x400(0x08)
	struct UStaticMeshComponent* CornerLB_07; // 0x408(0x08)
	struct UStaticMeshComponent* CornerBR_00; // 0x410(0x08)
	struct UStaticMeshComponent* CornerBR_01; // 0x418(0x08)
	struct UStaticMeshComponent* CornerBR_02; // 0x420(0x08)
	struct UStaticMeshComponent* CornerBR_03; // 0x428(0x08)
	struct UStaticMeshComponent* CornerBR_04; // 0x430(0x08)
	struct UStaticMeshComponent* CornerBR_05; // 0x438(0x08)
	struct UStaticMeshComponent* CornerBR_06; // 0x440(0x08)
	struct UStaticMeshComponent* CornerBR_07; // 0x448(0x08)
	struct UStaticMeshComponent* CornerRF_00; // 0x450(0x08)
	struct UStaticMeshComponent* CornerRF_01; // 0x458(0x08)
	struct UStaticMeshComponent* CornerRF_02; // 0x460(0x08)
	struct UStaticMeshComponent* CornerRF_03; // 0x468(0x08)
	struct UStaticMeshComponent* CornerRF_04; // 0x470(0x08)
	struct UStaticMeshComponent* CornerRF_05; // 0x478(0x08)
	struct UStaticMeshComponent* CornerRF_06; // 0x480(0x08)
	struct UStaticMeshComponent* CornerRF_07; // 0x488(0x08)
	char pad_490[0x20]; // 0x490(0x20)

	void RemoveUnusedParts(); // Function Tiger.TigerBuildingSystemDepricated.RemoveUnusedParts // (Final|Native|Public|BlueprintCallable) // @ game+0x124fe30
	struct UHierarchicalInstancedStaticMeshComponent* GetFloorMeshComponent(enum class UTigerBuildingSide Side, int32_t FloorNumber); // Function Tiger.TigerBuildingSystemDepricated.GetFloorMeshComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124f260
	struct UStaticMeshComponent* GetCornerMeshComponent(enum class UTigerBuildingSide Side, int32_t FloorNumber); // Function Tiger.TigerBuildingSystemDepricated.GetCornerMeshComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124f160
	struct TArray<struct UHierarchicalInstancedStaticMeshComponent*> GetAllFloorMeshComponents(); // Function Tiger.TigerBuildingSystemDepricated.GetAllFloorMeshComponents // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124f000
	struct TArray<struct UStaticMeshComponent*> GetAllCornerMeshComponents(); // Function Tiger.TigerBuildingSystemDepricated.GetAllCornerMeshComponents // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124efd0
};

// Class Tiger.TigerBuildingWallStreamingSettings
// Size: 0x40 (Inherited: 0x38)
struct UTigerBuildingWallStreamingSettings : USharkLocalDeveloperSettings {
	int32_t WallsToStreamPerFrame; // 0x38(0x04)
	bool bLoggingEnabled; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
};

// Class Tiger.TigerBuildingSystemWallStreamer
// Size: 0x250 (Inherited: 0x228)
struct ATigerBuildingSystemWallStreamer : AActor {
	struct TArray<struct FTigerStreamableBuildingSides> StreamableBuildingParts; // 0x228(0x10)
	struct TArray<struct UStaticMeshComponent*> ComponentsToCreateRenderstateOn; // 0x238(0x10)
	char pad_248[0x8]; // 0x248(0x08)
};

// Class Tiger.TigerBuildingWallPreviewer
// Size: 0x230 (Inherited: 0x228)
struct ATigerBuildingWallPreviewer : AActor {
	struct UTigerBuildingWallPreset* Preset; // 0x228(0x08)
};

// Class Tiger.TigerCamarillaDecal
// Size: 0x238 (Inherited: 0x230)
struct ATigerCamarillaDecal : ADecalActor {
	char pad_230[0x8]; // 0x230(0x08)
};

// Class Tiger.TigerCameraPreset
// Size: 0xa8 (Inherited: 0x28)
struct UTigerCameraPreset : UObject {
	float FOV; // 0x28(0x04)
	float SpringArmLength; // 0x2c(0x04)
	struct FVector CameraOffset; // 0x30(0x0c)
	struct FVector TargetOffset; // 0x3c(0x0c)
	struct UCurveFloat* TransitionCurveIn; // 0x48(0x08)
	struct UCurveFloat* TransitionCurveOutOverride; // 0x50(0x08)
	struct UCurveFloat* RotatePawnTransition; // 0x58(0x08)
	float SidewaysCameraMirrorTime; // 0x60(0x04)
	struct FVector CameraLagSpeed; // 0x64(0x0c)
	struct FVector CameraLagMaxDistance; // 0x70(0x0c)
	float CameraRotationLagSpeed; // 0x7c(0x04)
	float CameraSensitivityModifier; // 0x80(0x04)
	bool bUseCameraSensitivtyModifierDuringFade; // 0x84(0x01)
	char pad_85[0x3]; // 0x85(0x03)
	struct UTigerCameraBehavior* CameraBehavior; // 0x88(0x08)
	struct UMatineeCameraShake* CameraShakeBehaviour; // 0x90(0x08)
	bool bShortenSpringArmWhenLookingUp; // 0x98(0x01)
	char pad_99[0x3]; // 0x99(0x03)
	float ViewPitchMax; // 0x9c(0x04)
	float ArmLengthInterpSpeed; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// Class Tiger.TigerCapturePointProgressUI
// Size: 0x2d0 (Inherited: 0x280)
struct UTigerCapturePointProgressUI : UTigerWidget {
	struct FText YouCapturingStatusText; // 0x280(0x18)
	struct FText EnemyCapturingStatusText; // 0x298(0x18)
	struct FText ContestedStatusText; // 0x2b0(0x18)
	enum class ETigerCapturePointStatus CaptureStatus; // 0x2c8(0x01)
	char pad_2C9[0x3]; // 0x2c9(0x03)
	float PercentageLeft; // 0x2cc(0x04)

	void StatusChanged(); // Function Tiger.TigerCapturePointProgressUI.StatusChanged // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void OnCapturePointEnabled(); // Function Tiger.TigerCapturePointProgressUI.OnCapturePointEnabled // (Event|Public|BlueprintEvent) // @ game+0x16c0340
};

// Class Tiger.TigerChallenge
// Size: 0xb0 (Inherited: 0x28)
struct UTigerChallenge : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct FMulticastInlineDelegate OnValueChangedEvent; // 0x30(0x10)
	struct FMulticastInlineDelegate OnChallengeCompletedEvent; // 0x40(0x10)
	struct UWorld* World; // 0x50(0x08)
	struct ATigerPlayerController* OwningPlayerController; // 0x58(0x08)
	int32_t TargetValue; // 0x60(0x04)
	int32_t PreSessionValue; // 0x64(0x04)
	struct FText ChallengeDisplayName; // 0x68(0x18)
	int32_t DefaultTargetValue; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct FText Description; // 0x88(0x18)
	uint64_t ChallengeTypeTelemetryID; // 0xa0(0x08)
	bool bChallengeCompleteEventRaised; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)

	void SetCurrentValue(int32_t NewValue); // Function Tiger.TigerChallenge.SetCurrentValue // (Native|Public|BlueprintCallable) // @ game+0x124fe50
	void OnValueChangedEvent__DelegateSignature(struct UTigerChallenge* Challenge); // DelegateFunction Tiger.TigerChallenge.OnValueChangedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x16c0340
	void OnChallengeCompletedEvent__DelegateSignature(struct UTigerChallenge* Challenge); // DelegateFunction Tiger.TigerChallenge.OnChallengeCompletedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x16c0340
	int32_t GetTargetValue(); // Function Tiger.TigerChallenge.GetTargetValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124f800
	struct FTigerQuestIdentifier GetQuestIds(); // Function Tiger.TigerChallenge.GetQuestIds // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124f3f0
	float GetProgress(); // Function Tiger.TigerChallenge.GetProgress // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124f3b0
	int32_t GetPreSessionValue(); // Function Tiger.TigerChallenge.GetPreSessionValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124f390
	int32_t GetCurrentValue(); // Function Tiger.TigerChallenge.GetCurrentValue // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124f230
	struct FText BuildDescriptionText(); // Function Tiger.TigerChallenge.BuildDescriptionText // (Event|Protected|BlueprintEvent|Const) // @ game+0x16c0340
};

// Class Tiger.TigerChallengeBreakMasquerade
// Size: 0xb8 (Inherited: 0xb0)
struct UTigerChallengeBreakMasquerade : UTigerChallenge {
	bool bOncePerMatch; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)

	void HandlePlayerBreakMasquerade(bool InIsMasqueradeBreached, enum class ETigerAIPlayerAction InPlayerAction); // Function Tiger.TigerChallengeBreakMasquerade.HandlePlayerBreakMasquerade // (Final|Native|Private) // @ game+0x124fb30
};

// Class Tiger.TigerChallengeCollectibles
// Size: 0xb8 (Inherited: 0xb0)
struct UTigerChallengeCollectibles : UTigerChallenge {
	char pad_B0[0x8]; // 0xb0(0x08)

	void HandleCollectibleCollected(uint32_t InCollectibleId); // Function Tiger.TigerChallengeCollectibles.HandleCollectibleCollected // (Final|Native|Private) // @ game+0x124f820
};

// Class Tiger.TigerChallengeCollection
// Size: 0x40 (Inherited: 0x30)
struct UTigerChallengeCollection : UDataAsset {
	struct TArray<struct FTigerChallengeCollectionEntry> Challenges; // 0x30(0x10)
};

// Class Tiger.TigerClientRewardTrackChallenges
// Size: 0x48 (Inherited: 0x28)
struct UTigerClientRewardTrackChallenges : UObject {
	struct TArray<struct FTigerItemId> RewardIds; // 0x28(0x10)
	int32_t RewardHighlightIndex; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct UTigerPersistentPlayerState* PersistentPlayerState; // 0x40(0x08)

	struct UTigerInventoryItemBase* GetRewardTiedToSpecificChallengeByIndex(int32_t InChallengeIndex); // Function Tiger.TigerClientRewardTrackChallenges.GetRewardTiedToSpecificChallengeByIndex // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124f6c0
	struct UTigerInventoryItemBase* GetRewardByIndex(int32_t InRewardIndex); // Function Tiger.TigerClientRewardTrackChallenges.GetRewardByIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124f4e0
	int32_t GetNumCompletedChallenges(); // Function Tiger.TigerClientRewardTrackChallenges.GetNumCompletedChallenges // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124f360
	int32_t GetNumChallenges(); // Function Tiger.TigerClientRewardTrackChallenges.GetNumChallenges // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124f330
	int32_t GetCompletionPercentage(); // Function Tiger.TigerClientRewardTrackChallenges.GetCompletionPercentage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124f130
	struct UTigerChallenge* GetChallengeByIndex(int32_t ChallengeIndex); // Function Tiger.TigerClientRewardTrackChallenges.GetChallengeByIndex // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124f090
};

// Class Tiger.TigerClientRewardTrackDailyChallenges
// Size: 0x60 (Inherited: 0x48)
struct UTigerClientRewardTrackDailyChallenges : UTigerClientRewardTrackChallenges {
	struct TArray<struct FTigerChallengeTypeID> DailyChallengeIDs; // 0x48(0x10)
	struct FTigerItemId DailyChallengeExpReward; // 0x58(0x08)
};

// Class Tiger.TigerClientRewardTrackSeasonalChallenges
// Size: 0x78 (Inherited: 0x48)
struct UTigerClientRewardTrackSeasonalChallenges : UTigerClientRewardTrackChallenges {
	struct FDateTime UnlockDate; // 0x48(0x08)
	struct FDateTime LockDate; // 0x50(0x08)
	struct TArray<struct FTigerChallengeInstanceID> ChallengeInstanceIDs; // 0x58(0x10)
	struct TArray<struct FTigerItemId> RewardIdForSpecificChallenge; // 0x68(0x10)

	bool IsUnlocked(); // Function Tiger.TigerClientRewardTrackSeasonalChallenges.IsUnlocked // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124fc60
	bool HasExpired(); // Function Tiger.TigerClientRewardTrackSeasonalChallenges.HasExpired // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124fc00
};

// Class Tiger.TigerClientChallengesCollection
// Size: 0x40 (Inherited: 0x28)
struct UTigerClientChallengesCollection : UObject {
	struct TArray<struct UTigerClientRewardTrackSeasonalChallenges*> WeeklyChallenges; // 0x28(0x10)
	struct UTigerClientRewardTrackDailyChallenges* DailyChallenges; // 0x38(0x08)

	struct UTigerInventoryItemBase* GetRewardTiedToWeeklyChallenge(struct UTigerChallenge* InChallenge); // Function Tiger.TigerClientChallengesCollection.GetRewardTiedToWeeklyChallenge // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124f760
	struct UTigerInventoryItemBase* GetRewardTiedToDailyChallenge(struct UTigerChallenge* InChallenge); // Function Tiger.TigerClientChallengesCollection.GetRewardTiedToDailyChallenge // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124f620
	struct UTigerInventoryItemBase* GetRewardTiedToChallenge(struct UTigerChallenge* InChallenge); // Function Tiger.TigerClientChallengesCollection.GetRewardTiedToChallenge // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x124f580
};

// Class Tiger.TigerChallengeDealDamage
// Size: 0xe0 (Inherited: 0xb0)
struct UTigerChallengeDealDamage : UTigerChallenge {
	bool bNeedsToDamagePlayer; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
	struct FTigerChallengeRequirementWeaponType RequiredWeaponConstraint; // 0xb8(0x18)
	char pad_D0[0x10]; // 0xd0(0x10)
};

// Class Tiger.TigerChallengeDiablerize
// Size: 0xc8 (Inherited: 0xb0)
struct UTigerChallengeDiablerize : UTigerChallenge {
	struct FTigerChallengeRequirementClan TargetRequiredClan; // 0xb0(0x10)
	char pad_C0[0x8]; // 0xc0(0x08)

	void OnDiablerizedPlayerEvent(enum class ETigerPlayerEvent InEvent, struct ATigerCharacter* InEventTiedCharacter); // Function Tiger.TigerChallengeDiablerize.OnDiablerizedPlayerEvent // (Final|Native|Private) // @ game+0x124fc90
	void HandleOnRestartPlayer(struct AController* InNewPlayer); // Function Tiger.TigerChallengeDiablerize.HandleOnRestartPlayer // (Final|Native|Private) // @ game+0x124f980
};

// Class Tiger.TigerChallengeDownPlayer
// Size: 0xd0 (Inherited: 0xb0)
struct UTigerChallengeDownPlayer : UTigerChallenge {
	struct FTigerChallengeRequirementWeaponType RequiredWeaponConstraint; // 0xb0(0x18)
	char pad_C8[0x8]; // 0xc8(0x08)

	void OnDownedPlayerEvent(enum class ETigerPlayerEvent InEvent, struct ATigerCharacter* InEventTiedCharacter); // Function Tiger.TigerChallengeDownPlayer.OnDownedPlayerEvent // (Final|Native|Private) // @ game+0x124fd60
	void HandleOnRestartPlayer(struct AController* InNewPlayer); // Function Tiger.TigerChallengeDownPlayer.HandleOnRestartPlayer // (Final|Native|Private) // @ game+0x124fa10
};

// Class Tiger.TigerChallengeDrainNpc
// Size: 0xb8 (Inherited: 0xb0)
struct UTigerChallengeDrainNpc : UTigerChallenge {
	bool bSpecificNPCType; // 0xb0(0x01)
	enum class ETigerNPCType TargetNPCType; // 0xb1(0x01)
	enum class ETigerBloodPotency MinimumPotency; // 0xb2(0x01)
	char pad_B3[0x5]; // 0xb3(0x05)

	bool IsBloodPotencyRelevant(); // Function Tiger.TigerChallengeDrainNpc.IsBloodPotencyRelevant // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x124fc30
	void HandleOnRestartPlayer(struct AController* NewPlayer); // Function Tiger.TigerChallengeDrainNpc.HandleOnRestartPlayer // (Final|Native|Private) // @ game+0x124faa0
	void HandleOnFeedingDoneEvent(bool bTargetIsDrained, struct ATigerCharacter* InTargetFedOn); // Function Tiger.TigerChallengeDrainNpc.HandleOnFeedingDoneEvent // (Final|Native|Private) // @ game+0x124f8b0
};

// Class Tiger.TigerChallengeGainLevels
// Size: 0xb8 (Inherited: 0xb0)
struct UTigerChallengeGainLevels : UTigerChallenge {
	char pad_B0[0x8]; // 0xb0(0x08)

	void OnTigerPlayerLevelChanged(int32_t InCurrentLevel, int32_t InOldLevel); // Function Tiger.TigerChallengeGainLevels.OnTigerPlayerLevelChanged // (Final|Native|Private) // @ game+0x1255f70
	void HandleOnRestartPlayer(struct AController* InNewPlayer); // Function Tiger.TigerChallengeGainLevels.HandleOnRestartPlayer // (Final|Native|Private) // @ game+0x1254850
};

// Class Tiger.TigerChallengeHeadshots
// Size: 0xd8 (Inherited: 0xb0)
struct UTigerChallengeHeadshots : UTigerChallenge {
	struct FTigerChallengeRequirementWeaponType RequiredWeaponConstraint; // 0xb0(0x18)
	char pad_C8[0x10]; // 0xc8(0x10)
};

// Class Tiger.TigerChallengeHitBullets
// Size: 0xd8 (Inherited: 0xb0)
struct UTigerChallengeHitBullets : UTigerChallenge {
	struct FTigerChallengeRequirementWeaponType RequiredWeaponConstraint; // 0xb0(0x18)
	char pad_C8[0x10]; // 0xc8(0x10)
};

// Class Tiger.TigerChallengeKillEntity
// Size: 0xb8 (Inherited: 0xb0)
struct UTigerChallengeKillEntity : UTigerChallenge {
	char pad_B0[0x8]; // 0xb0(0x08)

	void HandleOnNpcDeathEvent(struct ATigerNPC* NPC, struct AController* Instigator); // Function Tiger.TigerChallengeKillEntity.HandleOnNpcDeathEvent // (Final|Native|Private) // @ game+0x1254780
};

// Class Tiger.TigerChallengeKillPlayers
// Size: 0xe0 (Inherited: 0xb0)
struct UTigerChallengeKillPlayers : UTigerChallenge {
	struct FTigerChallengeRequirementWeaponType RequiredWeaponConstraint; // 0xb0(0x18)
	bool bInOneGame; // 0xc8(0x01)
	char pad_C9[0x17]; // 0xc9(0x17)
};

// Class Tiger.TigerChallengePlayGames
// Size: 0xd8 (Inherited: 0xb0)
struct UTigerChallengePlayGames : UTigerChallenge {
	struct FTigerChallengeRequirementClan RequiredClanCondition; // 0xb0(0x10)
	struct FTigerChallengeRequirementGameMode RequiredGameModeCondition; // 0xc0(0x10)
	char pad_D0[0x8]; // 0xd0(0x08)

	void HandlePlayerPlacement(struct ATigerPlayerState* InPlayerState); // Function Tiger.TigerChallengePlayGames.HandlePlayerPlacement // (Final|Native|Private) // @ game+0x1254a90
};

// Class Tiger.TigerChallengeQuestItemPickup
// Size: 0xe0 (Inherited: 0xb0)
struct UTigerChallengeQuestItemPickup : UTigerChallenge {
	struct TSoftObjectPtr<struct ATigerInteractiveQuestItem> QuestItem; // 0xb0(0x28)
	char pad_D8[0x8]; // 0xd8(0x08)

	void HandleQuestItemCollected(struct TSoftObjectPtr<struct ATigerInteractiveQuestItem> InQuestItem); // Function Tiger.TigerChallengeQuestItemPickup.HandleQuestItemCollected // (Final|Native|Private) // @ game+0x1254c40
};

// Class Tiger.TigerChallengeReachLevel
// Size: 0xb8 (Inherited: 0xb0)
struct UTigerChallengeReachLevel : UTigerChallenge {
	int32_t LevelToReach; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)

	void OnTigerPlayerLevelChanged(int32_t InCurrentLevel, int32_t InOldLevel); // Function Tiger.TigerChallengeReachLevel.OnTigerPlayerLevelChanged // (Final|Native|Private) // @ game+0x1256040
	void HandleOnRestartPlayer(struct AController* InNewPlayer); // Function Tiger.TigerChallengeReachLevel.HandleOnRestartPlayer // (Final|Native|Private) // @ game+0x12548e0
};

// Class Tiger.TigerChallengeRevive
// Size: 0xb8 (Inherited: 0xb0)
struct UTigerChallengeRevive : UTigerChallenge {
	char pad_B0[0x8]; // 0xb0(0x08)

	void OnRevivedPlayerEvent(enum class ETigerPlayerEvent InEvent, struct ATigerCharacter* InEventTiedCharacter); // Function Tiger.TigerChallengeRevive.OnRevivedPlayerEvent // (Final|Native|Private) // @ game+0x1255ea0
	void HandleOnRestartPlayer(struct AController* InNewPlayer); // Function Tiger.TigerChallengeRevive.HandleOnRestartPlayer // (Final|Native|Private) // @ game+0x1254970
};

// Class Tiger.TigerChallengeSurviveTime
// Size: 0xb8 (Inherited: 0xb0)
struct UTigerChallengeSurviveTime : UTigerChallenge {
	char pad_B0[0x8]; // 0xb0(0x08)

	void HandlePlayerPlacement(struct ATigerPlayerState* InPlayerState); // Function Tiger.TigerChallengeSurviveTime.HandlePlayerPlacement // (Final|Native|Private) // @ game+0x1254b20
};

// Class Tiger.TigerChallengeTopPlayer
// Size: 0xb8 (Inherited: 0xb0)
struct UTigerChallengeTopPlayer : UTigerChallenge {
	int32_t TopPlacementRequirement; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)

	void HandlePlayerPlacement(struct ATigerPlayerState* InPlayerState); // Function Tiger.TigerChallengeTopPlayer.HandlePlayerPlacement // (Final|Native|Private) // @ game+0x1254bb0
};

// Class Tiger.TigerChallengeTravelDistance
// Size: 0xb8 (Inherited: 0xb0)
struct UTigerChallengeTravelDistance : UTigerChallenge {
	char pad_B0[0x8]; // 0xb0(0x08)

	void OnHandlePlayerPlacement(struct ATigerPlayerState* InPlayerState); // Function Tiger.TigerChallengeTravelDistance.OnHandlePlayerPlacement // (Final|Native|Private) // @ game+0x1255cd0
};

// Class Tiger.TigerChallengeTypeDatabase
// Size: 0x48 (Inherited: 0x28)
struct UTigerChallengeTypeDatabase : UObject {
	struct TArray<struct UTigerChallengeCollection*> SeasonalChallengeCollections; // 0x28(0x10)
	struct TArray<struct UTigerChallengeCollection*> DailyChallengeCollections; // 0x38(0x10)

	struct TArray<struct UTigerChallengeCollection*> GetAllChallengeCollections(); // Function Tiger.TigerChallengeTypeDatabase.GetAllChallengeCollections // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1254420
};

// Class Tiger.TigerChallengeUseDiscipline
// Size: 0xc8 (Inherited: 0xb0)
struct UTigerChallengeUseDiscipline : UTigerChallenge {
	struct FTigerChallengeRequirementDisciplineSlot DisciplineSlotRequirement; // 0xb0(0x10)
	char pad_C0[0x8]; // 0xc0(0x08)

	void OnDisciplineActivated(enum class ETigerDisciplinesEnum InDisciplineActivated); // Function Tiger.TigerChallengeUseDiscipline.OnDisciplineActivated // (Final|Native|Private) // @ game+0x1255c50
	void HandleOnRestartPlayer(struct AController* InNewPlayer); // Function Tiger.TigerChallengeUseDiscipline.HandleOnRestartPlayer // (Final|Native|Private) // @ game+0x1254a00
};

// Class Tiger.TigerChallengeUtilityBFL
// Size: 0x28 (Inherited: 0x28)
struct UTigerChallengeUtilityBFL : UBlueprintFunctionLibrary {

	bool HasRequirement_WeaponType(struct FTigerChallengeRequirementWeaponType InRequirement); // Function Tiger.TigerChallengeUtilityBFL.HasRequirement_WeaponType // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1254e90
	bool HasRequirement_GameMode(struct FTigerChallengeRequirementGameMode InRequirement); // Function Tiger.TigerChallengeUtilityBFL.HasRequirement_GameMode // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1254df0
	bool HasRequirement_DisciplineSlot(struct FTigerChallengeRequirementDisciplineSlot InRequirement); // Function Tiger.TigerChallengeUtilityBFL.HasRequirement_DisciplineSlot // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1254d50
	bool HasRequirement_Clan(struct FTigerChallengeRequirementClan InRequirement); // Function Tiger.TigerChallengeUtilityBFL.HasRequirement_Clan // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1254d50
};

// Class Tiger.TigerChallengeVisitLocation
// Size: 0xe0 (Inherited: 0xb0)
struct UTigerChallengeVisitLocation : UTigerChallenge {
	struct TSoftObjectPtr<struct ATigerVisitLocationTriggerVolume> TriggerVolume; // 0xb0(0x28)
	char pad_D8[0x8]; // 0xd8(0x08)

	void HandleLocationVisited(); // Function Tiger.TigerChallengeVisitLocation.HandleLocationVisited // (Final|Native|Private) // @ game+0x1254760
};

// Class Tiger.TigerCharacterCardBase
// Size: 0x288 (Inherited: 0x280)
struct UTigerCharacterCardBase : UTigerWidget {
	struct TWeakObjectPtr<struct ATigerPlayerState> RepresentedPlayer; // 0x280(0x08)

	void OnInit(struct ATigerPlayerState* InRepresentedPlayer); // Function Tiger.TigerCharacterCardBase.OnInit // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void Init(struct ATigerPlayerState* InRepresentedPlayer); // Function Tiger.TigerCharacterCardBase.Init // (Final|Native|Private|BlueprintCallable) // @ game+0x125c4a0
	struct ATigerPlayerState* GetRepresentedPlayer(); // Function Tiger.TigerCharacterCardBase.GetRepresentedPlayer // (Final|Native|Private|BlueprintCallable|BlueprintPure|Const) // @ game+0x125c470
	void BuildCharacterCard(); // Function Tiger.TigerCharacterCardBase.BuildCharacterCard // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
};

// Class Tiger.TigerCharacterCustomizablePreviewThumbnailUI
// Size: 0x2f0 (Inherited: 0x280)
struct UTigerCharacterCustomizablePreviewThumbnailUI : UTigerWidget {
	struct ATigerThumbnailActor* ThumbnailActorType; // 0x280(0x08)
	bool bIsRealtime; // 0x288(0x01)
	char pad_289[0x7]; // 0x289(0x07)
	struct UMaterialInterface* PostRenderMaterial; // 0x290(0x08)
	char pad_298[0x40]; // 0x298(0x40)
	struct ATigerThumbnailActor* ThumbnailActor; // 0x2d8(0x08)
	float FOV; // 0x2e0(0x04)
	char pad_2E4[0xc]; // 0x2e4(0x0c)

	void TickViewport(float InDeltaTime); // Function Tiger.TigerCharacterCustomizablePreviewThumbnailUI.TickViewport // (Final|Native|Public|BlueprintCallable) // @ game+0x125c530
};

// Class Tiger.TigerInventoryItemBase
// Size: 0x110 (Inherited: 0x28)
struct UTigerInventoryItemBase : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct FText UiName; // 0x30(0x18)
	struct FText UIDescription; // 0x48(0x18)
	struct FText TemporaryVs2CategoryName; // 0x60(0x18)
	struct TSoftObjectPtr<struct UTexture2D> UITexture; // 0x78(0x28)
	struct TSoftObjectPtr<struct UTexture2D> UiBackgroundTexture; // 0xa0(0x28)
	struct FLinearColor TintColor; // 0xc8(0x10)
	bool bForceToFrontWhenSorted; // 0xd8(0x01)
	enum class ETigerItemRarity Rarity; // 0xd9(0x01)
	bool bIsAvailableForEveryone; // 0xda(0x01)
	char pad_DB[0x5]; // 0xdb(0x05)
	struct TArray<struct FTigerInventoryItemOwnerType> PossibleOwners; // 0xe0(0x10)
	struct FString CameraTag; // 0xf0(0x10)
	int32_t PersistentID; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
	uint64_t TelemetryID; // 0x108(0x08)

	void SetUIMaterialParameters(struct UMaterialInstanceDynamic* InMaterial); // Function Tiger.TigerInventoryItemBase.SetUIMaterialParameters // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
	struct UMaterialInterface* GetUiMaterialOverride(); // Function Tiger.TigerInventoryItemBase.GetUiMaterialOverride // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
	enum class ETigerPersistentStoreCategory GetStoreCategory(); // Function Tiger.TigerInventoryItemBase.GetStoreCategory // (Native|Public|BlueprintCallable|Const) // @ game+0x12eec00
	bool GetPrimaryOwner(enum class ETigerClan OutClan, enum class ETigerPowerKitType OutArchetype, enum class ETigerGender OutBodyType); // Function Tiger.TigerInventoryItemBase.GetPrimaryOwner // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x12ee960
	struct TArray<enum class ETigerClan> GetPossibleOwningClans(); // Function Tiger.TigerInventoryItemBase.GetPossibleOwningClans // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x12ee8e0
	struct TArray<enum class ETigerGender> GetPossibleOwningBodyTypes(); // Function Tiger.TigerInventoryItemBase.GetPossibleOwningBodyTypes // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x12ee860
	struct TArray<enum class ETigerPowerKitType> GetPossibleOwningArchetypes(); // Function Tiger.TigerInventoryItemBase.GetPossibleOwningArchetypes // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x12ee7e0
	int32_t GetPersistentId(); // Function Tiger.TigerInventoryItemBase.GetPersistentId // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12ee6b0
	bool CanBeOwnedByBodyWithArchetypeRestriction(enum class ETigerGender InBodyType, enum class ETigerPowerKitType InPowerKit); // Function Tiger.TigerInventoryItemBase.CanBeOwnedByBodyWithArchetypeRestriction // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12ecb70
	bool CanBeOwnedByBodyType(enum class ETigerGender BodyType); // Function Tiger.TigerInventoryItemBase.CanBeOwnedByBodyType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12ecae0
	bool CanBeOwnedByArchetype(enum class ETigerPowerKitType InArchetypeType); // Function Tiger.TigerInventoryItemBase.CanBeOwnedByArchetype // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12eca50
	bool CanBeOwnedByAnyArchetypeOfClan(struct UTigerPlayerClanData* InClan, enum class ETigerGender BodyType); // Function Tiger.TigerInventoryItemBase.CanBeOwnedByAnyArchetypeOfClan // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12ec980
};

// Class Tiger.TigerCharacterOutfitConfiguration
// Size: 0x2a0 (Inherited: 0x110)
struct UTigerCharacterOutfitConfiguration : UTigerInventoryItemBase {
	struct FTigerLodSplitMesh SplitMesh; // 0x110(0x78)
	struct TSoftObjectPtr<struct USkeletalMesh> AdditionalMesh; // 0x188(0x28)
	struct TArray<struct FTigerCharacterOutfitHoodieVariation> HoodieVariations; // 0x1b0(0x10)
	struct TMap<int32_t, struct TSoftObjectPtr<struct UMaterialInterface>> Materials; // 0x1c0(0x50)
	struct FTigerCharacterHolsteredWeaponTransforms HolsteredWeaponsTransforms; // 0x210(0x60)
	bool bHoodieUpOnThumbnail; // 0x270(0x01)
	char pad_271[0x7]; // 0x271(0x07)
	struct TSoftObjectPtr<struct USkeletalMesh> Mesh; // 0x278(0x28)
};

// Class Tiger.TigerCharacterCombinedItemConfiguration
// Size: 0x148 (Inherited: 0x110)
struct UTigerCharacterCombinedItemConfiguration : UTigerInventoryItemBase {
	SoftClassProperty CombinedItemClassType; // 0x110(0x28)
	struct TArray<struct FTigerInventoryCombinedItemValue> Items; // 0x138(0x10)

	struct UTigerInventoryItemBase* GetItemFromCombinedContainer(enum class ETigerGender InBodyType, enum class ETigerPowerKitType InPowerKit, enum class ETigerClan InClan); // Function Tiger.TigerCharacterCombinedItemConfiguration.GetItemFromCombinedContainer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x125c350
};

// Class Tiger.TigerCharacterSkinToneCustomization
// Size: 0x160 (Inherited: 0x110)
struct UTigerCharacterSkinToneCustomization : UTigerInventoryItemBase {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x110(0x38)
	struct FLinearColor LightColor; // 0x148(0x10)
	float LightIntensity; // 0x158(0x04)
	char pad_15C[0x4]; // 0x15c(0x04)
};

// Class Tiger.TigerCharacterBodyTypeCustomization
// Size: 0x138 (Inherited: 0x110)
struct UTigerCharacterBodyTypeCustomization : UTigerInventoryItemBase {
	struct TSoftObjectPtr<struct UTigerCharacterPreset> CharacterPreset; // 0x110(0x28)
};

// Class Tiger.TigerCharacterPartOfHeadCustomization
// Size: 0x110 (Inherited: 0x110)
struct UTigerCharacterPartOfHeadCustomization : UTigerInventoryItemBase {
};

// Class Tiger.TigerPlayerCardCustomization
// Size: 0x110 (Inherited: 0x110)
struct UTigerPlayerCardCustomization : UTigerInventoryItemBase {
};

// Class Tiger.TigerCharacterHeadConfiguration
// Size: 0x260 (Inherited: 0x110)
struct UTigerCharacterHeadConfiguration : UTigerCharacterPartOfHeadCustomization {
	struct FTigerLodSplitMesh SplitMesh; // 0x110(0x78)
	struct TSoftObjectPtr<struct UPoseAsset> FacePostAsset; // 0x188(0x28)
	struct TSoftObjectPtr<struct UAnimSequence> FacePoseSourceAnimation; // 0x1b0(0x28)
	struct TArray<struct TSoftObjectPtr<struct UMaterialInterface>> BodySkinMaterials; // 0x1d8(0x10)
	struct TArray<SoftClassProperty> SkinTones; // 0x1e8(0x10)
	struct FName HeadgearMaleSocket; // 0x1f8(0x08)
	struct FName HeadgearFemaleSocket; // 0x200(0x08)
	struct FName HeadgearOffsetSocketName; // 0x208(0x08)
	struct FName HeadgearOffsetLocator; // 0x210(0x08)
	struct FTigerCharacterHeadHeadgearOffset HeadgearOffset; // 0x218(0x18)
	struct FName EyewearSocket; // 0x230(0x08)
	struct TSoftObjectPtr<struct USkeletalMesh> Mesh; // 0x238(0x28)

	void SetPoseableBeard(struct UTigerCharacterBeardCustomization* InBeard, struct UTigerCharacterMeshManager* InMeshManager, struct TSet<struct FString> InFilter); // Function Tiger.TigerCharacterHeadConfiguration.SetPoseableBeard // (Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x16c0340
	void SetPiercingSlotLocationAndRotation(struct UTigerCharacterMeshManager* InMeshManager, struct FName InName, struct FVector InLocation, struct FRotator InRotation); // Function Tiger.TigerCharacterHeadConfiguration.SetPiercingSlotLocationAndRotation // (Event|Public|HasDefaults|BlueprintEvent) // @ game+0x16c0340
	void SetPiercings(struct UTigerCharacterPiercingSetCustomization* InPiercingSet, struct UTigerCharacterMeshManager* InMeshManager, struct TSet<struct FString> InFilter); // Function Tiger.TigerCharacterHeadConfiguration.SetPiercings // (Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x16c0340
	void SetEyewearOffset(struct UTigerCharacterMeshManager* MeshManager); // Function Tiger.TigerCharacterHeadConfiguration.SetEyewearOffset // (Event|Public|BlueprintEvent|Const) // @ game+0x16c0340
	void GetPiercingSlots(struct UTigerCharacterMeshManager* InMeshManager, struct TSet<struct FString> InFilter, struct TMap<struct FName, struct FTigerCharacterHeadPiercingSocket> OutSlots); // Function Tiger.TigerCharacterHeadConfiguration.GetPiercingSlots // (Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x16c0340
	void DrawDebugPiercingSlots(struct UTigerCharacterMeshManager* InMeshManager, struct TSet<struct FString> InFilter); // Function Tiger.TigerCharacterHeadConfiguration.DrawDebugPiercingSlots // (Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x16c0340
};

// Class Tiger.TigerCharacterFacePaintCustomization
// Size: 0x148 (Inherited: 0x110)
struct UTigerCharacterFacePaintCustomization : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x110(0x38)
};

// Class Tiger.TigerCharacterHeadgearCustomization
// Size: 0x180 (Inherited: 0x110)
struct UTigerCharacterHeadgearCustomization : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x110(0x38)
	struct TSoftObjectPtr<struct USkeletalMesh> Mesh; // 0x148(0x28)
	struct UTigerAnimationFilter* AnimationFilter; // 0x170(0x08)
	bool bHideBeard; // 0x178(0x01)
	char pad_179[0x7]; // 0x179(0x07)

	void GatherPiercingFilter(struct TSet<struct FString> InOutPiercingFilter); // Function Tiger.TigerCharacterHeadgearCustomization.GatherPiercingFilter // (Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x16c0340
};

// Class Tiger.TigerCharacterEyewearCustomization
// Size: 0x170 (Inherited: 0x110)
struct UTigerCharacterEyewearCustomization : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x110(0x38)
	struct TSoftObjectPtr<struct USkeletalMesh> Mesh; // 0x148(0x28)

	void GatherPiercingFilter(struct TSet<struct FString> InOutPiercingFilter); // Function Tiger.TigerCharacterEyewearCustomization.GatherPiercingFilter // (Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x16c0340
};

// Class Tiger.TigerCharacterHairStyleCustomization
// Size: 0x200 (Inherited: 0x110)
struct UTigerCharacterHairStyleCustomization : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x110(0x38)
	struct FTigerLodSplitMesh SplitMesh; // 0x148(0x78)
	struct UAnimInstance* Animation; // 0x1c0(0x08)
	struct FName SocketAttachments[0x2]; // 0x1c8(0x10)
	struct TSoftObjectPtr<struct USkeletalMesh> Mesh; // 0x1d8(0x28)
};

// Class Tiger.TigerCharacterHairColorCustomization
// Size: 0x148 (Inherited: 0x110)
struct UTigerCharacterHairColorCustomization : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x110(0x38)
};

// Class Tiger.TigerCharacterEyeColorCustomization
// Size: 0x148 (Inherited: 0x110)
struct UTigerCharacterEyeColorCustomization : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x110(0x38)
};

// Class Tiger.TigerCharacterEyebrowCustomization
// Size: 0x148 (Inherited: 0x110)
struct UTigerCharacterEyebrowCustomization : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x110(0x38)
};

// Class Tiger.TigerCharacterEyebrowColorCustomization
// Size: 0x148 (Inherited: 0x110)
struct UTigerCharacterEyebrowColorCustomization : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x110(0x38)
};

// Class Tiger.TigerCharacterBeardCustomization
// Size: 0x148 (Inherited: 0x110)
struct UTigerCharacterBeardCustomization : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x110(0x38)
};

// Class Tiger.TigerCharacterBeardColorCustomization
// Size: 0x148 (Inherited: 0x110)
struct UTigerCharacterBeardColorCustomization : UTigerCharacterPartOfHeadCustomization {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x110(0x38)
};

// Class Tiger.TigerCharacterTattooCustomization
// Size: 0x148 (Inherited: 0x110)
struct UTigerCharacterTattooCustomization : UTigerInventoryItemBase {
	struct FTigerCharacterCustomizationParameters AdditionalParameters; // 0x110(0x38)
};

// Class Tiger.TigerCharacterPiercingSetCustomization
// Size: 0x110 (Inherited: 0x110)
struct UTigerCharacterPiercingSetCustomization : UTigerCharacterPartOfHeadCustomization {
};

// Class Tiger.TigerCharacterIconCustomization
// Size: 0x138 (Inherited: 0x110)
struct UTigerCharacterIconCustomization : UTigerPlayerCardCustomization {
	struct TSoftObjectPtr<struct UTexture2D> CharacterIcon; // 0x110(0x28)
};

// Class Tiger.TigerCharacterCardShapeCustomization
// Size: 0x138 (Inherited: 0x110)
struct UTigerCharacterCardShapeCustomization : UTigerPlayerCardCustomization {
	struct TSoftObjectPtr<struct UTexture2D> CardShapeMask; // 0x110(0x28)
};

// Class Tiger.TigerCharacterCardBackgroundCustomization
// Size: 0x138 (Inherited: 0x110)
struct UTigerCharacterCardBackgroundCustomization : UTigerPlayerCardCustomization {
	struct TSoftObjectPtr<struct UTexture2D> CardBackground; // 0x110(0x28)
};

// Class Tiger.TigerCharacterEmoteCustomization
// Size: 0x120 (Inherited: 0x110)
struct UTigerCharacterEmoteCustomization : UTigerInventoryItemBase {
	struct UAnimMontage* EmoteMontage; // 0x110(0x08)
	bool bStopsMovement; // 0x118(0x01)
	char pad_119[0x3]; // 0x119(0x03)
	float ThumbnailPoseTime; // 0x11c(0x04)
};

// Class Tiger.TigerClanCustomizationOptions
// Size: 0x328 (Inherited: 0x28)
struct UTigerClanCustomizationOptions : UObject {
	struct TArray<struct FTigerCharacterCustomizationOutfitData> Outfits; // 0x28(0x10)
	struct TArray<struct FTigerCharacterCustomizationHeadData> Heads; // 0x38(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> Hairs; // 0x48(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> HairColors; // 0x58(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> EyeColors; // 0x68(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> Tattoos; // 0x78(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> FacePaints; // 0x88(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> PiercingSets; // 0x98(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> Headgears; // 0xa8(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> Eyewears; // 0xb8(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> Eyebrows; // 0xc8(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> EyebrowColors; // 0xd8(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> Beards; // 0xe8(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> BeardColors; // 0xf8(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> CharacterIcons; // 0x108(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> CharacterCardShapes; // 0x118(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> CharacterCardTextures; // 0x128(0x10)
	struct TArray<struct FTigerCharacterCustomizationItem> Emotes; // 0x138(0x10)
	struct TMap<enum class ETigerCustomizationType, struct FTigerCombinedItemCustomizations> CombinedItems; // 0x148(0x50)
	int32_t PersistentIdTicker; // 0x198(0x04)
	char pad_19C[0x4]; // 0x19c(0x04)
	struct TMap<int32_t, SoftClassProperty> IdToItemLut; // 0x1a0(0x50)
	struct TMap<SoftClassProperty, int32_t> ItemToIdLut; // 0x1f0(0x50)
	struct TMap<int32_t, int32_t> IdToIndexLut; // 0x240(0x50)
	struct FTigerCharacterCardData DefaultPlayerCard; // 0x290(0x98)
};

// Class Tiger.TigerCharacterEffect
// Size: 0x28 (Inherited: 0x28)
struct UTigerCharacterEffect : UObject {

	void ApplyWithTarget(struct ATigerCharacter* Character, struct ATigerCharacter* Target); // Function Tiger.TigerCharacterEffect.ApplyWithTarget // (BlueprintCosmetic|Event|Public|BlueprintEvent|Const) // @ game+0x16c0340
	void ApplyWithSocket(struct ATigerCharacter* Character, struct FName SocketName); // Function Tiger.TigerCharacterEffect.ApplyWithSocket // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x16c0340
	void Apply(struct ATigerCharacter* Character); // Function Tiger.TigerCharacterEffect.Apply // (BlueprintCosmetic|Event|Public|BlueprintEvent|Const) // @ game+0x16c0340
};

// Class Tiger.TigerCharacterMenuUI
// Size: 0x2b8 (Inherited: 0x2b8)
struct UTigerCharacterMenuUI : UTigerIngameSubmenuWidget {

	void OnDisciplinesUpdated(); // Function Tiger.TigerCharacterMenuUI.OnDisciplinesUpdated // (Event|Public|BlueprintEvent) // @ game+0x16c0340
};

// Class Tiger.TigerCharacterMeshManager
// Size: 0x1e0 (Inherited: 0xb0)
struct UTigerCharacterMeshManager : UActorComponent {
	struct TArray<struct FTigerStaticMeshData> StaticMeshes; // 0xb0(0x10)
	struct TArray<struct FTigerPoseableMeshData> PoseableMeshes; // 0xc0(0x10)
	struct FTigerCharacterMeshData Mesh[0xb]; // 0xd0(0x108)
	struct UStaticPiercingPhysics* StaticPiercingPhysics; // 0x1d8(0x08)

	void SetVisibilityOnMeshes(bool bInNewVisibility); // Function Tiger.TigerCharacterMeshManager.SetVisibilityOnMeshes // (Native|Public|BlueprintCallable) // @ game+0x1260430
	void SetVisibilityOnMesh(enum class ETigerCharacterMeshPart InMeshType, bool bInNewVisibility); // Function Tiger.TigerCharacterMeshManager.SetVisibilityOnMesh // (Native|Public|BlueprintCallable) // @ game+0x1260350
	void SetVisibilityOnDynamicMesh(enum class ETigerCharacterDynamicMeshType InMeshType, bool bInNewVisibility); // Function Tiger.TigerCharacterMeshManager.SetVisibilityOnDynamicMesh // (Native|Public|BlueprintCallable) // @ game+0x1260270
	void SetVisibilityAllowanceOnMeshes(bool bInNewVisibilityIsAllowed); // Function Tiger.TigerCharacterMeshManager.SetVisibilityAllowanceOnMeshes // (Native|Public|BlueprintCallable) // @ game+0x12601e0
	void SetVisibilityAllowanceOnMesh(enum class ETigerCharacterMeshPart InMeshType, bool bInNewVisibilityIsAllowed); // Function Tiger.TigerCharacterMeshManager.SetVisibilityAllowanceOnMesh // (Native|Public|BlueprintCallable) // @ game+0x1260100
	void SetVisibilityAllowanceOnDynamicMesh(enum class ETigerCharacterDynamicMeshType InMeshType, bool bInNewVisibilityIsAllowed); // Function Tiger.TigerCharacterMeshManager.SetVisibilityAllowanceOnDynamicMesh // (Native|Public|BlueprintCallable) // @ game+0x1260020
	void SetSkeletalMesh(enum class ETigerCharacterMeshPart Part, struct USkeletalMesh* Mesh, bool bForceClothNextUpdateTeleport); // Function Tiger.TigerCharacterMeshManager.SetSkeletalMesh // (Native|Public|BlueprintCallable) // @ game+0x125ff10
	void SetScalarParameterValueOnMeshes(struct FName InParameterName, float InParameterValue); // Function Tiger.TigerCharacterMeshManager.SetScalarParameterValueOnMeshes // (Native|Public|BlueprintCallable) // @ game+0x125fe30
	void SetMaterial(enum class ETigerCharacterMeshPart Part, int32_t MaterialIndex, struct UMaterialInterface* Material); // Function Tiger.TigerCharacterMeshManager.SetMaterial // (Native|Public|BlueprintCallable) // @ game+0x125fd20
	void RemoveMeshComponent(struct UStaticMeshComponent* InMesh); // Function Tiger.TigerCharacterMeshManager.RemoveMeshComponent // (Native|Public|BlueprintCallable) // @ game+0x125fa40
	void RegisterMeshComponent(enum class ETigerCharacterMeshPart Part, struct USkeletalMeshComponent* MeshComponent); // Function Tiger.TigerCharacterMeshManager.RegisterMeshComponent // (Native|Public|BlueprintCallable) // @ game+0x125f970
	struct USkeletalMeshComponent* GetSkeletalMeshComponent(enum class ETigerCharacterMeshPart Part); // Function Tiger.TigerCharacterMeshManager.GetSkeletalMeshComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x125f0e0
	struct TArray<struct UMeshComponent*> GetRegisteredMeshes(); // Function Tiger.TigerCharacterMeshManager.GetRegisteredMeshes // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x125f060
	void AddPoseableMesh(struct USkeletalMesh* InMesh, struct UTigerCharacterPoseableMeshAnimInstance* InAnimClass, enum class ETigerCharacterDynamicMeshType InType, struct TArray<struct FTigerCharacterPoseableMeshBoneSetupData> InPoseableMeshSetupData); // Function Tiger.TigerCharacterMeshManager.AddPoseableMesh // (Native|Public|BlueprintCallable) // @ game+0x125eb60
	void AddPiercing(struct UStaticMesh* InPiercingMesh, struct FName InFaceSlotName, struct FName InPiercingSlotName, struct FVector InLocalLocation, struct FRotator InLocalRotation); // Function Tiger.TigerCharacterMeshManager.AddPiercing // (Native|Public|HasDefaults|BlueprintCallable) // @ game+0x125e9b0
	void AddMeshComponent(struct UStaticMeshComponent* InMesh); // Function Tiger.TigerCharacterMeshManager.AddMeshComponent // (Native|Public|BlueprintCallable) // @ game+0x125e920
};

// Class Tiger.TigerCharacterMovementComponent
// Size: 0xd30 (Inherited: 0xb00)
struct UTigerCharacterMovementComponent : UCharacterMovementComponent {
	struct UTigerTraversalFiniteStateMachine* FiniteStateMachine; // 0xb00(0x08)
	char pad_B08[0x18]; // 0xb08(0x18)
	float MaxSprintSpeed; // 0xb20(0x04)
	float SprintSpeedMultiplier; // 0xb24(0x04)
	char pad_B28[0x4]; // 0xb28(0x04)
	float ForwardAngleThreshold; // 0xb2c(0x04)
	char pad_B30[0x8]; // 0xb30(0x08)
	struct UTigerSprintConfig* SprintConfig; // 0xb38(0x08)
	float MaxJumpHeight; // 0xb40(0x04)
	bool bPreventFallingSlide; // 0xb44(0x01)
	char pad_B45[0x3]; // 0xb45(0x03)
	float DownedMaxSpeed; // 0xb48(0x04)
	char pad_B4C[0x4]; // 0xb4c(0x04)
	struct FMulticastInlineDelegate OnDodge; // 0xb50(0x10)
	float WallClimbCombineThresholdSquared; // 0xb60(0x04)
	char pad_B64[0x4]; // 0xb64(0x04)
	struct UTigerImpendingCollisionCalculator* ImpendingCollisionCalculator; // 0xb68(0x08)
	float TimeUntilCollision; // 0xb70(0x04)
	float AngleToImpendingCollisionWithClimbableSurface; // 0xb74(0x04)
	float CharacterAngleToImpendingCollisionWithClimbableSurface; // 0xb78(0x04)
	bool bAboutToCollideWithClimbableSurface; // 0xb7c(0x01)
	char pad_B7D[0x17]; // 0xb7d(0x17)
	uint32_t ElysiumBlockedTraversalStates; // 0xb94(0x04)
	bool bEnableRestrictedElysiumMobility; // 0xb98(0x01)
	bool bIsInLedgeGrab; // 0xb99(0x01)
	bool bContinueToUseClimbCameraDuringLedgeGrab; // 0xb9a(0x01)
	bool bWasLastLandingHard; // 0xb9b(0x01)
	char pad_B9C[0x8]; // 0xb9c(0x08)
	struct FName RightHandBoneName; // 0xba4(0x08)
	struct FName LeftHandBoneName; // 0xbac(0x08)
	struct FName RightFootBoneName; // 0xbb4(0x08)
	struct FName LeftFootBoneName; // 0xbbc(0x08)
	float JumpCapsuleHeightReduction; // 0xbc4(0x04)
	char pad_BC8[0x48]; // 0xbc8(0x48)
	struct FTigerDeltaCorrectionData CurrentDeltaCorrectedAnimationData; // 0xc10(0x40)
	bool bUseCustomCurvesExclusivelyForInclineSpeedModification; // 0xc50(0x01)
	char pad_C51[0x7]; // 0xc51(0x07)
	struct UCurveFloat* InclineMovementMultiplierCurve; // 0xc58(0x08)
	struct UCurveFloat* DeclineMovementMultiplierCurve; // 0xc60(0x08)
	struct UCurveFloat* BackwardsMovementMultiplierCurve; // 0xc68(0x08)
	float BackwardsAngleThreshold; // 0xc70(0x04)
	char pad_C74[0x14]; // 0xc74(0x14)
	struct UTigerSprintConfig* SprintConfigClass; // 0xc88(0x08)
	struct UCurveFloat* AimGlideProgressCurve; // 0xc90(0x08)
	struct UCurveFloat* AimGlideDragOverVelocityCurve; // 0xc98(0x08)
	struct UCurveFloat* AimGlideLateralDragCurve; // 0xca0(0x08)
	struct UCurveFloat* AimGlideAirControlCurve; // 0xca8(0x08)
	bool bResetAimGlideOnDoubleJump; // 0xcb0(0x01)
	char pad_CB1[0x7]; // 0xcb1(0x07)
	struct UAnimMontage* PendingPreMovementMontage; // 0xcb8(0x08)
	char pad_CC0[0x3c]; // 0xcc0(0x3c)
	struct FVector LastWallJumpedNormal; // 0xcfc(0x0c)
	char pad_D08[0x28]; // 0xd08(0x28)

	void TigerDelegateOnDodged__DelegateSignature(struct FVector RelativeLaunchDirection); // DelegateFunction Tiger.TigerCharacterMovementComponent.TigerDelegateOnDodged__DelegateSignature // (MulticastDelegate|Public|Delegate|HasDefaults) // @ game+0x16c0340
	bool ShouldUseClimbingCamera(); // Function Tiger.TigerCharacterMovementComponent.ShouldUseClimbingCamera // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1260550
	bool ShouldRestrictMobility(enum class ETigerTraversalState InPotentialActionToRestrict); // Function Tiger.TigerCharacterMovementComponent.ShouldRestrictMobility // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12604c0
	void Server_SetDeltaCorrectionEndPoint(struct FVector EndPosition); // Function Tiger.TigerCharacterMovementComponent.Server_SetDeltaCorrectionEndPoint // (Final|Net|NetReliableNative|Event|Private|NetServer|HasDefaults|NetValidate) // @ game+0x125fad0
	void PlayDeltaCorrectedAnimation(struct UAnimMontage* AnimMontageToCorrect, struct FVector PositionToCorrectTo, bool bShouldAdjustAnimationPlayRate); // Function Tiger.TigerCharacterMovementComponent.PlayDeltaCorrectedAnimation // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x125f850
	void Multicast_WallJump(); // Function Tiger.TigerCharacterMovementComponent.Multicast_WallJump // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x125f830
	void Multicast_UpdateWallJump(enum class ESharkFourWayDirection InDesiredWallJumpDirection, char InDesiredWallJumpAnimState, struct FVector InWallNormal, struct FVector InWallJumpVelocity); // Function Tiger.TigerCharacterMovementComponent.Multicast_UpdateWallJump // (Final|Net|NetReliableNative|Event|NetMulticast|Private|HasDefaults) // @ game+0x125f6a0
	void Multicast_StopClimb(); // Function Tiger.TigerCharacterMovementComponent.Multicast_StopClimb // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x125f680
	void Multicast_ReplicateState(enum class ETigerTraversalState InTraversalStateType, enum class ETigerTraversalTransitionAction InAction); // Function Tiger.TigerCharacterMovementComponent.Multicast_ReplicateState // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x125f5b0
	void Multicast_FinishWallJump(); // Function Tiger.TigerCharacterMovementComponent.Multicast_FinishWallJump // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x125f590
	void Multicast_BeginClimb(struct AActor* InTargetClimbObject, struct FVector InClimbStartLocation); // Function Tiger.TigerCharacterMovementComponent.Multicast_BeginClimb // (Final|Net|NetReliableNative|Event|NetMulticast|Private|HasDefaults) // @ game+0x125f4b0
	void Multicast_AirDash(enum class ESharkFourWayDirection InDashDirection, float InAirDashAngleInDegrees); // Function Tiger.TigerCharacterMovementComponent.Multicast_AirDash // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x125f3e0
	bool IsSprintingAtFullSpeed(); // Function Tiger.TigerCharacterMovementComponent.IsSprintingAtFullSpeed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x125f3b0
	bool IsSprinting(); // Function Tiger.TigerCharacterMovementComponent.IsSprinting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x125f380
	bool IsSliding(); // Function Tiger.TigerCharacterMovementComponent.IsSliding // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x125f350
	bool IsSlideJumping(); // Function Tiger.TigerCharacterMovementComponent.IsSlideJumping // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x125f320
	bool IsInWallJump(); // Function Tiger.TigerCharacterMovementComponent.IsInWallJump // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x125f2f0
	bool IsInWallHang(); // Function Tiger.TigerCharacterMovementComponent.IsInWallHang // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x125f2c0
	bool IsInWallGrind(); // Function Tiger.TigerCharacterMovementComponent.IsInWallGrind // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x125f290
	bool IsInLowVault(); // Function Tiger.TigerCharacterMovementComponent.IsInLowVault // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x125f260
	bool IsInLedgeGrab(); // Function Tiger.TigerCharacterMovementComponent.IsInLedgeGrab // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x125f230
	bool IsInAirDash(); // Function Tiger.TigerCharacterMovementComponent.IsInAirDash // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x125f200
	bool IsAimGliding(); // Function Tiger.TigerCharacterMovementComponent.IsAimGliding // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x125f1d0
	float GetTimeSinceStartedMovingFreely(); // Function Tiger.TigerCharacterMovementComponent.GetTimeSinceStartedMovingFreely // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x125f1a0
	float GetSlideSurfacePitch(); // Function Tiger.TigerCharacterMovementComponent.GetSlideSurfacePitch // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x125f170
	float GetLastDodgeTime(); // Function Tiger.TigerCharacterMovementComponent.GetLastDodgeTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xb33fc0
	float GetFloorPitch(); // Function Tiger.TigerCharacterMovementComponent.GetFloorPitch // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x125f000
	float GetAimGlideStrength(); // Function Tiger.TigerCharacterMovementComponent.GetAimGlideStrength // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x125efd0
	void FreezeMovement(); // Function Tiger.TigerCharacterMovementComponent.FreezeMovement // (Final|Native|Public|BlueprintCallable) // @ game+0x125efb0
	void DoForcedMove(struct FVector TargetLocation, float TravelTime, bool bInAir, float ExitVelocityScale, bool bAllowPlayerBreak, bool bAllowCancelOnArrival); // Function Tiger.TigerCharacterMovementComponent.DoForcedMove // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x125ed90
	void ApplyKnockback(struct FVector InVelocity); // Function Tiger.TigerCharacterMovementComponent.ApplyKnockback // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x125ed00
};

// Class Tiger.TigerSceneRenderItemWidget
// Size: 0x2f0 (Inherited: 0x280)
struct UTigerSceneRenderItemWidget : UTigerWidget {
	struct FMulticastInlineDelegate OnItemSpawned; // 0x280(0x10)
	struct FVector ItemSpawnLocation; // 0x290(0x0c)
	char pad_29C[0x4]; // 0x29c(0x04)
	SoftClassProperty DefaultItemClass; // 0x2a0(0x28)
	struct UMaterialInterface* RenderTargetMaterial; // 0x2c8(0x08)
	bool bOverrideItemRenderTarget; // 0x2d0(0x01)
	char pad_2D1[0x7]; // 0x2d1(0x07)
	struct AActor* SpawnedItem; // 0x2d8(0x08)
	char pad_2E0[0x10]; // 0x2e0(0x10)

	void SpawnItem(struct AActor* InActorClass); // Function Tiger.TigerSceneRenderItemWidget.SpawnItem // (Final|Native|Protected|BlueprintCallable) // @ game+0x132f340
	void OverrideRenderTextureTarget(struct AActor* InActor); // Function Tiger.TigerSceneRenderItemWidget.OverrideRenderTextureTarget // (Final|Native|Protected|BlueprintCallable) // @ game+0x132f090
	void OnItemSpawned__DelegateSignature(struct AActor* InSpawnedItem); // DelegateFunction Tiger.TigerSceneRenderItemWidget.OnItemSpawned__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x16c0340
	struct UTextureRenderTarget2D* GetRenderTextureFromMaterial(); // Function Tiger.TigerSceneRenderItemWidget.GetRenderTextureFromMaterial // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x132f020
};

// Class Tiger.TigerCharacterPaperDollWidget
// Size: 0x380 (Inherited: 0x2f0)
struct UTigerCharacterPaperDollWidget : UTigerSceneRenderItemWidget {
	struct FTigerCharacterAppearance Apperance; // 0x2f0(0x80)
	struct UTigerPlayerClanData* ClanData; // 0x370(0x08)
	bool bUseSharedPaperDoll; // 0x378(0x01)
	char pad_379[0x7]; // 0x379(0x07)

	void SetFromApperance(struct FTigerCharacterAppearance InApperance, struct UTigerPlayerClanData* InClanData, struct FDelegate InDelegate); // Function Tiger.TigerCharacterPaperDollWidget.SetFromApperance // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x125fba0
	void OnCharacterAppearanceUpdated__DelegateSignature(); // DelegateFunction Tiger.TigerCharacterPaperDollWidget.OnCharacterAppearanceUpdated__DelegateSignature // (Public|Delegate) // @ game+0x16c0340
	struct ATigerPaperDoll* GetPaperDoll(); // Function Tiger.TigerCharacterPaperDollWidget.GetPaperDoll // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x125f030
};

// Class Tiger.TigerPhysicalInteractionAnimationAsset
// Size: 0xf0 (Inherited: 0x30)
struct UTigerPhysicalInteractionAnimationAsset : UDataAsset {
	struct FTigerPhysicalInteractionMontages FeedingDataByVampireGender[0x2]; // 0x30(0xc0)
};

// Class Tiger.TigerPhysicalInteraction
// Size: 0x40 (Inherited: 0x28)
struct UTigerPhysicalInteraction : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	struct TWeakObjectPtr<struct ATigerPlayer> OtherPlayer; // 0x38(0x08)
};

// Class Tiger.TigerPhysicalInteractionDiablerize
// Size: 0x90 (Inherited: 0x40)
struct UTigerPhysicalInteractionDiablerize : UTigerPhysicalInteraction {
	float DiablerizeTime; // 0x40(0x04)
	bool bInstantInterrupt; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	struct UTigerPhysicalInteractionAnimationAsset* DiablerizeAnimationAsset; // 0x48(0x08)
	char pad_50[0x40]; // 0x50(0x40)
};

// Class Tiger.TigerPhysicalInteractionRevive
// Size: 0x48 (Inherited: 0x40)
struct UTigerPhysicalInteractionRevive : UTigerPhysicalInteraction {
	char pad_40[0x8]; // 0x40(0x08)
};

// Class Tiger.TigerCharacterPoseableMeshAnimInstance
// Size: 0x310 (Inherited: 0x2c0)
struct UTigerCharacterPoseableMeshAnimInstance : UAnimInstance {
	struct UTigerCharacterMeshManager* MeshManager; // 0x2b8(0x08)
	struct TMap<struct FName, struct FTigerCharacterPoseableMeshBoneData> NameToDataLut; // 0x2c0(0x50)

	void GetBoneOffsetTransform(struct FName InName, struct FVector OutLocation, struct FRotator OutRotation); // Function Tiger.TigerCharacterPoseableMeshAnimInstance.GetBoneOffsetTransform // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1263410
};

// Class Tiger.TigerCharacterPoseableMesh
// Size: 0x38 (Inherited: 0x28)
struct UTigerCharacterPoseableMesh : UObject {
	struct USkeletalMesh* Mesh; // 0x28(0x08)
	struct UTigerCharacterPoseableMeshAnimInstance* AnimClass; // 0x30(0x08)
};

// Class Tiger.TigerCharCustomizationComponent
// Size: 0x108 (Inherited: 0xb0)
struct UTigerCharCustomizationComponent : UActorComponent {
	struct FMulticastInlineDelegate OnAppearanceChanged; // 0xb0(0x10)
	char pad_C0[0x10]; // 0xc0(0x10)
	struct UTigerCharacterMeshManager* MeshManager; // 0xd0(0x08)
	struct UTigerClanCustomizationOptions* CustomizationOptions; // 0xd8(0x08)
	struct TArray<struct FTigerCharacterCustomizationParameters> AdditionalParametersToApply; // 0xe0(0x10)
	char pad_F0[0x11]; // 0xf0(0x11)
	enum class ETigerLodSplitMeshQuality MeshQuality; // 0x101(0x01)
	char pad_102[0x6]; // 0x102(0x06)

	void SetOutfitFromSetup(struct FTigerPersistentOutfitSetup OutfitSetup); // Function Tiger.TigerCharCustomizationComponent.SetOutfitFromSetup // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x1263d30
	void SetMeshManager(struct UTigerCharacterMeshManager* MeshManager); // Function Tiger.TigerCharCustomizationComponent.SetMeshManager // (Final|Native|Public|BlueprintCallable) // @ game+0x1263ca0
	void SetAppearanceByPreviewData(struct FTigerPreviewerData NewAppearance); // Function Tiger.TigerCharCustomizationComponent.SetAppearanceByPreviewData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1263bf0
	void SetAppearance(struct FTigerCharacterAppearance NewAppearance); // Function Tiger.TigerCharCustomizationComponent.SetAppearance // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1263b30
	void OnAppearanceChangedMulticast__DelegateSignature(); // DelegateFunction Tiger.TigerCharCustomizationComponent.OnAppearanceChangedMulticast__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x16c0340
	bool HasAppearanceBeenSet(); // Function Tiger.TigerCharCustomizationComponent.HasAppearanceBeenSet // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1263740
	struct UTigerCharacterTattooCustomization* GetTattoo(int32_t TattooIndex, bool bIsValid); // Function Tiger.TigerCharCustomizationComponent.GetTattoo // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1263660
	struct UTigerCharacterOutfitConfiguration* GetOutfitConfigurationByPath(SoftClassProperty OutfitClassPath); // Function Tiger.TigerCharCustomizationComponent.GetOutfitConfigurationByPath // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1263590
	struct FTigerPreviewerData GetAppearanceData(); // Function Tiger.TigerCharCustomizationComponent.GetAppearanceData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12633e0
};

// Class Tiger.TigerChatComponent
// Size: 0xe8 (Inherited: 0xb0)
struct UTigerChatComponent : UActorComponent {
	struct FSharkTokenBucket ClientMessageTokenBucket; // 0xb0(0x0c)
	struct FSharkTokenBucket ServerMessageTokenBucket; // 0xbc(0x0c)
	bool bIsChatBanned; // 0xc8(0x01)
	char pad_C9[0x1f]; // 0xc9(0x1f)

	bool TryGetMessageToken(float OutTimeUntilTokenAvailable); // Function Tiger.TigerChatComponent.TryGetMessageToken // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1264f00
	void Server_SetGeneralChatMute(bool bInShouldMuteGeneralChat); // Function Tiger.TigerChatComponent.Server_SetGeneralChatMute // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x1263aa0
	void Server_MutePlayer(struct FTigerPersistentPlayerID InPlayerId); // Function Tiger.TigerChatComponent.Server_MutePlayer // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1263a00
	void OnPersistentPlayerStateInitialized(struct ATigerPlayerController* InPlayerController); // Function Tiger.TigerChatComponent.OnPersistentPlayerStateInitialized // (Final|Native|Protected) // @ game+0x1263970
	void OnMuteStatusChanged(struct FTigerMuteInfo InMuteInfo); // Function Tiger.TigerChatComponent.OnMuteStatusChanged // (Final|Native|Protected|HasOutParms) // @ game+0x12638c0
	void OnChatMessageReceived(struct FTigerChatMessage InMessage); // Function Tiger.TigerChatComponent.OnChatMessageReceived // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x16c0340
	void OnBanStatusUpdated(struct FTigerMuteInfo InMuteInfo); // Function Tiger.TigerChatComponent.OnBanStatusUpdated // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x16c0340
	bool IsSoloMatch(); // Function Tiger.TigerChatComponent.IsSoloMatch // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1263760
	bool IsGeneralChatMuted(); // Function Tiger.TigerChatComponent.IsGeneralChatMuted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x122cc10
	struct FTigerMuteInfo GetMutedInfo(); // Function Tiger.TigerChatComponent.GetMutedInfo // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1263540
	void CreateChatWindow(); // Function Tiger.TigerChatComponent.CreateChatWindow // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void Client_ReceiveServerMessage(struct FString InServerMessage); // Function Tiger.TigerChatComponent.Client_ReceiveServerMessage // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1263340
	void Client_ReceiveChatMessage(struct FTigerChatMessage InMessage); // Function Tiger.TigerChatComponent.Client_ReceiveChatMessage // (Net|Native|Event|Public|NetClient) // @ game+0x1263200
};

// Class Tiger.TigerCheatManager
// Size: 0x78 (Inherited: 0x78)
struct UTigerCheatManager : UCheatManager {

	void TigerUpdateSeasonProgress(int32_t ExpToAdd, int32_t LevelsToAdd); // Function Tiger.TigerCheatManager.TigerUpdateSeasonProgress // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1264e30
	void TigerUnlockThrall(enum class ETigerThrallId InThrallId); // Function Tiger.TigerCheatManager.TigerUnlockThrall // (Final|Exec|Native|Public) // @ game+0x1264db0
	void TigerUnlockAllThralls(); // Function Tiger.TigerCheatManager.TigerUnlockAllThralls // (Final|Exec|Native|Public) // @ game+0xb45020
	void TigerUnlockAllSkills(); // Function Tiger.TigerCheatManager.TigerUnlockAllSkills // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb45020
	void TigerUnlockAllItemsInDatabase(); // Function Tiger.TigerCheatManager.TigerUnlockAllItemsInDatabase // (Final|Exec|Native|Public) // @ game+0xb45020
	void TigerToggleVisualLogger(); // Function Tiger.TigerCheatManager.TigerToggleVisualLogger // (Final|Exec|Native|Public) // @ game+0xb45020
	void TigerToggleNoAggro(); // Function Tiger.TigerCheatManager.TigerToggleNoAggro // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb45020
	void TigerToggleClientSideHitDetectionRanged(); // Function Tiger.TigerCheatManager.TigerToggleClientSideHitDetectionRanged // (Final|Exec|Native|Public) // @ game+0xb45020
	void TigerToggleClientSideHitDetectionMelee(); // Function Tiger.TigerCheatManager.TigerToggleClientSideHitDetectionMelee // (Final|Exec|Native|Public) // @ game+0xb45020
	void TigerThrallTickAllStatModifiers(); // Function Tiger.TigerCheatManager.TigerThrallTickAllStatModifiers // (Final|Exec|Native|Public) // @ game+0xb45020
	void TigerThrallMissionUpdateAll(); // Function Tiger.TigerCheatManager.TigerThrallMissionUpdateAll // (Final|Exec|Native|Public) // @ game+0xb45020
	void TigerThrallMissionStatusChange(int32_t InThrallMissionId, bool bIsActive); // Function Tiger.TigerCheatManager.TigerThrallMissionStatusChange // (Final|Exec|Native|Public) // @ game+0x1264990
	void TigerThrallMissionAdvanceTurns(int32_t InThrallMissionId, uint32_t InTurns); // Function Tiger.TigerCheatManager.TigerThrallMissionAdvanceTurns // (Final|Exec|Native|Public) // @ game+0x1264ce0
	void TigerThrallAddStatModifier(char InSlotIndex, struct FName InModifierName); // Function Tiger.TigerCheatManager.TigerThrallAddStatModifier // (Final|Exec|Native|Public) // @ game+0x1264c10
	void TigerTeleportToCameraLink(); // Function Tiger.TigerCheatManager.TigerTeleportToCameraLink // (Final|Exec|Native|Public) // @ game+0xb45020
	void TigerSubmitChallengeProgress(); // Function Tiger.TigerCheatManager.TigerSubmitChallengeProgress // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb45020
	void TigerStartQuest(struct FString InQuestlineId, struct FString InQuestId); // Function Tiger.TigerCheatManager.TigerStartQuest // (Final|Exec|Native|Public) // @ game+0x12642f0
	void TigerSpawnNpcAtCursorWithPotency(struct FName NPCType, enum class ETigerBloodPotency InPotency, enum class ETigerBloodType InBloodType); // Function Tiger.TigerCheatManager.TigerSpawnNpcAtCursorWithPotency // (Final|Exec|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1264af0
	void TigerSpawnNpcAtCursor(struct FName NPCType); // Function Tiger.TigerCheatManager.TigerSpawnNpcAtCursor // (Final|Exec|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1264a60
	void TigerSleep(float SleepMs); // Function Tiger.TigerCheatManager.TigerSleep // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x12644d0
	void TigerSkipPsoCaching(); // Function Tiger.TigerCheatManager.TigerSkipPsoCaching // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb45020
	void TigerShowMatchTimer(); // Function Tiger.TigerCheatManager.TigerShowMatchTimer // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb45020
	void TigerShowDoNotUseMeshes(); // Function Tiger.TigerCheatManager.TigerShowDoNotUseMeshes // (Final|Exec|Native|Public) // @ game+0xb45020
	void TigerShowActiveAnimationsOnActors(bool bShouldShow); // Function Tiger.TigerCheatManager.TigerShowActiveAnimationsOnActors // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x124be70
	void TigerSetWeatherScenario(struct FString InScenarioName); // Function Tiger.TigerCheatManager.TigerSetWeatherScenario // (Final|Exec|Native|Public) // @ game+0x1263e90
	void TigerSetSessionProgressToBattlepassLevel(int32_t InLevel, bool bInShouldOwnBattlepass); // Function Tiger.TigerCheatManager.TigerSetSessionProgressToBattlepassLevel // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1264990
	void TigerSetMatchesPlayed(int32_t InNumberMatches); // Function Tiger.TigerCheatManager.TigerSetMatchesPlayed // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1263e00
	void TigerSetCharacterData(struct FString ClanText, int32_t PowerKitIndex, struct FString GenderText); // Function Tiger.TigerCheatManager.TigerSetCharacterData // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1264850
	void TigerSetAppearance(struct FString AppearanceText); // Function Tiger.TigerCheatManager.TigerSetAppearance // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1263e90
	void TigerServerCrash(); // Function Tiger.TigerCheatManager.TigerServerCrash // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb45020
	void TigerSerializeStatistics(); // Function Tiger.TigerCheatManager.TigerSerializeStatistics // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb45020
	void TigerResetQuests(); // Function Tiger.TigerCheatManager.TigerResetQuests // (Final|Exec|Native|Public) // @ game+0xb45020
	void TigerRemoveThrall(char InSlot); // Function Tiger.TigerCheatManager.TigerRemoveThrall // (Final|Exec|Native|Public) // @ game+0x12647d0
	void TigerRemoveHolyIncense(); // Function Tiger.TigerCheatManager.TigerRemoveHolyIncense // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb45020
	void TigerRemoveAllThralls(); // Function Tiger.TigerCheatManager.TigerRemoveAllThralls // (Final|Exec|Native|Public) // @ game+0xb45020
	void TigerRegisterGrimoireEntryAsUnread(struct FString InGrimoireEntryId); // Function Tiger.TigerCheatManager.TigerRegisterGrimoireEntryAsUnread // (Final|Exec|Native|Public) // @ game+0x12646e0
	void TigerRegisterGrimoireEntryAsUnlocked(struct FString InGrimoireEntryId); // Function Tiger.TigerCheatManager.TigerRegisterGrimoireEntryAsUnlocked // (Final|Exec|Native|Public) // @ game+0x12646e0
	void TigerRegisterGrimoireEntryAsRead(struct FString InGrimoireEntryId); // Function Tiger.TigerCheatManager.TigerRegisterGrimoireEntryAsRead // (Final|Exec|Native|Public) // @ game+0x12646e0
	void TigerRegisterGrimoireEntryAsLocked(struct FString InGrimoireEntryId); // Function Tiger.TigerCheatManager.TigerRegisterGrimoireEntryAsLocked // (Final|Exec|Native|Public) // @ game+0x12646e0
	void TigerRegisterAllGrimoireEntriesAsUnread(); // Function Tiger.TigerCheatManager.TigerRegisterAllGrimoireEntriesAsUnread // (Final|Exec|Native|Public) // @ game+0xb45020
	void TigerRegisterAllGrimoireEntriesAsUnlocked(); // Function Tiger.TigerCheatManager.TigerRegisterAllGrimoireEntriesAsUnlocked // (Final|Exec|Native|Public) // @ game+0xb45020
	void TigerRegisterAllGrimoireEntriesAsRead(); // Function Tiger.TigerCheatManager.TigerRegisterAllGrimoireEntriesAsRead // (Final|Exec|Native|Public) // @ game+0xb45020
	void TigerRegisterAllGrimoireEntriesAsLocked(); // Function Tiger.TigerCheatManager.TigerRegisterAllGrimoireEntriesAsLocked // (Final|Exec|Native|Public) // @ game+0xb45020
	void TigerRainAmount(float RainAmount); // Function Tiger.TigerCheatManager.TigerRainAmount // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x12644d0
	void TigerQuitTutorial(); // Function Tiger.TigerCheatManager.TigerQuitTutorial // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb45020
	void TigerPrintCompleteQuestInfo(); // Function Tiger.TigerCheatManager.TigerPrintCompleteQuestInfo // (Final|Exec|Native|Public) // @ game+0xb45020
	void TigerPrintActiveQuestInfo(); // Function Tiger.TigerCheatManager.TigerPrintActiveQuestInfo // (Final|Exec|Native|Public) // @ game+0xb45020
	void TigerListThrallTrueStats(); // Function Tiger.TigerCheatManager.TigerListThrallTrueStats // (Final|Exec|Native|Public) // @ game+0xb45020
	void TigerListThralls(); // Function Tiger.TigerCheatManager.TigerListThralls // (Final|Exec|Native|Public) // @ game+0xb45020
	void TigerListSoftCurrencies(); // Function Tiger.TigerCheatManager.TigerListSoftCurrencies // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb45020
	void TigerListPlayerCharacters(); // Function Tiger.TigerCheatManager.TigerListPlayerCharacters // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb45020
	void TigerIncrementPremiumCurrency(uint64_t InAmountToAdd); // Function Tiger.TigerCheatManager.TigerIncrementPremiumCurrency // (Final|Exec|Native|Public) // @ game+0x1264650
	void TigerFreeReload(); // Function Tiger.TigerCheatManager.TigerFreeReload // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb45020
	void TigerEnableStatisticsGathering(bool bShouldBeEnabled); // Function Tiger.TigerCheatManager.TigerEnableStatisticsGathering // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x124be70
	void TigerDisableDisciplineCost(); // Function Tiger.TigerCheatManager.TigerDisableDisciplineCost // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb45020
	void TigerDestroyNpcWithinRadiusIgnoreDebugTarget(float InRadius); // Function Tiger.TigerCheatManager.TigerDestroyNpcWithinRadiusIgnoreDebugTarget // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x12645d0
	void TigerDestroyNpcWithinRadius(float Radius); // Function Tiger.TigerCheatManager.TigerDestroyNpcWithinRadius // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1264550
	void TigerDebugDrawPlayerGrid(float DebugDrawLifetime); // Function Tiger.TigerCheatManager.TigerDebugDrawPlayerGrid // (Final|Exec|Native|Public) // @ game+0x12644d0
	void TigerCreateDefaultCharacterAtSlot(struct FString InArchetypeName, char InCharacterSlot); // Function Tiger.TigerCheatManager.TigerCreateDefaultCharacterAtSlot // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x12643f0
	void TigerCrash(); // Function Tiger.TigerCheatManager.TigerCrash // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb45020
	void TigerCompleteQuest(struct FString InQuestlineId, struct FString InQuestId); // Function Tiger.TigerCheatManager.TigerCompleteQuest // (Final|Exec|Native|Public) // @ game+0x12642f0
	void TigerCompleteNextChallengeWeekly(); // Function Tiger.TigerCheatManager.TigerCompleteNextChallengeWeekly // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb45020
	void TigerCompleteNextChallengeDaily(); // Function Tiger.TigerCheatManager.TigerCompleteNextChallengeDaily // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb45020
	void TigerClearInGameTalents(); // Function Tiger.TigerCheatManager.TigerClearInGameTalents // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb45020
	void TigerChangeThrallStats(char InSlotIndex, int32_t InPerception, int32_t InCommitment, int32_t InDominance, int32_t InSociability, int32_t InProficiency, int32_t InStealth, int32_t InStamina, int32_t InCombat); // Function Tiger.TigerCheatManager.TigerChangeThrallStats // (Final|Exec|Native|Public) // @ game+0x1264060
	void TigerBringMeHome(); // Function Tiger.TigerCheatManager.TigerBringMeHome // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0xb45020
	void TigerBreakMasquerade(); // Function Tiger.TigerCheatManager.TigerBreakMasquerade // (Final|Exec|Native|Public) // @ game+0xb45020
	void TigerAddSoftCurrency(int32_t InAmount, struct FString InCurrencyIdAsString); // Function Tiger.TigerCheatManager.TigerAddSoftCurrency // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1263f30
	void TigerAddInGameTalent(struct FString TalentToAdd); // Function Tiger.TigerCheatManager.TigerAddInGameTalent // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1263e90
	void TigerAddInGameLevels(int32_t InNumLevels); // Function Tiger.TigerCheatManager.TigerAddInGameLevels // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1263e00
	void TigerAddExperience(int32_t ExperienceAmount); // Function Tiger.TigerCheatManager.TigerAddExperience // (Final|Exec|Native|Public|BlueprintCallable) // @ game+0x1263e00
	void OnGetPlayerCharactersRsp(struct TArray<struct FTigerPersistentPlayerCharacter> InCharacters, struct FString InErrorString); // Function Tiger.TigerCheatManager.OnGetPlayerCharactersRsp // (Final|Native|Public|HasOutParms) // @ game+0x1263790
};

// Class Tiger.TigerClanLevelWidget
// Size: 0x268 (Inherited: 0x260)
struct UTigerClanLevelWidget : UUserWidget {
	char pad_260[0x8]; // 0x260(0x08)

	void UpdateClanLevel(enum class ETigerClan Clan); // Function Tiger.TigerClanLevelWidget.UpdateClanLevel // (Final|Native|Private|BlueprintCallable) // @ game+0x126a9f0
	void OnClanLevelUpdated(int32_t NewClanLevel); // Function Tiger.TigerClanLevelWidget.OnClanLevelUpdated // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	int32_t GetCurrentClanLevel(); // Function Tiger.TigerClanLevelWidget.GetCurrentClanLevel // (Final|Native|Private|BlueprintCallable|BlueprintPure|Const) // @ game+0x1269a40
};

// Class Tiger.TigerInteractiveObject
// Size: 0x280 (Inherited: 0x228)
struct ATigerInteractiveObject : AActor {
	bool bHasInteractionTrigger; // 0x228(0x01)
	bool bHasEnterVolumeTrigger; // 0x229(0x01)
	bool bHasShootingTrigger; // 0x22a(0x01)
	char pad_22B[0x5]; // 0x22b(0x05)
	struct FText InteractionText; // 0x230(0x18)
	struct UBoxComponent* InteractionVolume; // 0x248(0x08)
	struct UBoxComponent* EnterVolume; // 0x250(0x08)
	struct UBoxComponent* ShootingVolume; // 0x258(0x08)
	float InteractionTime; // 0x260(0x04)
	char pad_264[0x4]; // 0x264(0x04)
	struct USceneComponent* SceneRoot; // 0x268(0x08)
	char pad_270[0x8]; // 0x270(0x08)
	enum class EInteractiveObjectState InteractionState; // 0x278(0x01)
	char pad_279[0x3]; // 0x279(0x03)
	float CurrentInteractionTimeLeft; // 0x27c(0x04)

	void UpdateDuration(float DeltaSeconds); // Function Tiger.TigerInteractiveObject.UpdateDuration // (Final|Native|Public|BlueprintCallable) // @ game+0x12afe00
	void SleepInteraction(); // Function Tiger.TigerInteractiveObject.SleepInteraction // (Native|Public|BlueprintCallable) // @ game+0x12afc40
	void OnRep_Interaction(enum class EInteractiveObjectState OldState); // Function Tiger.TigerInteractiveObject.OnRep_Interaction // (Final|Native|Public) // @ game+0x12af160
	void OnJumpToFinalState(); // Function Tiger.TigerInteractiveObject.OnJumpToFinalState // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void OnInteract(enum class EInteractiveObjectState ActivatedTrigger); // Function Tiger.TigerInteractiveObject.OnInteract // (Native|Event|Public|BlueprintEvent) // @ game+0x12af0e0
	void Multicast_SetInteractionState(enum class EInteractiveObjectState NewState); // Function Tiger.TigerInteractiveObject.Multicast_SetInteractionState // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x12aefd0
	void Interact(enum class EInteractiveObjectState ActivatedTrigger, struct UTigerInteractionControllerComponent* Interacter); // Function Tiger.TigerInteractiveObject.Interact // (Native|Public|BlueprintCallable) // @ game+0x12aeda0
	bool HasDuration(); // Function Tiger.TigerInteractiveObject.HasDuration // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12aeb70
	enum class EInteractiveObjectState GetInteractionState(); // Function Tiger.TigerInteractiveObject.GetInteractionState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12ae110
	void CancelInteraction(struct UTigerInteractionControllerComponent* Interacter); // Function Tiger.TigerInteractiveObject.CancelInteraction // (Native|Public|BlueprintCallable) // @ game+0x12ad3a0
	void BeginOverlappedProjectile(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function Tiger.TigerInteractiveObject.BeginOverlappedProjectile // (Final|Native|Private|HasOutParms) // @ game+0x12ad170
	void BeginOverlappedCharacter(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function Tiger.TigerInteractiveObject.BeginOverlappedCharacter // (Final|Native|Private|HasOutParms) // @ game+0x12acf40
};

// Class Tiger.TigerClientInteractiveObject
// Size: 0x290 (Inherited: 0x280)
struct ATigerClientInteractiveObject : ATigerInteractiveObject {
	char pad_280[0x10]; // 0x280(0x10)
};

// Class Tiger.TigerClientInteractiveSpawner
// Size: 0x328 (Inherited: 0x228)
struct ATigerClientInteractiveSpawner : AActor {
	char pad_228[0xb0]; // 0x228(0xb0)
	struct TMap<uint32_t, struct FClientSpawnData> PendingCreationQueue; // 0x2d8(0x50)

	void Server_ValidateInteraction(struct UTigerInteractionControllerComponent* InInteractor, uint32_t InClientObjectUID); // Function Tiger.TigerClientInteractiveSpawner.Server_ValidateInteraction // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x126a790
	void OnClientObjectDestroyed(struct AActor* InDestroyedActor); // Function Tiger.TigerClientInteractiveSpawner.OnClientObjectDestroyed // (Final|Native|Private) // @ game+0x126a000
	void Client_SpawnInteractiveObjects(struct TArray<struct FClientSpawnData> InSpawnList); // Function Tiger.TigerClientInteractiveSpawner.Client_SpawnInteractiveObjects // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x12695a0
	void Client_OnInteractionValidated(struct UTigerInteractionControllerComponent* InInteractor, uint32_t InClientObjectUID, bool InSuccess); // Function Tiger.TigerClientInteractiveSpawner.Client_OnInteractionValidated // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x1269400
	void Client_DestroyInteractiveObjects(struct TArray<uint32_t> InDestroyList); // Function Tiger.TigerClientInteractiveSpawner.Client_DestroyInteractiveObjects // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x1269360
};

// Class Tiger.TigerPushConnectionManager
// Size: 0xa8 (Inherited: 0x28)
struct UTigerPushConnectionManager : UObject {
	struct UTigerGameInstance* GameInstance; // 0x28(0x08)
	char pad_30[0x78]; // 0x30(0x78)
};

// Class Tiger.TigerClientPushConnectionManager
// Size: 0xf8 (Inherited: 0xa8)
struct UTigerClientPushConnectionManager : UTigerPushConnectionManager {
	char pad_A8[0x50]; // 0xa8(0x50)
};

// Class Tiger.TigerClimbablePipe
// Size: 0x230 (Inherited: 0x228)
struct ATigerClimbablePipe : AActor {
	char pad_228[0x8]; // 0x228(0x08)
};

// Class Tiger.TigerCollectibleProgressCache
// Size: 0x78 (Inherited: 0x28)
struct UTigerCollectibleProgressCache : UObject {
	char pad_28[0x50]; // 0x28(0x50)
};

// Class Tiger.TigerCollectibleData
// Size: 0x90 (Inherited: 0x30)
struct UTigerCollectibleData : UDataAsset {
	uint32_t CollectibleId; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct FText CollectibleName; // 0x38(0x18)
	struct FText CollectibleDescription; // 0x50(0x18)
	int32_t TotalRequired; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
	struct UTigerGrimoireEntry* GrimoireEntryToUnlock; // 0x70(0x08)
	struct UTigerCollectibleGrimoireEntrySet* GrimoireEntrySet; // 0x78(0x08)
	struct TArray<struct FTigerItemId> RewardIds; // 0x80(0x10)
};

// Class Tiger.TigerCollectibleGrimoireEntrySet
// Size: 0x40 (Inherited: 0x30)
struct UTigerCollectibleGrimoireEntrySet : UDataAsset {
	struct TArray<struct UTigerGrimoireEntry*> Set; // 0x30(0x10)
};

// Class Tiger.TigerCollectibleSystem
// Size: 0x150 (Inherited: 0xb0)
struct UTigerCollectibleSystem : UActorComponent {
	struct UTigerExperienceEvent* CollectiblePickupExpEvent; // 0xb0(0x08)
	struct UTigerItemAsset* GenericCollectibleItemAsset; // 0xb8(0x08)
	char pad_C0[0x90]; // 0xc0(0x90)

	void Server_AwardCollectible(struct UTigerCollectibleData* InCollectible); // Function Tiger.TigerCollectibleSystem.Server_AwardCollectible // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x122cfe0
	void ProcessCollectible(struct FText InCollectibleId); // Function Tiger.TigerCollectibleSystem.ProcessCollectible // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x126a1a0
	struct UTigerCollectibleData* GetCollectibleWithName(struct FText InCollectibleName); // Function Tiger.TigerCollectibleSystem.GetCollectibleWithName // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1269810
	void Client_ProcessCollectible(uint32_t InCollectibleId); // Function Tiger.TigerCollectibleSystem.Client_ProcessCollectible // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1269510
};

// Class Tiger.TigerCollectibleSystemSettings
// Size: 0x60 (Inherited: 0x38)
struct UTigerCollectibleSystemSettings : UDeveloperSettings {
	struct TSoftObjectPtr<struct UDataTable> CollectiblesTable; // 0x38(0x28)

	bool IsTableReady(); // Function Tiger.TigerCollectibleSystemSettings.IsTableReady // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1269c70
	struct UDataTable* GetCollectiblesTable(); // Function Tiger.TigerCollectibleSystemSettings.GetCollectiblesTable // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x12698f0
};

// Class Tiger.TigerMaxIntAggregator
// Size: 0x40 (Inherited: 0x28)
struct UTigerMaxIntAggregator : UObject {
	char pad_28[0x18]; // 0x28(0x18)

	void RemoveValue(int32_t Value); // Function Tiger.TigerMaxIntAggregator.RemoveValue // (Final|Native|Private|BlueprintCallable) // @ game+0x126a530
	void AddValue(int32_t Value); // Function Tiger.TigerMaxIntAggregator.AddValue // (Final|Native|Private|BlueprintCallable) // @ game+0x12691f0
};

// Class Tiger.TigerFloatMinAggregator
// Size: 0x40 (Inherited: 0x28)
struct UTigerFloatMinAggregator : UObject {
	char pad_28[0x18]; // 0x28(0x18)

	void RemoveValue(float Value); // Function Tiger.TigerFloatMinAggregator.RemoveValue // (Final|Native|Private|BlueprintCallable) // @ game+0x126a350
	void AddValue(float Value); // Function Tiger.TigerFloatMinAggregator.AddValue // (Final|Native|Private|BlueprintCallable) // @ game+0x1269090
};

// Class Tiger.TigerFloatAverageAggregator
// Size: 0x40 (Inherited: 0x28)
struct UTigerFloatAverageAggregator : UObject {
	char pad_28[0x18]; // 0x28(0x18)

	void RemoveValue(float Value); // Function Tiger.TigerFloatAverageAggregator.RemoveValue // (Final|Native|Private|BlueprintCallable) // @ game+0x126a350
	void AddValue(float Value); // Function Tiger.TigerFloatAverageAggregator.AddValue // (Final|Native|Private|BlueprintCallable) // @ game+0x1269090
};

// Class Tiger.TigerFloatMultiplierAggregator
// Size: 0x40 (Inherited: 0x28)
struct UTigerFloatMultiplierAggregator : UObject {
	char pad_28[0x18]; // 0x28(0x18)

	void RemoveValue(float Value); // Function Tiger.TigerFloatMultiplierAggregator.RemoveValue // (Final|Native|Private|BlueprintCallable) // @ game+0x126a350
	void AddValue(float Value); // Function Tiger.TigerFloatMultiplierAggregator.AddValue // (Final|Native|Private|BlueprintCallable) // @ game+0x1269090
};

// Class Tiger.TigerBoolAnyAggregator
// Size: 0x40 (Inherited: 0x28)
struct UTigerBoolAnyAggregator : UObject {
	char pad_28[0x18]; // 0x28(0x18)

	void RemoveValue(bool Value); // Function Tiger.TigerBoolAnyAggregator.RemoveValue // (Final|Native|Private|BlueprintCallable) // @ game+0x126a270
	void AddValue(bool Value); // Function Tiger.TigerBoolAnyAggregator.AddValue // (Final|Native|Private|BlueprintCallable) // @ game+0x1268fe0
};

// Class Tiger.TigerFloatCurveMultiplierAggregator
// Size: 0x40 (Inherited: 0x28)
struct UTigerFloatCurveMultiplierAggregator : UObject {
	char pad_28[0x18]; // 0x28(0x18)

	void RemoveValue(struct UCurveFloat* Value); // Function Tiger.TigerFloatCurveMultiplierAggregator.RemoveValue // (Final|Native|Private|BlueprintCallable) // @ game+0x126a430
	void AddValue(struct UCurveFloat* Value); // Function Tiger.TigerFloatCurveMultiplierAggregator.AddValue // (Final|Native|Private|BlueprintCallable) // @ game+0x1269140
};

// Class Tiger.TigerCombatComponent
// Size: 0x148 (Inherited: 0xb0)
struct UTigerCombatComponent : UActorComponent {
	struct UTigerWeapon* DefaultUnarmedWeaponClass; // 0xb0(0x08)
	struct UTigerItemAsset* DefaultMeleeItemAsset; // 0xb8(0x08)
	struct UTigerItemAsset* DefaultRangedItemAsset; // 0xc0(0x08)
	uint32_t DefaultRangedStartingAmmo; // 0xc8(0x04)
	char pad_CC[0x4]; // 0xcc(0x04)
	struct FMulticastInlineDelegate OnEnterCombat; // 0xd0(0x10)
	struct FMulticastInlineDelegate OnLeaveCombat; // 0xe0(0x10)
	struct UTigerWeapon* CurrentWeaponClass; // 0xf0(0x08)
	struct UTigerMeleeWeapon* CurrentMeleeWeaponClass; // 0xf8(0x08)
	struct UTigerWeapon* CurrentVisibleWeaponClass; // 0x100(0x08)
	float OutOfCombatTime; // 0x108(0x04)
	float EnterCombatEmissiveStrength; // 0x10c(0x04)
	float ExitCombatEmissiveStrength; // 0x110(0x04)
	struct FName CombatMaterialParameterName; // 0x114(0x08)
	char pad_11C[0xc]; // 0x11c(0x0c)
	float EntityDetectionSphere; // 0x128(0x04)
	char pad_12C[0x8]; // 0x12c(0x08)
	char CombatState; // 0x134(0x01)
	char pad_135[0x13]; // 0x135(0x13)

	void OnRep_CombatStateChanged(); // Function Tiger.TigerCombatComponent.OnRep_CombatStateChanged // (Final|Native|Private) // @ game+0x126a0b0
	void OnCombatAction(); // Function Tiger.TigerCombatComponent.OnCombatAction // (Final|Native|Private|BlueprintCallable) // @ game+0x126a090
	void Multicast_SetCurrentMeleeWeaponClass(struct UTigerMeleeWeapon* MeleeWeaponClass); // Function Tiger.TigerCombatComponent.Multicast_SetCurrentMeleeWeaponClass // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1269e10
	void Multicast_OnDesiredWeaponChanged(struct UTigerWeapon* WeaponClass, struct UTigerWeapon* MeleeWeaponClass, bool bInstantSwitch); // Function Tiger.TigerCombatComponent.Multicast_OnDesiredWeaponChanged // (Net|NetReliableNative|Event|NetMulticast|Public|NetValidate) // @ game+0x1269cd0
	bool IsInCombat(); // Function Tiger.TigerCombatComponent.IsInCombat // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1269c10
	bool HasEquippedWeapon(); // Function Tiger.TigerCombatComponent.HasEquippedWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1269bc0
	enum class ETigerEquippedWeaponType GetEquippedWeaponType(); // Function Tiger.TigerCombatComponent.GetEquippedWeaponType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1269b30
	struct UTigerWeapon* GetCurrentWeaponClassDefaultObject(); // Function Tiger.TigerCombatComponent.GetCurrentWeaponClassDefaultObject // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1269ae0
	struct UTigerWeapon* GetCurrentWeaponClass(); // Function Tiger.TigerCombatComponent.GetCurrentWeaponClass // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1269ac0
	struct UTigerMeleeWeapon* GetCurrentMeleeWeaponClassDefaultObject(); // Function Tiger.TigerCombatComponent.GetCurrentMeleeWeaponClassDefaultObject // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1269a90
	struct UTigerMeleeWeapon* GetCurrentMeleeWeaponClass(); // Function Tiger.TigerCombatComponent.GetCurrentMeleeWeaponClass // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1269a70
	bool EquipWeapon(enum class ETigerWeaponSlot Slot, struct UTigerWeapon* WeaponClass, bool bInstantSwitch); // Function Tiger.TigerCombatComponent.EquipWeapon // (Final|Native|Public|BlueprintCallable) // @ game+0x1269700
	void CheckForCombat(); // Function Tiger.TigerCombatComponent.CheckForCombat // (Final|Native|Public|BlueprintCallable) // @ game+0x1269340
};

// Class Tiger.TigerCompassMarkerComponent
// Size: 0xd8 (Inherited: 0xb0)
struct UTigerCompassMarkerComponent : UActorComponent {
	struct UTigerCompassMarkerWidget* CompassMarkerWidget; // 0xb0(0x08)
	struct UTexture2D* MarkerTexture; // 0xb8(0x08)
	bool bShouldShowByDefault; // 0xc0(0x01)
	char pad_C1[0x17]; // 0xc1(0x17)

	void Show(); // Function Tiger.TigerCompassMarkerComponent.Show // (Final|Native|Public|BlueprintCallable) // @ game+0x126a860
	void Hide(); // Function Tiger.TigerCompassMarkerComponent.Hide // (Final|Native|Public|BlueprintCallable) // @ game+0x1269bf0
};

// Class Tiger.TigerCompassMarkerWidget
// Size: 0x298 (Inherited: 0x280)
struct UTigerCompassMarkerWidget : UTigerWidget {
	struct FVector MarkerWorldLocation; // 0x280(0x0c)
	char pad_28C[0x4]; // 0x28c(0x04)
	struct UTexture2D* MarkerTexture; // 0x290(0x08)

	void SetColorBasedOnPlayerIndex(char InIndex); // Function Tiger.TigerCompassMarkerWidget.SetColorBasedOnPlayerIndex // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	float GetRelativeAngleOnCompass(); // Function Tiger.TigerCompassMarkerWidget.GetRelativeAngleOnCompass // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1269b60
};

// Class Tiger.TigerCompassUI
// Size: 0x280 (Inherited: 0x280)
struct UTigerCompassUI : UTigerWidget {

	void ShowCompassObject(struct UTigerCompassMarkerWidget* CompassObject); // Function Tiger.TigerCompassUI.ShowCompassObject // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void HideCompassObject(struct UTigerCompassMarkerWidget* CompassObject); // Function Tiger.TigerCompassUI.HideCompassObject // (Event|Public|BlueprintEvent) // @ game+0x16c0340
};

// Class Tiger.TigerItemAsset
// Size: 0x128 (Inherited: 0x30)
struct UTigerItemAsset : UDataAsset {
	char pad_30[0x8]; // 0x30(0x08)
	struct UStaticMesh* StaticMesh; // 0x38(0x08)
	enum class ETigerInventoryItemType ItemType; // 0x40(0x01)
	enum class ETigerItemRarity ItemRarity; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
	struct FText Name; // 0x48(0x18)
	struct FText ShortName; // 0x60(0x18)
	int32_t MaxStackSize; // 0x78(0x04)
	int32_t DropFromStackCount; // 0x7c(0x04)
	struct FText Description; // 0x80(0x18)
	struct UTigerItemAsset* LowerRarity; // 0x98(0x08)
	int32_t SortWithinCategoryAscending; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct FText TooltipItemType; // 0xa8(0x18)
	struct UTexture2D* UIIcon; // 0xc0(0x08)
	struct UTexture2D* HUDIcon; // 0xc8(0x08)
	struct UTigerWeapon* WeaponClass; // 0xd0(0x08)
	struct UTigerBuff* ItemBuff; // 0xd8(0x08)
	bool bShouldAutoPickUpItem; // 0xe0(0x01)
	bool bTriggerBuffOnItemPickup; // 0xe1(0x01)
	bool bRemoveBuffOnItemDropped; // 0xe2(0x01)
	char pad_E3[0x5]; // 0xe3(0x05)
	struct UAkAudioEvent* PingWantVoiceAudioEvent; // 0xe8(0x08)
	struct UAkAudioEvent* PingHaveVoiceAudioEvent; // 0xf0(0x08)
	struct UAkAudioEvent* PingHereVoiceAudioEvent; // 0xf8(0x08)
	struct UAkAudioEvent* PickUpAudioEvent; // 0x100(0x08)
	uint64_t PersistentTelemetryID; // 0x108(0x08)
	struct UTigerGrimoireEntry* EntryToUnlock; // 0x110(0x08)
	struct FString EntryId; // 0x118(0x10)

	enum class ETigerWeaponType GetWeaponType(); // Function Tiger.TigerItemAsset.GetWeaponType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12ba970
	struct UTigerWeapon* GetWeaponClassDefaultObject(); // Function Tiger.TigerItemAsset.GetWeaponClassDefaultObject // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12ba840
	struct UTexture2D* GetHUDIcon(); // Function Tiger.TigerItemAsset.GetHUDIcon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12ba500
	struct FText GetDescription(); // Function Tiger.TigerItemAsset.GetDescription // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12ba470
	bool CanBeDropped(); // Function Tiger.TigerItemAsset.CanBeDropped // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12ba360
};

// Class Tiger.TigerConsumableAsset
// Size: 0x170 (Inherited: 0x128)
struct UTigerConsumableAsset : UTigerItemAsset {
	struct UAnimMontage* Montage; // 0x128(0x08)
	bool bCanBeUsedWhileMoving; // 0x130(0x01)
	char pad_131[0x3]; // 0x131(0x03)
	float UseTime; // 0x134(0x04)
	int32_t MaxStack; // 0x138(0x04)
	char pad_13C[0x4]; // 0x13c(0x04)
	struct UAkAudioEvent* BeginUseAudioEvent; // 0x140(0x08)
	struct UAkAudioEvent* UseSuccessfulAudioEvent; // 0x148(0x08)
	struct UAkAudioEvent* UseFailedAudioEvent; // 0x150(0x08)
	struct UTigerCharacterEffect* SuccessfulUseCharacterEffect; // 0x158(0x08)
	struct ATigerBuffPostProcess* BeginUsePostProcess; // 0x160(0x08)
	struct ATigerBuffPostProcess* SuccessfulBuffPostProcess; // 0x168(0x08)
};

// Class Tiger.TigerHealingConsumableAsset
// Size: 0x178 (Inherited: 0x170)
struct UTigerHealingConsumableAsset : UTigerConsumableAsset {
	float HealAmount; // 0x170(0x04)
	char pad_174[0x4]; // 0x174(0x04)
};

// Class Tiger.TigerBuffingConsumableAsset
// Size: 0x178 (Inherited: 0x170)
struct UTigerBuffingConsumableAsset : UTigerConsumableAsset {
	struct UTigerBuff* BuffToApply; // 0x170(0x08)
};

// Class Tiger.TigerRevealItemConsumableAsset
// Size: 0x178 (Inherited: 0x170)
struct UTigerRevealItemConsumableAsset : UTigerConsumableAsset {
	float MaxDistanceToItem; // 0x170(0x04)
	char pad_174[0x4]; // 0x174(0x04)
};

// Class Tiger.TigerSupplyDropConsumableAsset
// Size: 0x188 (Inherited: 0x170)
struct UTigerSupplyDropConsumableAsset : UTigerConsumableAsset {
	struct AActor* SupplyDropFlare; // 0x170(0x08)
	struct AActor* SupplyDropHelicopterActor; // 0x178(0x08)
	float DistanceFromPlayer; // 0x180(0x04)
	float Height; // 0x184(0x04)
};

// Class Tiger.TigerConsumablesComponent
// Size: 0x188 (Inherited: 0xb0)
struct UTigerConsumablesComponent : UActorComponent {
	struct FMulticastInlineDelegate OnUseConsumableFinished; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnUseConsumableStarted; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnUseConsumableCancelled; // 0xd0(0x10)
	struct FMulticastInlineDelegate OnUseConsumablePrevented; // 0xe0(0x10)
	struct UAnimMontage* FallbackUseMontage; // 0xf0(0x08)
	struct UTigerConsumableAsset* QuickUseConsumable; // 0xf8(0x08)
	struct UTigerBuff* MovableBuffClass; // 0x100(0x08)
	int32_t CancelConsumableUseOnTraversalAction; // 0x108(0x04)
	char pad_10C[0x4]; // 0x10c(0x04)
	struct ATigerPlayer* Player; // 0x110(0x08)
	struct UAnimMontage* CurrentMontage; // 0x118(0x08)
	struct UTigerConsumableAsset* CurrentConsumable; // 0x120(0x08)
	struct UTigerConsumableAsset* QuickConsumables[0x6]; // 0x128(0x30)
	char pad_158[0x30]; // 0x158(0x30)

	void UseCallback(); // Function Tiger.TigerConsumablesComponent.UseCallback // (Final|Native|Private) // @ game+0x126aa70
	bool TriggerUseQuickUseConsumable(); // Function Tiger.TigerConsumablesComponent.TriggerUseQuickUseConsumable // (Final|Native|Public|BlueprintCallable) // @ game+0x126a9c0
	bool TriggerUseConsumable(struct UTigerConsumableAsset* Consumable); // Function Tiger.TigerConsumablesComponent.TriggerUseConsumable // (Final|Native|Public|BlueprintCallable) // @ game+0x126a920
	bool TriggerDropConsumable(struct UTigerConsumableAsset* Consumable); // Function Tiger.TigerConsumablesComponent.TriggerDropConsumable // (Final|Native|Public|BlueprintCallable) // @ game+0x126a880
	void TigerDelegateConsumableSuccessfullyFinishedUse__DelegateSignature(struct UTigerConsumableAsset* Consumable); // DelegateFunction Tiger.TigerConsumablesComponent.TigerDelegateConsumableSuccessfullyFinishedUse__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x16c0340
	void TigerDelegateConsumableStartedUse__DelegateSignature(struct UTigerConsumableAsset* Consumable); // DelegateFunction Tiger.TigerConsumablesComponent.TigerDelegateConsumableStartedUse__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x16c0340
	void TigerDelegateConsumablePrevented__DelegateSignature(struct UTigerConsumableAsset* Consumable); // DelegateFunction Tiger.TigerConsumablesComponent.TigerDelegateConsumablePrevented__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x16c0340
	void TigerDelegateConsumableCancelledUse__DelegateSignature(struct UTigerConsumableAsset* Consumable); // DelegateFunction Tiger.TigerConsumablesComponent.TigerDelegateConsumableCancelledUse__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x16c0340
	void Server_UseConsumable(struct UTigerConsumableAsset* Consumable); // Function Tiger.TigerConsumablesComponent.Server_UseConsumable // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x126a6d0
	void Server_StopUseConsumable(struct UTigerConsumableAsset* InConsumable); // Function Tiger.TigerConsumablesComponent.Server_StopUseConsumable // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x126a610
	void OnTraversalAction(struct ATigerPlayer* InPlayer, enum class ETigerTraversalAction InTraversalAction); // Function Tiger.TigerConsumablesComponent.OnTraversalAction // (Final|Native|Private) // @ game+0x126a0d0
	void Multicast_StopUseConsumable(struct UTigerConsumableAsset* InConsumable); // Function Tiger.TigerConsumablesComponent.Multicast_StopUseConsumable // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x1269f70
	void Multicast_SimulateUseConsumable(struct UTigerConsumableAsset* Consumable, float UseTime); // Function Tiger.TigerConsumablesComponent.Multicast_SimulateUseConsumable // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x1269ea0
	bool IsUsingConsumable(); // Function Tiger.TigerConsumablesComponent.IsUsingConsumable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1269ca0
	bool IsPlayingConsumableMontage(); // Function Tiger.TigerConsumablesComponent.IsPlayingConsumableMontage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1269c40
	float GetUseProgress(); // Function Tiger.TigerConsumablesComponent.GetUseProgress // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1269b90
	struct UTigerConsumableAsset* GetCurrentlyUsingConsumable(); // Function Tiger.TigerConsumablesComponent.GetCurrentlyUsingConsumable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1269b10
	bool GetConsumableAtIndex(int32_t Index, struct UTigerConsumableAsset* Consumable, int32_t Stack); // Function Tiger.TigerConsumablesComponent.GetConsumableAtIndex // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1269920
	void Client_UseConsumableFailed(struct UTigerConsumableAsset* InConsumable); // Function Tiger.TigerConsumablesComponent.Client_UseConsumableFailed // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x1269670
	bool CanPickUpConsumable(struct UTigerConsumableAsset* Consumable); // Function Tiger.TigerConsumablesComponent.CanPickUpConsumable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12692a0
	bool CanBePickedup(struct UTigerConsumableAsset* Consumable); // Function Tiger.TigerConsumablesComponent.CanBePickedup // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x12692a0
};

// Class Tiger.TigerWheelWidget
// Size: 0x2a0 (Inherited: 0x290)
struct UTigerWheelWidget : UTigerMenuWidget {
	float LockCameraForGamepadAfterUseTime; // 0x290(0x04)
	bool bShouldSetMouseLocation; // 0x294(0x01)
	char pad_295[0x3]; // 0x295(0x03)
	struct UTigerWheelInterfaceWidget* Interface; // 0x298(0x08)

	void PrimaryAction(int32_t Index); // Function Tiger.TigerWheelWidget.PrimaryAction // (Native|Protected) // @ game+0x1371d10
	bool OpenWheel(); // Function Tiger.TigerWheelWidget.OpenWheel // (Native|Public|BlueprintCallable) // @ game+0x1371c50
	struct UTigerWheelInterfaceWidget* GetInterfaceWidget(); // Function Tiger.TigerWheelWidget.GetInterfaceWidget // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	bool CloseWheel(bool bTriggerAction); // Function Tiger.TigerWheelWidget.CloseWheel // (Native|Public|BlueprintCallable) // @ game+0x1371160
	void AlternateAction(int32_t Index); // Function Tiger.TigerWheelWidget.AlternateAction // (Native|Protected) // @ game+0x1370f80
};

// Class Tiger.TigerConsumableWheelWidget
// Size: 0x2b8 (Inherited: 0x2a0)
struct UTigerConsumableWheelWidget : UTigerWheelWidget {
	struct ATigerPlayer* Player; // 0x2a0(0x08)
	struct UTigerConsumablesComponent* ConsumablesComponent; // 0x2a8(0x08)
	struct UTigerInventoryComponent* InventoryComponent; // 0x2b0(0x08)
};

// Class Tiger.TigerContextualHelp
// Size: 0xb0 (Inherited: 0x28)
struct UTigerContextualHelp : UObject {
	float LifeTimeInSeconds; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct FText HeaderText; // 0x30(0x18)
	struct FText DescriptionText; // 0x48(0x18)
	struct FName InputAction; // 0x60(0x08)
	bool bShouldHideOnInput; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
	struct TSoftObjectPtr<struct UTexture2D> Icon; // 0x70(0x28)
	int32_t MatchesPlayedLimit; // 0x98(0x04)
	bool bWantsToShow; // 0x9c(0x01)
	char pad_9D[0x3]; // 0x9d(0x03)
	float CooldownInSeconds; // 0xa0(0x04)
	enum class ETigerContextualHelpType ContextualHelpType; // 0xa4(0x01)
	enum class ETigerContextualHelpShouldShowInGameMode ShouldShowInGameMode; // 0xa5(0x01)
	char pad_A6[0xa]; // 0xa6(0x0a)

	void SetupTriggerConditions(struct FTigerContextualHelpContext InContext); // Function Tiger.TigerContextualHelp.SetupTriggerConditions // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x16c0340
	void OnPlayerSpawned(struct ATigerPlayer* InTigerPlayer); // Function Tiger.TigerContextualHelp.OnPlayerSpawned // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	void OnHide(struct ATigerPlayerController* InTigerPlayerController); // Function Tiger.TigerContextualHelp.OnHide // (Event|Public|BlueprintEvent) // @ game+0x16c0340
	bool HasReachedMaxMatchesPlayedLimit(struct FTigerContextualHelpContext InContext); // Function Tiger.TigerContextualHelp.HasReachedMaxMatchesPlayedLimit // (Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1270a70
	void ExtendLifetime(float InLifeTimeInSeconds, enum class ETigerContextualHelpType InType); // Function Tiger.TigerContextualHelp.ExtendLifetime // (Final|Native|Public|BlueprintCallable) // @ game+0x1270510
	bool CanEverShow(struct FTigerContextualHelpContext InContext); // Function Tiger.TigerContextualHelp.CanEverShow // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x12702a0
};

// Class Tiger.TigerContextualHelpComponent
// Size: 0x100 (Inherited: 0xb0)
struct UTigerContextualHelpComponent : UActorComponent {
	struct ATigerPlayerController* TigerPlayerController; // 0xb0(0x08)
	struct UTigerContextualHelpUI* ContextualHelpUI; // 0xb8(0x08)
	struct TArray<struct FTigerCurrentContextualHelp> ActiveContextualHelps; // 0xc0(0x10)
	struct TArray<struct UTigerContextualHelp*> ContextualHelpCandidates; // 0xd0(0x10)
	struct TArray<SoftClassProperty> ContextualHelpTypes; // 0xe0(0x10)
	float CooldownTime; // 0xf0(0x04)
	float MinimumDisplayTime; // 0xf4(0x04)
	char pad_F8[0x8]; // 0xf8(0x08)

	void PrepareContextualHelpComponentsForCurrentSession(struct FTigerContextualHelpContext InContext); // Function Tiger.TigerContextualHelpComponent.PrepareContextualHelpComponentsForCurrentSession // (Final|Native|Protected) // @ game+0x1270d50
	void OnPersistentPlayerStateInitialized(struct ATigerPlayerController* InPlayerController); // Function Tiger.TigerContextualHelpComponent.OnPersistentPlayerStateInitialized // (Final|Native|Protected) // @ game+0x1270cc0
	struct TArray<struct UTigerContextualHelp*> GetCurrentContextualHelpCandidates(); // Function Tiger.TigerContextualHelpComponent.GetCurrentContextualHelpCandidates // (Final|Native|Public|BlueprintCallable) // @ game+0x1270640
};

// Class Tiger.TigerContextualHelpUI
// Size: 0x280 (Inherited: 0x280)
struct UTigerContextualHelpUI : UTigerWidget {

	void OnShowHelpWidget(struct UTigerContextualHelp* InData, enum class ETigerContextualHelpType InType); // Function Tiger.TigerContextualHelpUI.OnShowHelpWidget // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void OnHideHelpWidget(struct UTigerContextualHelp* InData, float OutAnimationDuration, enum class ETigerContextualHelpType InType); // Function Tiger.TigerContextualHelpUI.OnHideHelpWidget // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x16c0340
};

// Class Tiger.TigerCrosshairWidget
// Size: 0x2e0 (Inherited: 0x280)
struct UTigerCrosshairWidget : UTigerWidget {
	enum class ETargetInteraction PreviousInteraction; // 0x280(0x01)
	char pad_281[0x7]; // 0x281(0x07)
	struct UObject* PreviousInteractionObject; // 0x288(0x08)
	struct TWeakObjectPtr<struct ATigerCharacter> PreviousInteractionCharacter; // 0x290(0x08)
	struct UTigerInventoryComponent* Inventory; // 0x298(0x08)
	struct UMaterialInstanceDynamic* ProgressBarMaterial; // 0x2a0(0x08)
	struct UCanvasPanel* RootPanel; // 0x2a8(0x08)
	struct ATigerPlayer* TigerPlayer; // 0x2b0(0x08)
	struct UTigerWeaponCrosshairWidget* CurrentWeaponCrosshair; // 0x2b8(0x08)
	struct TArray<struct UTigerWeaponCrosshairWidget*> PreviousWeaponCrosshairs; // 0x2c0(0x10)
	float ProgressValue; // 0x2d0(0x04)
	enum class ETigerUIColor CurrentProgressBarColor; // 0x2d4(0x01)
	char pad_2D5[0xb]; // 0x2d5(0x0b)

	void UpdateInteraction(enum class ETargetInteraction Interaction, struct UObject* InteractionObject); // Function Tiger.TigerCrosshairWidget.UpdateInteraction // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void SetProgressBarColor(enum class ETigerUIColor UIColor); // Function Tiger.TigerCrosshairWidget.SetProgressBarColor // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void OnShowHitMarker(struct FLinearColor HitmarkerColor, bool bWasDownedOrKilled); // Function Tiger.TigerCrosshairWidget.OnShowHitMarker // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x16c0340
	void OnInventoryUpdated(); // Function Tiger.TigerCrosshairWidget.OnInventoryUpdated // (Event|Public|BlueprintEvent) // @ game+0x16c0340
};

// Class Tiger.TigerCrowdAgentComponent
// Size: 0xb8 (Inherited: 0xb0)
struct UTigerCrowdAgentComponent : UActorComponent {
	char pad_B0[0x8]; // 0xb0(0x08)
};

// Class Tiger.TigerCSVTable
// Size: 0x40 (Inherited: 0x28)
struct UTigerCSVTable : UObject {
	char pad_28[0x18]; // 0x28(0x18)

	void WriteToFile(struct FString Filename, struct FString Path); // Function Tiger.TigerCSVTable.WriteToFile // (Final|Native|Public|BlueprintCallable) // @ game+0x1271320
	void SetValueString(int32_t Row, int32_t Column, struct FString Value); // Function Tiger.TigerCSVTable.SetValueString // (Final|Native|Public|BlueprintCallable) // @ game+0x1270f40
	void SetValueFloat(int32_t Row, int32_t Column, float Value); // Function Tiger.TigerCSVTable.SetValueFloat // (Final|Native|Public|BlueprintCallable) // @ game+0x1270e00
	int32_t AddColumn(struct FString ColumnName); // Function Tiger.TigerCSVTable.AddColumn // (Final|Native|Public|BlueprintCallable) // @ game+0x1270150
	void AccumulateValue(int32_t Row, int32_t Column, float Value); // Function Tiger.TigerCSVTable.AccumulateValue // (Final|Native|Public|BlueprintCallable) // @ game+0x126ffe0
};

// Class Tiger.TigerDamageTriggerVolume
// Size: 0x280 (Inherited: 0x260)
struct ATigerDamageTriggerVolume : ATriggerVolume {
	float DamagePerSecond; // 0x260(0x04)
	bool bOnlyDamageKindred; // 0x264(0x01)
	bool bDoNotDamageDowned; // 0x265(0x01)
	char pad_266[0x2]; // 0x266(0x02)
	float DamageRate; // 0x268(0x04)
	bool bEnableDamage; // 0x26c(0x01)
	char pad_26D[0x3]; // 0x26d(0x03)
	struct TArray<struct FDamageTriggerOverlapData> OverlappingCharacters; // 0x270(0x10)

	void OnEndOverlap(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function Tiger.TigerDamageTriggerVolume.OnEndOverlap // (Final|Native|Private) // @ game+0x1270bf0
	void OnBeginOverlap(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function Tiger.TigerDamageTriggerVolume.OnBeginOverlap // (Final|Native|Private) // @ game+0x1270b20
};

// Class Tiger.TigerDamageBase
// Size: 0x40 (Inherited: 0x40)
struct UTigerDamageBase : UDamageType {
};

// Class Tiger.DmgType_Ranged
// Size: 0x40 (Inherited: 0x40)
struct UDmgType_Ranged : UTigerDamageBase {
};

// Class Tiger.DmgType_RangedCritical
// Size: 0x40 (Inherited: 0x40)
struct UDmgType_RangedCritical : UDmgType_Ranged {
};

// Class Tiger.DmgType_Melee
// Size: 0x40 (Inherited: 0x40)
struct UDmgType_Melee : UTigerDamageBase {
};

// Class Tiger.DmgType_Discipline
// Size: 0x40 (Inherited: 0x40)
struct UDmgType_Discipline : UTigerDamageBase {
};

// Class Tiger.DmgType_DisciplineFOTT
// Size: 0x40 (Inherited: 0x40)
struct UDmgType_DisciplineFOTT : UDmgType_Discipline {
};

// Class Tiger.DmgType_DOT
// Size: 0x40 (Inherited: 0x40)
struct UDmgType_DOT : UTigerDamageBase {
};

// Class Tiger.DmgType_ToreadorDOT
// Size: 0x40 (Inherited: 0x40)
struct UDmgType_ToreadorDOT : UDmgType_DOT {
};

// Class Tiger.DmgType_GameInflicted
// Size: 0x40 (Inherited: 0x40)
struct UDmgType_GameInflicted : UTigerDamageBase {
};

// Class Tiger.DmgType_Environmental
// Size: 0x40 (Inherited: 0x40)
struct UDmgType_Environmental : UDmgType_GameInflicted {
};

// Class Tiger.DmgType_Mosquito
// Size: 0x40 (Inherited: 0x40)
struct UDmgType_Mosquito : UDmgType_GameInflicted {
};

// Class Tiger.DmgType_OutOfBoundsMosquito
// Size: 0x40 (Inherited: 0x40)
struct UDmgType_OutOfBoundsMosquito : UDmgType_GameInflicted {
};

// Class Tiger.TigerDataDependentWidget
// Size: 0x280 (Inherited: 0x280)
struct UTigerDataDependentWidget : UTigerWidget {

	void OnDataLoaded(); // Function Tiger.TigerDataDependentWidget.OnDataLoaded // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
	void ListenToDataLoadingEvent(); // Function Tiger.TigerDataDependentWidget.ListenToDataLoadingEvent // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	bool IsDataLoaded(struct ATigerPlayerController* InTigerPlayerController); // Function Tiger.TigerDataDependentWidget.IsDataLoaded // (Event|Protected|BlueprintEvent) // @ game+0x16c0340
	void CheckDataLoaded(struct ATigerPlayerController* InTigerPlayerController); // Function Tiger.TigerDataDependentWidget.CheckDataLoaded // (Final|Native|Private) // @ game+0x12703b0
};

// Class Tiger.TigerDeathScreen
// Size: 0x2e8 (Inherited: 0x290)
struct UTigerDeathScreen : UTigerMenuWidget {
	char pad_290[0x8]; // 0x290(0x08)
	struct TMap<enum class ETigerKillerType, struct FText> KillerTypeNames; // 0x298(0x50)

	bool ShouldReturnToElysium(); // Function Tiger.TigerDeathScreen.ShouldReturnToElysium // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1271190
	void SetInformation(int32_t InPlayerPlacement, int32_t InNumGroupsAtStart, struct FString InInstigatorPlayerName, enum class ETigerKillerType InKillerType); // Function Tiger.TigerDeathScreen.SetInformation // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x16c0340
	bool CanStartSpectating(); // Function Tiger.TigerDeathScreen.CanStartSpectating // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1270380
};

// Class Tiger.TigerDebugCameraHUD
// Size: 0x318 (Inherited: 0x318)
struct ATigerDebugCameraHUD : ADebugCameraHUD {
};

// Class Tiger.TigerDeferredGroupRetainerBox
// Size: 0x150 (Inherited: 0x150)
struct UTigerDeferredGroupRetainerBox : URetainerBox {

	void Construct(); // Function Tiger.TigerDeferredGroupRetainerBox.Construct // (BlueprintCosmetic|Event|Protected|BlueprintEvent) // @ game+0x16c0340
};

// Class Tiger.TigerDeferredRenderBox
// Size: 0x130 (Inherited: 0x120)
struct UTigerDeferredRenderBox : UContentWidget {
	char pad_120[0x10]; // 0x120(0x10)
};

// Class Tiger.TigerDestroySessionAsync
// Size: 0x78 (Inherited: 0x30)
struct UTigerDestroySessionAsync : UBlueprintAsyncActionBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFailed; // 0x40(0x10)
	char pad_50[0x28]; // 0x50(0x28)

	struct UTigerDestroySessionAsync* DestroySession(struct UObject* WorldContextObject, enum class ESessionType SESSIONTYPE); // Function Tiger.TigerDestroySessionAsync.DestroySession // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1270440
};

// Class Tiger.TigerDialogueInteractionScreen
// Size: 0x2b0 (Inherited: 0x290)
struct UTigerDialogueInteractionScreen : UTigerMenuWidget {
	float TransitionTime; // 0x290(0x04)
	struct TWeakObjectPtr<struct ATigerBaseNPC> VendorNPC; // 0x294(0x08)
	struct TWeakObjectPtr<struct UTigerAnimInstance> TargetAnimationInstance; // 0x29c(0x08)
	struct TWeakObjectPtr<struct UTigerInteractiveNpcComponent> InteractiveNpcComponent; // 0x2a4(0x08)
	char pad_2AC[0x4]; // 0x2ac(0x04)

	void TransitionToPlayerCamera(); // Function Tiger.TigerDialogueInteractionScreen.TransitionToPlayerCamera // (Final|Native|Protected|BlueprintCallable) // @ game+0x12712a0
	void TransitionToInteractionCamera(); // Function Tiger.TigerDialogueInteractionScreen.TransitionToInteractionCamera // (Final|Native|Protected|BlueprintCallable) // @ game+0x1271280
};

// Class Tiger.TigerNpcDialogueList
// Size: 0x90 (Inherited: 0x30)
struct UTigerNpcDialogueList : UDataAsset {
	struct FString DialogueIdBase; // 0x30(0x10)
	struct TMap<struct FString, struct FTigerNpcDialogue> DialogueLines; // 0x40(0x50)
};

// Class Tiger.TigerDialogueManager
// Size: 0x100 (Inherited: 0x28)
struct UTigerDialogueManager : UObject {
	char pad_28[0xd8]; // 0x28(0xd8)

	void SortDialogueLines(struct ATigerPlayerState* InState); // Function Tiger.TigerDialogueManager.SortDialogueLines // (Final|Native|Public|BlueprintCallable) // @ game+0x12711f0
	bool HasMoreDialogue(); // Function Tiger.TigerDialogueManager.HasMoreDialogue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1270a10
